import 'dart:async';

import 'package:european_school_competition_ck/helpers.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import './answer.dart';
import './start.dart';
import 'dart:math';

class cat2questionpage extends StatefulWidget {
  @override
  _cat2questionpageState createState() => _cat2questionpageState();
}

class _cat2questionpageState extends State<cat2questionpage> {
  final questions = const [
//2.28
    {
      'questionText':
          'Ποιο από τα πιο κάτω δεν περιλαμβάνεται στα τέσσερα βασικά θεσμικά όργανα της ΕΕ;',
      'answers': [
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Επιτροπή', 'score': 0},
        {'text': 'Η UNESCO', 'score': 10},
        {'text': 'Το Συμβούλιο της Ευρωπαϊκής Ένωσης', 'score': 0},
      ],
    },

//2.29
    {
      'questionText':
          'Το Ευρωπαϊκό Συμβούλιο, ένα από τέσσερα βασικά θεσμικά όργανα της ΕΕ, όπου συνεδριάζουν οι ηγέτες σε εθνικό και ευρωπαϊκό επίπεδο, θέτει:',
      'answers': [
        {'text': 'Τις γενικές προτεραιότητες της ΕΕ', 'score': 10},
        {'text': 'Τους κανόνες δεοντολογίας της ΕΕ', 'score': 0},
        {
          'text': 'Όρους για τις εξαγωγές προϊόντων των χωρών μελών στην Ασία',
          'score': 0
        },
        {'text': 'Όρια στις ελευθερίες των πολιτών της ΕΕ', 'score': 0},
      ],
    },

//2.30
    {
      'questionText':
          'Στο Ευρωπαϊκό κοινοβούλιο οι άμεσα εκλεγμένοι ευρωβουλευτές εκπροσωπούν:',
      'answers': [
        {'text': 'Τους Ευρωπαίους πολίτες', 'score': 10},
        {'text': 'Τα κόμματά τους', 'score': 0},
        {'text': 'Τις κυβερνήσεις των χωρών τους', 'score': 0},
        {'text': 'Τους εαυτούς τους', 'score': 0},
      ],
    },

//2.31
    {
      'questionText':
          'Η Ευρωπαϊκή Επιτροπή, της οποίας τα μέλη διορίζονται από τις εθνικές κυβερνήσεις, προωθεί:',
      'answers': [
        {'text': 'Τα συμφέροντα κάθε κράτους μέλους', 'score': 0},
        {
          'text': 'Τα συμφέροντα του κράτους μέλους που προεδρεύει κάθε φορά',
          'score': 0
        },
        {'text': 'Τις θέσεις των πέντε πλουσιότερων χωρών της ΕΕ', 'score': 0},
        {'text': 'Τα συμφέροντα της ΕΕ ως συνόλου', 'score': 10},
      ],
    },

//2.32
    {
      'questionText': 'Στο Συμβούλιο της Ευρωπαϊκής Ένωσης οι κυβερνήσεις:',
      'answers': [
        {
          'text': 'Ψηφίζουν τους βουλευτές για το Ευρωπαϊκό Κοινοβούλιο',
          'score': 0
        },
        {
          'text': 'Προασπίζουν τα εθνικά συμφέροντα των χωρών τους',
          'score': 10
        },
        {
          'text': 'Δίνουν συμβουλές στις άλλες χώρες για διάφορους τομείς',
          'score': 0
        },
        {
          'text': 'Ρυθμίζουν τις εισαγωγές προϊόντων από τρίτες χώρες',
          'score': 0
        },
      ],
    },

//2.33
    {
      'questionText': 'Το Ευρωπαϊκό Συμβούλιο έχει:',
      'answers': [
        {'text': 'Δικαστική εξουσία', 'score': 0},
        {'text': 'Νομοθετική εξουσία', 'score': 0},
        {'text': 'Εκτελεστική εξουσία', 'score': 0},
        {
          'text':
              'Την εξουσία να καθορίσει τις γενικές πολιτικές κατευθύνσεις της ΕΕ',
          'score': 10
        },
      ],
    },

//2.34
    {
      'questionText':
          'Το Ευρωπαϊκό Συμβούλιο, με επικεφαλής τον πρόεδρό του και αποτελούμενο από τους αρχηγούς των κρατών μελών και τον πρόεδρο της Επιτροπής, συνεδριάζει:',
      'answers': [
        {'text': 'Κάθε εβδομάδα', 'score': 0},
        {'text': 'Στη Νέα Υόρκη', 'score': 0},
        {'text': 'Τουλάχιστον κάθε 6 μήνες', 'score': 10},
        {'text': 'Κάθε 5 χρόνια', 'score': 0},
      ],
    },

//2.35
    {
      'questionText':
          'Οι συσκέψεις του Ευρωπαϊκού Συμβουλίου είναι στην ουσία:',
      'answers': [
        {'text': 'Σύνοδοι κορυφής', 'score': 10},
        {'text': 'Σύντομες', 'score': 0},
        {'text': 'Ανεπίσημες', 'score': 0},
        {'text': 'Ασήμαντες', 'score': 0},
      ],
    },

//2.36
    {
      'questionText': 'Στο Ευρωπαϊκό Συμβούλιο μετέχει επίσης η/ο:',
      'answers': [
        {'text': 'Πρέσβης των Ηνωμένων Πολιτειών Aμερικής στην ΕΕ', 'score': 0},
        {
          'text':
              'Εκπρόσωπος της Ένωσης για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας',
          'score': 10
        },
        {
          'text': 'Εκπρόσωπος του Oργανισμού Bορειοατλαντικού Συμφώνου (ΝΑΤΟ)',
          'score': 0
        },
        {
          'text': 'Γενικός Γραμματέας του Oργανισμού Hνωμένων Eθνών (ΟΗΕ)',
          'score': 0
        },
      ],
    },

//2.37
    {
      'questionText':
          'Οι σύνοδοι του Ευρωπαϊκού Συμβουλίου πραγματοποιούνται συνήθως:',
      'answers': [
        {'text': 'Σε χώρα εκτός της ΕΕ', 'score': 0},
        {'text': 'Πρωί', 'score': 0},
        {'text': 'Στις Βρυξέλλες', 'score': 10},
        {'text': 'Σαββατοκύριακο', 'score': 0},
      ],
    },

//2.38
    {
      'questionText':
          'Στις συνόδους του Ε.Συμβουλίου οι πρόεδροι του Ε.Συμβουλίου και της Επιτροπής, καθώς και ο ύπατος εκπρόσωπος της ΕΕ για θέματα Εξ.Πολιτικής & Πολ.Ασφάλειας:',
      'answers': [
        {'text': 'Έχουν διπλή ψήφο', 'score': 0},
        {'text': 'Δικαιούνται να παραστούν μέσω τηλεδιάσκεψης', 'score': 0},
        {'text': 'Έχουν δικαίωμα βέτο', 'score': 0},
        {'text': 'Δεν έχουν δικαίωμα ψήφου', 'score': 10},
      ],
    },

//2.39
    {
      'questionText':
          'Το Ε.Συμβούλιο άρχισε να λειτουργεί ανεπίσημα το 1974. Το 1992 απέκτησε επίσημο καθεστώς, όμως έγινε ένα από τα 7 θεσμικά όργανα της ΕΕ το:',
      'answers': [
        {'text': '2009', 'score': 10},
        {'text': '1995', 'score': 0},
        {'text': '2000', 'score': 0},
        {'text': '2003', 'score': 0},
      ],
    },

//2.40
    {
      'questionText':
          'Κατά την άτυπη σύνοδό τους στις Βρυξέλλες οι αρχηγοί κρατών ή κυβερνήσεων της ΕΕ συμφώνησαν ομόφωνα επί του διορισμού του κ. Χέρμαν βαν Ρομπουί ως του πρώτου:',
      'answers': [
        {'text': 'Αντιπροέδρου του Ευρωπαϊκού Συμβουλίου', 'score': 0},
        {'text': 'Μόνιμου Προέδρου του Ευρωπαϊκού Συμβουλίου', 'score': 10},
        {'text': 'Προέδρου του Ευρωπαϊκού Συμβουλίου', 'score': 0},
        {'text': 'Γραμματέα του Ευρωπαϊκού Συμβουλίου', 'score': 0},
      ],
    },

//2.41
    {
      'questionText':
          'Στο Συμβούλιο της ΕΕ εγκρίνονται νόμοι και συντονίζονται οι εθνικές πολιτικές των χωρών μελών. Στο Συμβούλιο της ΕΕ συμμετέχουν:',
      'answers': [
        {'text': 'Οι δήμαρχοι όλων των χωρών μελών της ΕΕ', 'score': 0},
        {
          'text': 'Οι γενικοί εισαγγελείς όλων των χωρών μελών της ΕΕ',
          'score': 0
        },
        {'text': 'Οι υπουργοί όλων των χωρών μελών της ΕΕ', 'score': 10},
        {'text': 'Οι πρωθυπουργοί όλων των χωρών μελών της ΕΕ', 'score': 0},
      ],
    },

//2.42
    {
      'questionText':
          'Το Συμβούλιο της ΕΕ δεν πρέπει να συγχέεται με το Ευρωπαϊκό Συμβούλιο αλλά ούτε και με:',
      'answers': [
        {'text': 'Τον Oργανισμό Hνωμένων Eθνών (ΟΗΕ)', 'score': 0},
        {'text': 'Τον Oργανισμό Bορειοατλαντικού Συμφώνου (ΝΑΤΟ)', 'score': 0},
        {
          'text':
              'Το Συμβούλιο της Ευρώπης – ένα όργανο που δεν έχει σχέση με την Ευρωπαϊκή Ένωση',
          'score': 10
        },
        {
          'text': 'Την Eθνική Yπηρεσία Aεροναυτικής και Διαστήματος (NASA)',
          'score': 0
        },
      ],
    },

//2.43
    {
      'questionText':
          'Το Συμβούλιο της ΕΕ και το Ευρωπαϊκό κοινοβούλιο έχουν από κοινού τον τελευταίο λόγο για τη νομοθεσία που προτείνει:',
      'answers': [
        {'text': 'Η Διεθνής Ολυμπιακή Επιτροπή', 'score': 0},
        {
          'text': 'Tο Tαμείο Παιδιών του Oργανισμού Hνωμένων Eθνών (UNICEF)',
          'score': 0
        },
        {'text': 'Η Αφρικανική Ένωση', 'score': 0},
        {'text': 'H Ευρωπαϊκή Επιτροπή', 'score': 10},
      ],
    },

//2.44
    {
      'questionText':
          'Το Συμβούλιο της ΕΕ, εξ ονόματος της ΕΕ (σε διάφορους τομείς, όπως το περιβάλλον, το εμπόριο, η ανάπτυξη, η επιστήμη κτλ.), μπορεί να:',
      'answers': [
        {'text': 'Τιμωρεί χώρες μέλη', 'score': 0},
        {'text': 'Υπογράφει διεθνείς συμφωνίες', 'score': 10},
        {'text': 'Ασκεί έλεγχο στις χώρες μέλη', 'score': 0},
        {'text': 'Αποφασίζει εκ μέρους των χωρών μελών', 'score': 0},
      ],
    },

//2.45
    {
      'questionText':
          'Το ποσό των χρημάτων που μπορεί να δαπανήσει η ΕΕ κάθε χρόνο αποφασίζεται από κοινού από το Συμβούλιο της ΕΕ και:',
      'answers': [
        {'text': 'Το Διεθνές Νομισματικό Ταμείο', 'score': 0},
        {'text': 'Το Υπουργείο Οικονομικών των ΗΠΑ', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 10},
        {'text': 'Την Κεντρική Τράπεζα του Βελγίου', 'score': 0},
      ],
    },

//2.46
    {
      'questionText':
          'Οι εθνικές κυβερνήσεις των κρατών μελών της ΕΕ συνεργάζονται για να χαράξουν μια κοινή εξωτερική και αμυντική πολιτική. Το Συμβούλιο της ΕΕ:',
      'answers': [
        {
          'text': 'Είναι ο κύριος φορέας ανάπτυξης της συνεργασίας αυτής',
          'score': 10
        },
        {'text': 'Δεν έχει καμιά ανάμειξη στη συνεργασία αυτή', 'score': 0},
        {
          'text':
              'Συνεργάζεται με τις ΗΠΑ για την εφαρμογή της πολιτικής αυτής',
          'score': 0
        },
        {
          'text':
              'Διαθέτει δικό του στρατό για την εφαρμογή της πολιτικής αυτής',
          'score': 0
        },
      ],
    },

//2.47
    {
      'questionText': 'Ποια είναι τα μέλη του Συμβουλίου της ΕΕ;',
      'answers': [
        {'text': 'Η Γαλλία και το Ηνωμένο Βασίλειο', 'score': 0},
        {
          'text': 'Οι εκάστοτε πέντε πλουσιότερες χώρες μέλη της ΕΕ',
          'score': 0
        },
        {'text': 'Η Γερμανία, η Γαλλία και το Ηνωμένο Βασίλειο', 'score': 0},
        {
          'text':
              'Κάθε χώρα εκπροσωπείται από τον υπουργό της που είναι αρμόδιος για τον εκάστοτε τομέα πολιτικής',
          'score': 10
        },
      ],
    },

//2.48
    {
      'questionText':
          'Ποιος προεδρεύει στις συσκέψεις του Συμβουλίου της ΕΕ για θέματα εξωτερικής πολιτικής;',
      'answers': [
        {'text': 'Ο υπουργός Εξωτερικών της Σουηδίας', 'score': 0},
        {'text': 'Ο γηραιότερος υπουργός Εξωτερικών', 'score': 0},
        {
          'text': 'Ο υπουργός Εξωτερικών με τις περισσότερες θητείες',
          'score': 0
        },
        {
          'text':
              'Το Συμβούλιο των υπουργών Εξωτερικών διαθέτει μόνιμο πρόεδρο',
          'score': 10
        },
      ],
    },

//2.49
    {
      'questionText':
          'Σε όλες τις άλλες συσκέψεις του Συμβουλίου της ΕΕ, πλην των θεμάτων εξωτερικών υποθέσεων, προεδρεύει:',
      'answers': [
        {'text': 'Ο αρμόδιος υπουργός της Γερμανίας', 'score': 0},
        {
          'text':
              'Ο αρμόδιος υπουργός της χώρας μέλους με τον μεγαλύτερο πληθυσμό',
          'score': 0
        },
        {
          'text':
              'Ο αρμόδιος υπουργός της χώρας που ασκεί την εκ περιτροπής προεδρία της ΕΕ',
          'score': 10
        },
        {'text': 'Ο γηραιότερος αρμόδιος υπουργός', 'score': 0},
      ],
    },

//2.50
    {
      'questionText':
          'Το δεύτερο εξάμηνο του 2012, των συσκέψεων του Συμβουλίου της ΕΕ, πλην των θεμάτων εξωτερικών υποθέσεων, προέδρευαν οι αρμόδιοι υπουργοί:',
      'answers': [
        {'text': 'Της Κύπρου', 'score': 10},
        {'text': 'Του Ισραήλ', 'score': 0},
        {'text': 'Της Τουρκίας', 'score': 0},
        {'text': 'Της Ελλάδας', 'score': 0},
      ],
    },

//2.51

    {
      'questionText':
          'Το πρώτο άτομο που διορίστηκε, το 2009, Ύπατος Εκπρόσωπος της ΕΕ για την Εξωτερική Πολιτική και την Πολιτική Ασφάλειας ήταν:',
      'answers': [
        {'text': 'H Aνδρούλα Bασιλείου', 'score': 0},
        {'text': 'Η Kάθριν Άστον (Catherine Ashton)', 'score': 10},
        {'text': 'O Nικηφόρος Διαμαντούρος', 'score': 0},
        {'text': 'O Xέρμαν Βαν Pομπουί (Herman Van Rompuy)', 'score': 0},
      ],
    },

//2.52
    {
      'questionText':
          'Η Ευρωπαϊκή Επιτροπή είναι ένα από τα κύρια θεσμικά όργανα της ΕΕ. Ποιο από τα πιο κάτω δεν περιλαμβάνεται στα καθήκοντά της;',
      'answers': [
        {
          'text':
              'Εκπροσωπεί και προασπίζει τα συμφέροντα της Ευρωπαϊκής Ένωσης στο σύνολό της',
          'score': 0
        },
        {'text': 'Καταρτίζει προτάσεις για νέα νομοθεσία', 'score': 0},
        {
          'text':
              'Διαχειρίζεται την υλοποίηση των πολιτικών και τη διάθεση των κονδυλίων της ΕΕ',
          'score': 0
        },
        {
          'text':
              'Αποφασίζει το ποσό των χρημάτων που μπορεί να δαπανήσει η ΕΕ κάθε χρόνο',
          'score': 10
        },
      ],
    },

//2.53
    {
      'questionText':
          'Πόσοι επίτροποι αποτελούν την πολιτική ηγεσία της Ευρωπαϊκής Επιτροπής  συμπεριλαμβανομένου του Προέδρου της Επιτροπής;',
      'answers': [
        {'text': '28', 'score': 10},
        {'text': '50', 'score': 0},
        {'text': '3', 'score': 0},
        {'text': '1', 'score': 0},
      ],
    },

//2.54
    {
      'questionText':
          'Από ποιες χώρες πρέπει να προέρχονται οι επίτροποι της Ευρωπαϊκής Επιτροπής; ',
      'answers': [
        {'text': 'Από χώρες εκτός της ΕΕ', 'score': 0},
        {'text': 'Από τις Κάτω Χώρες', 'score': 0},
        {'text': 'Ένας από κάθε χώρα μέλος της ΕΕ', 'score': 10},
        {'text': 'Μόνο από την Ελβετία', 'score': 0},
      ],
    },

//2.55
    {
      'questionText':
          'Πόσα χρόνια διαρκεί η θητεία των επιτρόπων της Ευρωπαϊκής Επιτροπής;',
      'answers': [
        {'text': "Εφ όρου ζωής", 'score': 0},
        {'text': '5', 'score': 10},
        {'text': '1', 'score': 0},
        {'text': 'Όσα επιθυμούν οι ίδιοι', 'score': 0},
      ],
    },

//2.56
    {
      'questionText':
          'Κάθε Ευρωπαίος επίτροπος αναλαμβάνει την ευθύνη για συγκεκριμένους τομείς πολιτικής σύμφωνα με τα καθήκοντα που του αναθέτει:',
      'answers': [
        {'text': 'Ο πρόεδρος της Μάλτας', 'score': 0},
        {'text': 'Ο πρόεδρος της Ευρωπαϊκής Επιτροπής', 'score': 10},
        {'text': 'Η Γενική Συνέλευση του ΟΗΕ', 'score': 0},
        {
          'text':
              'Ο Ύπατος Εκπρόσωπος της ΕΕ για την Εξωτερική Πολιτική και την Πολιτική Ασφάλειας',
          'score': 0
        },
      ],
    },

//2.57
    {
      'questionText':
          'Ο Ζαν-κλωντ Γιούνκερ ξεκίνησε τη θητεία του ως πρόεδρος της Ευρωπαϊκής Επιτροπής:',
      'answers': [
        {'text': 'Το 1957', 'score': 0},
        {'text': 'Το 2004', 'score': 0},
        {'text': 'Το 2010', 'score': 0},
        {'text': 'Το 2014', 'score': 10},
      ],
    },

//2.58
    {
      'questionText': 'Ο πρόεδρος της Ευρωπαϊκής Επιτροπής διορίζεται από:',
      'answers': [
        {'text': 'Το Ευρωπαϊκό Συμβούλιο', 'score': 10},
        {'text': 'Το Διεθνές Δικαστήριο της Χάγης', 'score': 0},
        {'text': 'Το Δικαστήριο της Ευρωπαϊκής Ένωσης', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Ταμείο Επενδύσεων', 'score': 0},
      ],
    },

//2.59
    {
      'questionText':
          'Το Ευρωπαϊκό Συμβούλιο διορίζει τους επιτρόπους της Ευρωπαϊκής Επιτροπής πάντοτε σε συμφωνία:',
      'answers': [
        {'text': 'Με τον πρωθυπουργό του Ηνωμένου Βασιλείου', 'score': 0},
        {
          'text': 'Με τον γενικό γραμματέα του Oργανισμού Hνωμένων Eθνών (ΟΗΕ)',
          'score': 0
        },
        {'text': 'Με τον καγκελάριο της Γερμανίας', 'score': 0},
        {'text': 'Με τον διορισθέντα πρόεδρο της Επιτροπής', 'score': 10},
      ],
    },

//2.60
    {
      'questionText':
          'Ποιος είναι απαραίτητο να δώσει την έγκρισή του για τον διορισμό όλων των επιτρόπων, συμπεριλαμβανομένου του προέδρου της Ευρωπαϊκής Επιτροπής;',
      'answers': [
        {'text': 'Η βασίλισσα της Αγγλίας', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 10},
        {'text': 'Το Ευρωπαϊκό Ταμείο Επενδύσεων', 'score': 0},
        {'text': 'Ο Ευρωπαίος Επόπτης Προστασίας Δεδομένων', 'score': 0},
      ],
    },

//2.61
    {
      'questionText':
          'Κατά τη θητεία τους, τόσο ο πρόεδρος όσο και οι επίτροποι της Ευρωπαϊκής Επιτροπής εξακολουθούν να είναι υπόλογοι στο Ευρωπαϊκό κοινοβούλιο, το οποίο:',
      'answers': [
        {'text': 'Έχει την εξουσία να καθαιρέσει την Επιτροπή', 'score': 10},
        {
          'text': 'Έχει την εξουσία να αυξήσει τον αριθμό των επιτρόπων',
          'score': 0
        },
        {
          'text': ' Έχει την εξουσία μόνο να μειώσει τον αριθμό των επιτρόπων',
          'score': 0
        },
        {
          'text': 'Έχει την εξουσία να μειώσει τον μισθό των επιτρόπων',
          'score': 0
        },
      ],
    },

//2.62
    {
      'questionText':
          'Για την καθημερινή λειτουργία της Ευρωπαϊκής Επιτροπής μεριμνά το προσωπικό της που είναι κατανεμημένο σε διάφορες υπηρεσίες, γνωστές ως:',
      'answers': [
        {'text': 'Μικρές Επιτροπές', 'score': 0},
        {'text': 'Τμήματα', 'score': 0},
        {'text': 'Γενικές Διευθύνσεις (ΓΔ)', 'score': 10},
        {'text': 'Υπηρεσίες', 'score': 0},
      ],
    },

//2.63
    {
      'questionText':
          'Η Επιτροπή προασπίζει τα συμφέροντα της ΕΕ στο σύνολό της. Επιβλέπει & υλοποιεί τις πολιτικές της ΕΕ (ένα από τα πιο κάτω είναι λάθος):',
      'answers': [
        {
          'text': 'Προτείνοντας νέους νόμους στο Κοινοβούλιο και στο Συμβούλιο',
          'score': 0
        },
        {
          'text':
              'Διαχειριζόμενη τον προϋπολογισμό της ΕΕ και κατανέμοντας τα διαθέσιμα κονδύλια',
          'score': 0
        },
        {
          'text':
              'Μεριμνώντας για την εφαρμογή του δικαίου της ΕΕ (μαζί με το Δικαστήριο)',
          'score': 0
        },
        {
          'text':
              'Εκπροσωπώντας την Ευρωπαϊκή Ένωση στον Oργανισμό Hνωμένων Eθνών (ΟΗΕ)',
          'score': 10
        },
      ],
    },

//2.64
    {
      'questionText':
          'Η Επιτροπή έχει το «δικαίωμα της πρωτοβουλίας», μπορεί δηλαδή να προτείνει νέους νόμους για να προστατεύσει τα συμφέροντα της ΕΕ, μόνο για θέματα: ',
      'answers': [
        {'text': 'Άμυνας', 'score': 0},
        {
          'text':
              'Που δεν είναι δυνατόν να αντιμετωπισθούν αποτελεσματικά σε εθνικό ή περιφερειακό επίπεδο',
          'score': 10
        },
        {'text': 'Γεωργίας', 'score': 0},
        {'text': 'Διαστήματος', 'score': 0},
      ],
    },

//2.65
    {
      'questionText':
          'Όταν καταρτιστεί μια νομοθετική πρόταση, και συμφωνούν τουλάχιστον οι 14 από τους 28 επιτρόπους, τότε η πρόταση υποβάλλεται, για συζήτηση, τροποποίηση ή έγκριση:',
      'answers': [
        {'text': 'Στο Συμβούλιο και το Κοινοβούλιο', 'score': 10},
        {
          'text': 'Στο Συμβούλιο και τη Διεθνή Ποδοσφαιρική Oμοσπονδία (FIFA)',
          'score': 0
        },
        {
          'text':
              'Στο Κοινοβούλιο και τη Διεθνή Ποδοσφαιρική Oμοσπονδία (FIFA)',
          'score': 0
        },
        {'text': 'Στο Ευρωπαϊκό Ταμείο Επενδύσεων', 'score': 0},
      ],
    },

//2.66
    {
      'questionText':
          'Η Επιτροπή διαχειρίζεται τα κονδύλια για τις πολιτικές της ΕΕ (π.χ. για τη γεωργία και την αγροτική ανάπτυξη) καθώς και προγράμματα όπως:',
      'answers': [
        {'text': 'Το Apollo-2', 'score': 0},
        {'text': 'Το Erasmus+', 'score': 10},
        {'text': 'Το Soyuz', 'score': 0},
        {'text': 'Το Shenzhou-9', 'score': 0},
      ],
    },

//2.67
    {
      'questionText':
          'H Ευρωπαϊκή Επιτροπή ελέγχει κατά πόσο κάθε χώρα μέλος εφαρμόζει ορθά το δίκαιο της ΕΕ. Για αυτό το λόγο ονομάζεται και:',
      'answers': [
        {'text': 'Τερματοφύλακας των Συνθηκών', 'score': 0},
        {'text': 'Θεματοφύλακας των Συνθηκών', 'score': 10},
        {'text': 'Ρομπέν των Ευρωπαίων', 'score': 0},
        {'text': 'Προστάτης των αδικημένων', 'score': 0},
      ],
    },

//2.68
    {
      'questionText':
          'Η Ευρωπαϊκή Επιτροπή διαθέτει γραφεία σε κάθε χώρα της ΕΕ. Έχει την έδρα της:',
      'answers': [
        {'text': 'Στις Βρυξέλλες και το Λουξεμβούργο', 'score': 10},
        {'text': 'Στις Βρυξέλλες και την Αθήνα', 'score': 0},
        {'text': 'Στις Βρυξέλλες και το Τορόντο', 'score': 0},
        {'text': 'Στις Βρυξέλλες και την Ιερουσαλήμ', 'score': 0},
      ],
    },

//2.69
    {
      'questionText':
          'Η ομοιόμορφη ερμηνεία και εφαρμογή του δικαίου της ΕΕ σε όλες τις χώρες μέλη της διασφαλίζεται από:',
      'answers': [
        {'text': 'Το Διεθνές Δικαστήριο της Χάγης', 'score': 0},
        {'text': ' Τον Οργανισμό Ηνωμένων Eθνών (ΟΗΕ) ', 'score': 0},
        {'text': 'Το Δικαστήριο της Ευρωπαϊκής Ένωσης ', 'score': 10},
        {
          'text': ' Την Ευρωπαϊκή Οικονομική και Κοινωνική Επιτροπή',
          'score': 0
        },
      ],
    },

//2.70
    {
      'questionText':
          'Το Δικαστήριο της Ευρωπαϊκής Ένωσης διευθετεί τις νομικές διαφορές μεταξύ των κυβερνήσεων των χωρών μελών και:',
      'answers': [
        {'text': 'Των ΗΠΑ', 'score': 0},
        {'text': 'Χωρών που δεν είναι μέλη της ΕΕ', 'score': 0},
        {'text': 'Των θεσμικών οργάνων της ΕΕ', 'score': 10},
        {'text': 'Διεθνών οργανισμών', 'score': 0},
      ],
    },

//2.71
    {
      'questionText': 'Στο Δικαστήριο της Ευρωπαϊκής Ένωσης μετέχουν:',
      'answers': [
        {'text': 'Δύο δικαστές', 'score': 0},
        {'text': 'Πενήντα δικαστές', 'score': 0},
        {'text': 'Ένας δικαστής από κάθε χώρα της ΕΕ', 'score': 10},
        {'text': 'Ένας δικαστής', 'score': 0},
      ],
    },

//2.72
    {
      'questionText':
          'Στο Δικαστήριο της Ευρωπαϊκής Ένωσης η θητεία κάθε δικαστή και γενικού εισαγγελέα είναι εξαετής. Ο διορισμός τους γίνεται κατόπιν συμφωνίας:',
      'answers': [
        {'text': 'Της Τουρκίας και του Σαν Μαρίνο', 'score': 0},
        {'text': 'Των κυβερνήσεων των χωρών της ΕΕ', 'score': 10},
        {'text': 'Της Νορβηγίας και του Καναδά', 'score': 0},
        {'text': 'Των μελών του ΝΑΤΟ', 'score': 0},
      ],
    },

//2.73
    {
      'questionText': 'Το Δικαστήριο της Ευρωπαϊκής Ένωσης ιδρύθηκε το:',
      'answers': [
        {'text': '2012', 'score': 0},
        {'text': '1787', 'score': 0},
        {'text': '1786', 'score': 0},
        {'text': '1952', 'score': 10},
      ],
    },

//2.74
    {
      'questionText': 'Η έδρα του Δικαστηρίου της ΕΕ βρίσκεται:',
      'answers': [
        {'text': 'Στο Λουξεμβούργο', 'score': 10},
        {'text': 'Στη Ζυρίχη', 'score': 0},
        {'text': 'Στην Κωνσταντινούπολη', 'score': 0},
        {'text': 'Στο Δουβλίνο', 'score': 0},
      ],
    },

//2.75
    {
      'questionText':
          'Το Ελεγκτικό Συνέδριο της ΕΕ ιδρύθηκε το 1975 και έχει την έδρα του στο Λουξεμβούργο. Ποιο είναι το έργο του;',
      'answers': [
        {'text': 'Να διοργανώνει εκδηλώσεις για την ΕΕ', 'score': 0},
        {
          'text': 'Να ελέγχει τις πωλήσεις αυτοκινήτων στις χώρες της ΕΕ',
          'score': 0
        },
        {'text': 'Να ελέγχει τα οικονομικά της ΕΕ', 'score': 10},
        {'text': 'Να προστατεύει από τρομοκρατικές ενέργειες', 'score': 0},
      ],
    },

//2.76
    {
      'questionText':
          'Εκπρόσωποι των εργοδοτών και των εργαζομένων καθώς και άλλων ομάδων μπορούν να διατυπώνουν τις απόψεις τους επί ζητημάτων της ΕΕ μέσω:',
      'answers': [
        {'text': 'Σιωπηρής διαμαρτυρίας', 'score': 0},
        {
          'text': 'Της Ευρωπαϊκής Οικονομικής και Κοινωνικής Επιτροπής (ΕΟΚΕ)',
          'score': 10
        },
        {'text': 'Του Υπουργείου Εξωτερικών της Αυστρίας', 'score': 0},
        {'text': 'Ταχυδρομείου', 'score': 0},
      ],
    },

//2.77
    {
      'questionText':
          'Η ΕΟΚΕ παρέχει γνωμοδοτήσεις στα μεγαλύτερα θεσμικά όργανα, ιδίως το Συμβούλιο, την Επιτροπή και το Ευρωπαϊκό κοινοβούλιο. Πρόκειται για: ',
      'answers': [
        {'text': 'Γραφείο παραπόνων', 'score': 0},
        {'text': 'Γραφείο ευημερίας', 'score': 0},
        {'text': 'Δεξαμενή σκέψης', 'score': 0},
        {'text': 'Συμβουλευτικό όργανο', 'score': 10},
      ],
    },

//2.78
    {
      'questionText':
          'Η ΕΟΚΕ παρέχει στις ομάδες συμφερόντων της Ευρώπης, π.χ. συνδικαλιστές, εργοδότες, γεωργούς, βήμα για να διατυπώνουν τις απόψεις τους σχετικά:',
      'answers': [
        {'text': 'Με τις νομοθετικές προτάσεις της ΕΕ', 'score': 10},
        {'text': 'Με τους θεσμούς της ΕΕ', 'score': 0},
        {'text': 'Με το προσωπικό της Ευρωπαϊκής Επιτροπής', 'score': 0},
        {'text': 'Με το Ελεγκτικό Συνέδριο της ΕΕ', 'score': 0},
      ],
    },

//2.79
    {
      'questionText':
          'Ο αριθμός των μελών της ΕΟΚΕ από κάθε κράτος μέλος είναι ανάλογος του εθνικού πληθυσμού. Το Λουξεμβούργο και η Κύπρος έχουν:',
      'answers': [
        {'text': 'Τα πιο λίγα μέλη', 'score': 10},
        {'text': 'Τα πιο πολλά μέλη', 'score': 0},
        {'text': 'Έξι μέλη', 'score': 0},
        {'text': 'Μηδέν μέλη', 'score': 0},
      ],
    },

//2.80
    {
      'questionText':
          'Η Επιτροπή των Περιφερειών είναι ένα συμβουλευτικό σώμα. Ποιους εκπροσωπεί;',
      'answers': [
        {
          'text':
              'Τις τοπικές και περιφερειακές αρχές των χωρών μελών της Ευρωπαϊκής Ένωσης',
          'score': 10
        },
        {'text': 'Τις μειονότητες', 'score': 0},
        {'text': 'Τους εθνικιστές της ΕΕ', 'score': 0},
        {'text': 'Τις μικρές χώρες μέλη της ΕΕ', 'score': 0},
      ],
    },

//SOS
//2.81
    {
      'questionText':
          'Ποια από τις πιο κάτω δεν ανήκει στις κύριες πολιτικές οικογένειες της ΕΕ;',
      'answers': [
        {'text': 'Eυρωπαϊκό Λαϊκό Κόμμα', 'score': 0},
        {'text': 'Κόμμα των Ευρωπαίων Σοσιαλιστών', 'score': 0},
        {
          'text':
              'Ομάδα της Συμμαχίας Φιλελευθέρων και Δημοκρατών για την Ευρώπη',
          'score': 0
        },
        {'text': 'Ένωση Φίλων της Ευρώπης', 'score': 10},
      ],
    },

//ΣΟΣ
//2.82
    {
      'questionText':
          'H Ευρωπαϊκή Τράπεζα Επενδύσεων δανείζεται χρήματα από τις αγορές κεφαλαίων και στη συνέχεια τα δανείζει με χαμηλά επιτόκια. H Ευρωπαϊκή Τράπεζα Επενδύσεων ανήκει:',
      'answers': [
        {'text': 'Στη Γερμανία', 'score': 0},
        {'text': 'Στα 28 κράτη μέλη της ΕΕ', 'score': 10},
        {'text': 'Στην Ελβετία', 'score': 0},
        {'text': 'Στις ΗΠΑ', 'score': 0},
      ],
    },

//2.83
    {
      'questionText':
          'Η Ευρωπαϊκή Τράπεζα Επενδύσεων στηρίζει έργα σε όλα τα κράτη μέλη της ΕΕ και επενδύει:',
      'answers': [
        {'text': 'Σε μελλοντικά κράτη μέλη και χώρες εταίρους', 'score': 10},
        {'text': 'Σε ομόλογα', 'score': 0},
        {'text': 'Σε αξιόγραφα', 'score': 0},
        {'text': 'Σε ακίνητα', 'score': 0},
      ],
    },

//2.84
    {
      'questionText':
          'Η Ευρωπαϊκή Τράπεζα Επενδύσεων λειτουργεί σε μη κερδοσκοπική βάση και δανείζει χρήματα με επιτόκια που πλησιάζουν:',
      'answers': [
        {'text': 'Το 20%', 'score': 0},
        {'text': 'Το 15%', 'score': 0},
        {'text': 'Το κόστος δανεισμού της', 'score': 10},
        {'text': 'Το 10%', 'score': 0},
      ],
    },

//2.85
    {
      'questionText': 'Η Ευρωπαϊκή κεντρική Τράπεζα (ΕΚΤ) είναι:',
      'answers': [
        {'text': 'Απολύτως ανεξάρτητη', 'score': 10},
        {'text': 'Η μεγαλύτερη τράπεζα στον κόσμο', 'score': 0},
        {
          'text':
              'Υπό τον έλεγχο των κεντρικών τραπεζών της Γερμανίας και του Ηνωμένου Βασιλείου',
          'score': 0
        },
        {
          'text':
              'Εξαρτημένη από τις κεντρικές τράπεζες της Κίνας και της Ιαπωνίας',
          'score': 0
        },
      ],
    },

//2.86
    {
      'questionText':
          'Η Ευρωπαϊκή κεντρική Τράπεζα που είναι ένα από τα θεσμικά όργανα της ΕΕ και εδρεύει στη Φρανκφούρτη της Γερμανίας:',
      'answers': [
        {
          'text': 'Διαχειρίζεται όλα τα νομίσματα των χωρών μελών της ΕΕ',
          'score': 0
        },
        {'text': 'Διοικείται από τη Γερμανία', 'score': 0},
        {'text': 'Διοικείται από τις 5 πλουσιότερες χώρες της ΕΕ', 'score': 0},
        {
          'text':
              'Διαχειρίζεται το ευρώ και διαφυλάσσει τη σταθερότητα των τιμών στην ΕΕ',
          'score': 10
        },
      ],
    },

//2.87
    {
      'questionText':
          'Στο πλαίσιο του Ευρωπαϊκού Συστήματος κεντρικών Τραπεζών (ΕΣΚΤ), με ποιες τράπεζες συνεργάζεται η Ευρωπαϊκή κεντρική Τράπεζα;',
      'answers': [
        {'text': 'Με το Διεθνές Νομισματικό Ταμείο', 'score': 0},
        {
          'text': 'Με τις κεντρικές τράπεζες και των 28 κρατών μελών της ΕΕ',
          'score': 10
        },
        {
          'text': 'Με τις μεγαλύτερες ιδιωτικές τράπεζες κάθε κράτους μέλους',
          'score': 0
        },
        {'text': 'Με την Κεντρική Τράπεζα των ΗΠΑ', 'score': 0},
      ],
    },

//2.88
    {
      'questionText':
          'Ο Ευρωπαίος Διαμεσολαβητής διερευνά καταγγελίες σχετικά:',
      'answers': [
        {'text': 'Με βία στην οικογένεια', 'score': 0},
        {'text': 'Με βία στα γήπεδα της Ευρώπης', 'score': 0},
        {
          'text':
              'Με τα θεσμικά όργανα, τις υπηρεσίες και τους οργανισμούς της ΕΕ',
          'score': 01
        },
        {'text': 'Με ρατσιστικά κινήματα', 'score': 0},
      ],
    },

//2.89
    {
      'questionText': 'Ο Ευρωπαίος Διαμεσολαβητής:',
      'answers': [
        {
          'text':
              'Είναι απολύτως ανεξάρτητη υπηρεσία και δεν λαμβάνει εντολές από  καμία κυβέρνηση ή οργανισμό',
          'score': 10
        },
        {'text': 'Έχει τυπικό ρόλο', 'score': 0},
        {'text': 'Είναι πάντοτε Έλληνας', 'score': 0},
        {'text': 'Πρέπει να υπακούει στην Ευρωπαϊκή Επιτροπή', 'score': 0},
      ],
    },

//2.90
    {
      'questionText':
          'Η Έμιλυ ο Ράιλι, πρώην εθνική διαμεσολαβήτρια της Ιρλανδίας, εξελέγη τον Ιούλιο του 2013 και η θητεία της ανανεώθηκε τον Δεκέμβριο του 2014:',
      'answers': [
        {'text': 'Εφ όρου ζωής', 'score': 0},
        {'text': 'Για πέντε χρόνια', 'score': 10},
        {'text': 'Για 20 χρόνια', 'score': 0},
        {'text': 'Για 15 χρόνια', 'score': 0},
      ],
    },

//2.91
    {
      'questionText':
          'Ποιοι δικαιούνται να υποβάλουν καταγγελία στον Ευρωπαίο Διαμεσολαβητή;',
      'answers': [
        {
          'text': 'Οι πρόεδροι ή οι πρωθυπουργοί των κρατών μελών της ΕΕ',
          'score': 0
        },
        {'text': 'Οι αρχηγοί της αστυνομίας κάθε κράτους μέλους', 'score': 0},
        {'text': 'Οι γενικοί εισαγγελείς κάθε κράτους μέλους', 'score': 0},
        {
          'text':
              'Πολίτες, επιχειρήσεις, ενώσεις πολιτών, άλλα σωματεία ή όποιος διαμένει σε κράτος μέλος της ΕΕ',
          'score': 10
        },
      ],
    },

//2.92
    {
      'questionText':
          'Η θέση του Ευρωπαίου Επόπτη Προστασίας Δεδομένων (ΕΕΠΔ) δημιουργήθηκε το 2001. Έργο του ΕΕΠΔ είναι να εξασφαλίζει ότι:',
      'answers': [
        {
          'text': 'Τα όργανα και οι οργανισμοί της ΕΕ είναι εχέμυθοι',
          'score': 0
        },
        {
          'text': 'Όλα τα αρχεία της ΕΕ διαγράφονται κάθε πέντε χρόνια',
          'score': 0
        },
        {
          'text':
              'Τα όργανα και οι οργανισμοί της ΕΕ σέβονται το δικαίωμα ιδιωτικής ζωής των πολιτών',
          'score': 10
        },
        {'text': 'Τα απόρρητα έγγραφα της ΕΕ φυλάσσονται σωστά', 'score': 0},
      ],
    },

//2.93
    {
      'questionText':
          'Τι καθήκοντα ασκεί η Υπηρεσία Εκδόσεων της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Εκδοτικού οίκου για τα όργανα της Ένωσης', 'score': 10},
        {'text': 'Αστυνόμευσης', 'score': 0},
        {'text': 'Ασφάλειας των συνόρων', 'score': 0},
        {'text': 'Απέλασης παράνομων οικονομικών μεταναστών', 'score': 0},
      ],
    },

//2.94
    {
      'questionText':
          'Έργο της Ευρωπαϊκής Υπηρεσίας Επιλογής Προσωπικού (ΕΥΕΠ) είναι να διοργανώνει εξετάσεις για την πρόσληψη προσωπικού που θα εργαστεί:',
      'answers': [
        {'text': 'Σε χώρες της Αφρικής', 'score': 0},
        {'text': 'Στην Κίνα', 'score': 0},
        {'text': 'Σε όλα τα όργανα της Ένωσης', 'score': 10},
        {'text': 'Σε εταιρείες του Ντουμπάι', 'score': 0},
      ],
    },

//2.95
    {
      'questionText':
          'Η Ευρωπαϊκή Σχολή Δημόσιας Διοίκησης άρχισε να λειτουργεί στις 10/2/2005. Αποστολή της είναι η παροχή κατάρτισης επί μιας σειράς εξειδικευμένων θεμάτων:',
      'answers': [
        {'text': 'Σε όποιον ενδιαφέρεται', 'score': 0},
        {'text': 'Σε μετανάστες από τρίτες χώρες', 'score': 0},
        {'text': 'Σε μέλη του προσωπικού της ΕΕ', 'score': 10},
        {'text': 'Σε Καναδούς υπηκόους', 'score': 0},
      ],
    },

//ΣΟΣ
//2.96
    {
      'questionText':
          'Το Ευρωπαϊκό Ινστιτούτο καινοτομίας και Τεχνολογίας (EIT) είναι ανεξάρτητος, αποκεντρωμένος φορέας της ΕΕ ο οποίος έχει σκοπό:',
      'answers': [
        {'text': 'Να εξελιχθεί η ΕΕ περισσότερο από τις ΗΠΑ', 'score': 0},
        {
          'text': 'Να ενισχύσει την ικανότητα καινοτομίας της Ένωσης',
          'score': 10
        },
        {'text': 'Να εξελιχθεί η ΕΕ περισσότερο από την Ιαπωνία', 'score': 0},
        {'text': 'Την ανακάλυψη του «σωματιδίου του Θεού»', 'score': 0},
      ],
    },
  ];

  var _qnum = 0;
  var _countnum = 1;
  var _totalScore = 0;
  int seconds = 10;
  bool isCorrect = false;
  int randnum;
  String currentAnswerSelect;

  @override
  void initState() {
    randnum = Random().nextInt(questions.length);
    super.initState();
  }

  void _answerQuestion(dynamic answer) {
    int score = answer['score'];
    _totalScore = _totalScore + score;

    setState(() {
      currentAnswerSelect = answer['text'];
    });

    Timer(Duration(seconds: 1), () {
      if (this.mounted)
        setState(() {
          _qnum = _qnum + 1;
          _countnum = _countnum + 1;
          randnum = Random().nextInt(questions.length);
          currentAnswerSelect = null;
        });
    });

//    print(_qnum);  //test

//    if (_qnum < 10) {  //test
//      print("we have more questions");
//    } else {
//      print('No more questions');
//    }
  }

  String get resultPhrase {
    String resultText;
    if (_totalScore <= 40) {
      resultText = 'You need more practice!';
    } else if (_totalScore <= 70) {
      resultText = 'Good job!';
    } else {
      resultText = 'Congratulations!!!';
    }
    return resultText;
  }

  @override
  Widget build(BuildContext context) {
    SystemChrome.setPreferredOrientations(
        [DeviceOrientation.portraitDown, DeviceOrientation.portraitUp]);
    return MaterialApp(
      home: _qnum < 10
          ? Scaffold(
              appBar: AppBar(
                backgroundColor: Colors.indigoAccent[700],
                title: SafeArea(
                  child: Row(
                    mainAxisAlignment: MainAxisAlignment.spaceBetween,
                    children: <Widget>[
                      Container(
                        child: Text(
                          '$_countnum/10',
                          style: TextStyle(
                            fontSize: 28,
                          ),
                        ),
                      ),
//                      Container(   //for future updates - ADD TIMER
//                        child: Text(
//                          '        $seconds',
//                          style: TextStyle(
//                            fontSize: 28,
//                          ),
//                        ),
//                      ),
                      Container(
                        child: Text(
                          'Score: $_totalScore',
                          style: TextStyle(
                            fontSize: 28,
                          ),
                        ),
                      ),
                    ],
                  ),
                ),
              ),
              body: Column(
                mainAxisAlignment: MainAxisAlignment.spaceBetween,
                children: [
                  SizedBox(),
                  Column(
                    children: <Widget>[
                      Row(
                        mainAxisAlignment: MainAxisAlignment.center,
                        children: <Widget>[
                          new Flexible(
//                          margin: EdgeInsets.fromLTRB(0, 5, 0, 0),
                            child: Container(
                              margin: EdgeInsets.fromLTRB(10, 5, 10, 0),
                              //padding: EdgeInsets.fromLTRB(30, 0, 30, 0),
                              child: Column(
                                crossAxisAlignment: CrossAxisAlignment.center,
                                children: <Widget>[
                                  new Text(
                                    questions[randnum]['questionText'],
                                    style: new TextStyle(
                                      color: Colors.black,
                                      fontSize: getRelativeSize(context, 5.5),
                                      fontWeight: FontWeight.bold,
                                    ),
                                    textAlign: TextAlign.center,
                                  ),
                                ],
                              ),
                            ),
                          ),
                        ],
                      ),
                    ],
                  ),
                  Padding(
                    padding: const EdgeInsets.all(10.0),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.stretch,
                      children: [
                        ...(questions[randnum]['answers']
                                as List<Map<String, Object>>)
                            .map((answer) {
                          return Answer(
                            currentAnswerSelect == null
                                ? () => _answerQuestion(answer)
                                : null,
                            answer['text'],
                            color: currentAnswerSelect == null
                                ? null
                                : answer['text'] == currentAnswerSelect
                                    ? (answer['score'] as int) > 0
                                        ? Colors.greenAccent[400]
                                        : Colors.redAccent[100]
                                    : (answer['score'] as int) > 0
                                        ? Colors.greenAccent[400]
                                        : Colors.amberAccent[100],
                          );
                        }).toList()
                      ],
                    ),
                  ),
                ],
              ),
            )
          : Scaffold(
              backgroundColor: Colors.indigoAccent[700],
              body: Column(
                mainAxisAlignment: MainAxisAlignment.center,
                children: <Widget>[
                  Text(
                    '$resultPhrase',
                    style: TextStyle(
                      color: Colors.white,
                      fontSize: getRelativeSize(context, 12.5),
                      fontWeight: FontWeight.bold,
                    ),
                    textAlign: TextAlign.center,
                  ),
                  Text(
                    'Total score: $_totalScore/100',
                    style: TextStyle(
                      color: Colors.white,
                      fontSize: getRelativeSize(context, 11.5),
                      fontWeight: FontWeight.bold,
                    ),
                    textAlign: TextAlign.center,
                  ),
                  Column(
                    crossAxisAlignment: CrossAxisAlignment.stretch,
                    children: <Widget>[
                      Container(
                        height: 100.0,
                        margin: EdgeInsets.fromLTRB(20, 30, 20, 0),
                        child: ClipRRect(
                          borderRadius: BorderRadius.circular(20.0),
                          child: RaisedButton(
                            onPressed: () {
                              Navigator.pushReplacement(
                                context,
                                MaterialPageRoute(
                                    builder: (context) => cat2questionpage()),
                              );
                            },
                            child: Text(
                              'Play again',
                              style: new TextStyle(
                                  color: Colors.black,
                                  fontSize: getRelativeSize(context, 12),
                                  fontWeight: FontWeight.bold),
                            ),
                            color: Colors.amberAccent,
                          ),
                        ),
                      ),
                    ],
                  ),
                  Column(
                    crossAxisAlignment: CrossAxisAlignment.stretch,
                    children: <Widget>[
                      Container(
                        height: 100.0,
                        margin: EdgeInsets.fromLTRB(20, 20, 20, 0),
                        child: ClipRRect(
                          borderRadius: BorderRadius.circular(20.0),
                          child: RaisedButton(
                            onPressed: () {
                              Navigator.pushReplacement(
                                context,
                                MaterialPageRoute(
                                    builder: (context) => startpage()),
                              );
                            },
                            child: Text(
                              'Main menu',
                              style: new TextStyle(
                                  color: Colors.black,
                                  fontSize: getRelativeSize(context, 12),
                                  fontWeight: FontWeight.bold),
                            ),
                            color: Colors.amberAccent,
                          ),
                        ),
                      ),
                    ],
                  ),
                ],
              ),
            ),
    );
  }
}
