import 'dart:async';

import 'package:european_school_competition_ck/helpers.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import './answer.dart';
import './start.dart';
import 'dart:math';

class questionpage extends StatefulWidget {
  @override
  _questionpageState createState() => _questionpageState();
}

class _questionpageState extends State<questionpage> {
  final questions = const [
//1.1
    {
      'questionText': 'Γιατί δημιουργήθηκε η Ευρωπαϊκή Ένωση;',
      'answers': [
        {
          'text':
              'Για να τεθεί τέλος στους συχνούς πολέμους που κατέληξαν στον Β’ Παγκόσμιο Πόλεμο',
          'score': 10
        },
        {
          'text':
              'Για να αντισταθούν οι Ευρωπαίοι στην οικονομική ανάπτυξη των Ηνωμένων Πολιτειών της Αμερικής',
          'score': 0
        },
        {
          'text':
              'Για να ενωθούν οι δυτικές χώρες της Ευρώπης έναντι των χωρών του Συμφώνου της Βαρσοβίας',
          'score': 0
        },
        {
          'text': 'Για να καταργηθούν τα σύνορα μεταξύ των χωρών της Ευρώπης',
          'score': 0
        },
      ],
    },

//1.2
    {
      'questionText':
          'Ποιος ήταν ο πρόδρομος της δημιουργίας της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Η Κοινωνία των Εθνών', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Κοινότητα Άνθρακα και Χάλυβα', 'score': 10},
        {'text': 'Το Κίνημα των Αδεσμεύτων', 'score': 0},
        {'text': 'Η Κοινοπολιτεία των Εθνών', 'score': 0},
      ],
    },

//1.3
    {
      'questionText':
          'Πότε δημιουργήθηκε η ΕΟΚ (Ευρωπαϊκή οικονομική κοινότητα);',
      'answers': [
        {'text': '9 Μαΐου 1950', 'score': 0},
        {'text': '18 Απριλίου 1951', 'score': 0},
        {'text': '30 Αυγούστου 1954', 'score': 0},
        {'text': '25 Μαρτίου 1957', 'score': 10},
      ],
    },

//1.4
    {
      'questionText':
          'Πότε υπέβαλαν η Ελλάδα και η Τουρκία αίτηση σύνδεσης με την ΕΟΚ;',
      'answers': [
        {'text': '2004', 'score': 0},
        {'text': '1999', 'score': 0},
        {'text': '2012', 'score': 0},
        {'text': '1959', 'score': 10},
      ],
    },

//1.5
    {
      'questionText':
          'Ποιος από τους πιο κάτω δεν περιλαμβάνεται στους ιδρυτές της ΕΕ;',
      'answers': [
        {'text': 'Μιχαήλ Γκορμπατσώφ (Mikhail Gorbachev)', 'score': 10},
        {'text': 'Ουίνστον Τσόρτσιλ (Winston Churchill) ', 'score': 0},
        {'text': 'Ρομπέρ Σουμάν (Robert Schuman)', 'score': 0},
        {'text': 'Αλτιέρο Σπινέλι (Altiero Spinelli)', 'score': 0},
      ],
    },

//1.6
    {
      'questionText':
          'Ο Oυίνστον Tσόρτσιλ, ένας εκ των 11 ανθρώπων που θεωρούνται οι ιδρυτές της ΕΕ, διετέλεσε:',
      'answers': [
        {'text': 'Πρωθυπουργός του Ηνωμένου Βασιλείου', 'score': 10},
        {'text': 'Κυβερνήτης της Κύπρου', 'score': 0},
        {'text': 'Πρωθυπουργός της Πολωνίας', 'score': 0},
        {'text': 'Πρόεδρος των ΗΠΑ', 'score': 0},
      ],
    },

//1.7
    {
      'questionText':
          'Τι καταργήθηκε την 1η Ιουλίου 1968 μεταξύ των έξι, τότε, κρατών μελών της ΕΕ;',
      'answers': [
        {'text': 'Η ελεύθερη διασυνοριακή διακίνηση ανθρώπων', 'score': 0},
        {'text': 'Η απαγόρευση στη μεταφορά κατοικίδιων ζώων', 'score': 0},
        {'text': 'Οι τελωνειακοί δασμοί', 'score': 10},
        {
          'text': 'Η απαγόρευση πώλησης γαλλικής σαμπάνιας εκτός Γαλλίας',
          'score': 0
        },
      ],
    },

//1.8
    {
      'questionText':
          'Ποια από τις πιο κάτω δεν περιλαμβάνεται στις «τέσσερις ελευθερίες» μεταξύ των κρατών μελών της ΕΕ που καθιερώθηκαν με την ολοκλήρωση της Ενιαίας Αγοράς το 1993;',
      'answers': [
        {'text': 'Ελεύθερη κυκλοφορία εφευρέσεων', 'score': 10},
        {'text': 'Ελεύθερη κυκλοφορία αγαθών', 'score': 0},
        {'text': 'Ελεύθερη κυκλοφορία προσώπων', 'score': 0},
        {'text': 'Ελεύθερη κυκλοφορία υπηρεσιών', 'score': 0},
      ],
    },

//1.9
    {
      'questionText':
          'Με ποια συνθήκη η «Ευρωπαϊκή Κοινότητα» μετονομάστηκε, στις 7 Φεβρουαρίου 1992, επίσημα, σε «Ευρωπαϊκή Ένωση»;',
      'answers': [
        {'text': 'Συνθήκη της Λευκωσίας', 'score': 0},
        {'text': 'Συνθήκη των Ευρωπαίων', 'score': 0},
        {'text': 'Συνθήκη του Μάαστριχτ', 'score': 10},
        {'text': 'Συνθήκη των Σεβρών', 'score': 0},
      ],
    },

//1.10
    {
      'questionText':
          'Η συμφωνία του Σένγκεν, που τέθηκε σε εφαρμογή στις 26 Μαρτίου 1995, σε επτά χώρες προνοούσε ότι οι υπήκοοί τους μπορούσαν: ',
      'answers': [
        {
          'text': 'Να αγωνίζονται σε ποδοσφαιρικές ομάδες όποιας χώρας ήθελαν',
          'score': 0
        },
        {'text': 'Να επιλέξουν την υπηκοότητα που προτιμούσαν', 'score': 0},
        {
          'text': 'Να διακινούνται χωρίς έλεγχο διαβατηρίων στα σύνορα',
          'score': 10
        },
        {
          'text':
              'Να επιλέγουν τη χώρα στην οποία θα πληρώνουν φόρο εισοδήματος',
          'score': 0
        },
      ],
    },

//1.11
    {
      'questionText':
          'Στις 13 Δεκεμβρίου 2007 τα 27 κράτη μέλη της ΕΕ υπογράφουν τη Συνθήκη της Λισαβόνας. Ποιος ήταν ο στόχος της;',
      'answers': [
        {
          'text':
              'Να καταστήσει την ΕΕ πιο δημοκρατική, αποτελεσματική και διαφανή',
          'score': 10
        },
        {
          'text': 'Να απαγορεύσει τις εισαγωγές προϊόντων από την Κίνα',
          'score': 0
        },
        {'text': 'Να μειώσει τις εργάσιμες μέρες σε τέσσερις', 'score': 0},
        {
          'text': 'Να μετατραπούν όλες οι γεωργικές καλλιέργειες σε βιολογικές',
          'score': 0
        },
      ],
    },

//1.12
    {
      'questionText':
          'Η σημαία της ΕΕ δεν είναι μόνο σύμβολο της Ευρωπαϊκής Ένωσης, αλλά και:',
      'answers': [
        {'text': 'Της Εθνικής ομάδας καλαθόσφαιρας του Βελγίου', 'score': 0},
        {
          'text': 'Της ενότητας και της ταυτότητας της Ευρώπης γενικότερα',
          'score': 10
        },
        {'text': 'Των μουσικών της Ευρώπης', 'score': 0},
        {'text': 'Των αστρονόμων της Ευρώπης', 'score': 0},
      ],
    },

//1.13
    {
      'questionText':
          'Η σημαία της ΕΕ περιέχει κίτρινα αστέρια, σε κύκλο με μπλε φόντο, ο αριθμός των οποίων είναι:',
      'answers': [
        {'text': 'Όσα τα εκάστοτε κράτη μέλη', 'score': 0},
        {'text': '43', 'score': 0},
        {'text': '1', 'score': 0},
        {'text': '12', 'score': 10},
      ],
    },

//1.14
    {
      'questionText': 'Τα αστέρια σε κύκλο της σημαίας της ΕΕ συμβολίζουν:',
      'answers': [
        {'text': 'Το πλανητικό μας σύστημα', 'score': 0},
        {'text': 'Το φως του πολιτισμού', 'score': 0},
        {'text': 'Το μέλλον ', 'score': 0},
        {
          'text':
              'Τα ιδανικά της ενότητας, της αλληλεγγύης και της αρμονίας ανάμεσα στους λαούς της Ευρώπης',
          'score': 10
        },
      ],
    },

//1.15
    {
      'questionText':
          'Το 1983 η σημαία της ΕΕ, εγκρίθηκε από το Ευρωπαϊκό κοινοβούλιο. Αναγνωρίστηκε από όλους τους ηγέτες της ΕΕ ως το επίσημο έμβλημα της Ευρωπαϊκής Ένωσης το:',
      'answers': [
        {'text': '2013', 'score': 0},
        {'text': '1940', 'score': 0},
        {'text': '1985', 'score': 10},
        {'text': '2012', 'score': 0},
      ],
    },

//1.16
    {
      'questionText': 'Κάθε ευρωπαϊκό όργανο έχει τώρα το δικό του έμβλημα:',
      'answers': [
        {'text': 'Ναι', 'score': 10},
        {'text': 'Όχι', 'score': 0},
        {'text': 'Μόνο το Ευρωκοινοβούλιο', 'score': 0},
        {'text': 'Μόνο η Ευρωπαϊκή Κεντρική Τράπεζα', 'score': 0},
      ],
    },

//1.17
    {
      'questionText':
          'Η Ενάτη Συμφωνία που συνέθεσε ο Λούντβιχ βαν Μπετόβεν το 1823, που μελοποίησε τους στίχους του Φρίντριχ Σίλερ «Ωδή στη Χαρά», χρησιμοποιείται:',
      'answers': [
        {'text': 'Από την Μπάγερν Μονάχου ως ο ύμνος της', 'score': 0},
        {'text': 'Από την ΕΕ ως ο ύμνος της', 'score': 10},
        {
          'text': 'Για να χαλαρώνουν οι υπάλληλοι της Ευρωπαϊκής Επιτροπής',
          'score': 0
        },
        {'text': 'Από την UEFA στα παιχνίδια του Champions League', 'score': 0},
      ],
    },

//1.18
    {
      'questionText': 'Πότε γιορτάζεται η Ημέρα της Ευρώπης;',
      'answers': [
        {'text': 'Την 1η Ιανουαρίου', 'score': 0},
        {'text': 'Στις 9 Μαΐου', 'score': 10},
        {'text': 'Κάθε τέσσερα χρόνια στις 29 Φεβρουαρίου', 'score': 0},
        {'text': 'Δεν υπάρχει Ημέρα της Ευρώπης', 'score': 0},
      ],
    },

//1.19
    {
      'questionText':
          'Οι ιδέες πάνω στις οποίες θεμελιώθηκε η ΕΕ διατυπώθηκαν στις 9 Μαΐου 1910 από τον Ρομπέρ Σουμάν. Για αυτό το λόγο στις 9 Μαΐου τιμάται και η επέτειος της:',
      'answers': [
        {'text': 'Διακήρυξης Σουμάν', 'score': 10},
        {'text': 'Επανάστασης Σουμάν', 'score': 0},
        {'text': 'Ιδέας Σουμάν', 'score': 0},
        {'text': 'Θεμελίωσης', 'score': 0},
      ],
    },

//1.20
    {
      'questionText':
          'Η «Ημέρα της Ευρώπης» δίνει την ευκαιρία για δραστηριότητες και εκδηλώσεις που φέρνουν τα θεσμικά όργανα της ΕΕ πιο κοντά στο ευρύ κοινό και:',
      'answers': [
        {'text': 'Είναι δημόσια αργία στην Κύπρο', 'score': 0},
        {
          'text': 'Είναι η μοναδική κοινή δημόσια αργία στις χώρες της ΕΕ',
          'score': 0
        },
        {
          'text':
              'Μόνο για αυτή τη μέρα εφαρμόζεται η Συμφωνία Σέγκεν σε όλες τις χώρες της ΕΕ',
          'score': 0
        },
        {'text': 'Προάγει την προσέγγιση των λαών της Ευρώπης', 'score': 10},
      ],
    },

//1.21
    {
      'questionText':
          'Το Σύνθημα της ΕΕ τονίζει την απόφαση των Ευρωπαίων να ενωθούν δημιουργώντας την ΕΕ και να συνεργαστούν για την ειρήνη & ευημερία. Το Σύνθημα είναι:',
      'answers': [
        {'text': '«Μαζί μπορούμε»', 'score': 0},
        {'text': '«Ενωμένοι στην πολυμορφία»', 'score': 10},
        {'text': '«Η Ευρώπη δεν είναι μόνη»', 'score': 0},
        {'text': '«Πάντα μαζί»', 'score': 0},
      ],
    },

//1.22
    {
      'questionText': 'Πόσες είναι οι επίσημες γλώσσες στην ΕΕ;',
      'answers': [
        {'text': '24', 'score': 10},
        {'text': '1', 'score': 0},
        {'text': '2', 'score': 0},
        {'text': '33', 'score': 0},
      ],
    },

//1.23
    {
      'questionText':
          'Τα άτομα που ζουν στην ΕΕ έχουν το δικαίωμα να απευθυνθούν γραπτώς στην Ευρωπαϊκή Επιτροπή και να λάβουν απάντηση:',
      'answers': [
        {'text': 'Στα ουγγρικά', 'score': 0},
        {'text': 'Στα ελληνικά', 'score': 0},
        {'text': 'Στην ίδια γλώσσα', 'score': 10},
        {'text': 'Στα σουηδικά', 'score': 0},
      ],
    },

//1.24
    {
      'questionText':
          'Τα μέλη του Ευρωπαϊκού κοινοβουλίου έχουν το δικαίωμα να χρησιμοποιούν οποιαδήποτε από τις επίσημες γλώσσες της ΕΕ, όταν μιλούν:',
      'answers': [
        {'text': 'Μεταξύ τους', 'score': 0},
        {'text': 'Στην καφετέρια', 'score': 0},
        {'text': 'Στο τηλέφωνο', 'score': 0},
        {'text': 'Στο Κοινοβούλιο', 'score': 10},
      ],
    },

//1.25
    {
      'questionText': 'Στις 10 Δεκεμβρίου 2012 απονεμήθηκε στην ΕΕ:',
      'answers': [
        {'text': 'Το Βραβείο Όσκαρ', 'score': 0},
        {'text': 'Το Βραβείο Νόμπελ Χημείας', 'score': 0},
        {'text': 'Η Χρυσή Άρκτος', 'score': 0},
        {'text': 'Το Βραβείο Νόμπελ Ειρήνης', 'score': 10},
      ],
    },

//1.26
    {
      'questionText':
          'Η Νορβηγική Επιτροπή Νόμπελ ανέφερε ότι η βράβευση της ΕΕ βασίστηκε στον ρόλο της ΕΕ ως σταθεροποιητικού παράγοντα, ο οποίος μετέτρεψε την Ευρώπη:',
      'answers': [
        {'text': 'Από ήπειρο πολέμων σε ήπειρο ειρήνης', 'score': 10},
        {'text': 'Σε μια πλούσια ήπειρο', 'score': 0},
        {'text': 'Σε μια γαλήνια περιοχή', 'score': 0},
        {'text': 'Σε ασφαλή τόπο κατοίκησης', 'score': 0},
      ],
    },

//1.27
    {
      'questionText':
          'Η ΕΕ διέθεσε τα χρήματα του Βραβείου Νόμπελ (930.000 ευρώ) που κέρδισε:',
      'answers': [
        {'text': 'Στο διαστημικό της πρόγραμμα', 'score': 0},
        {'text': 'Για την αμυντική της ενίσχυση', 'score': 0},
        {
          'text':
              'Σε προγράμματα στήριξης παιδιών που έχουν πέσει θύματα πολέμων και συγκρούσεων',
          'score': 10
        },
        {'text': 'Για ανέγερση μνημείου ειρήνης', 'score': 0},
      ],
    },

//2.28
    {
      'questionText':
          'Ποιο από τα πιο κάτω δεν περιλαμβάνεται στα τέσσερα βασικά θεσμικά όργανα της ΕΕ;',
      'answers': [
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Επιτροπή', 'score': 0},
        {'text': 'Η UNESCO', 'score': 10},
        {'text': 'Το Συμβούλιο της Ευρωπαϊκής Ένωσης', 'score': 0},
      ],
    },

//2.29
    {
      'questionText':
          'Το Ευρωπαϊκό Συμβούλιο, ένα από τέσσερα βασικά θεσμικά όργανα της ΕΕ, όπου συνεδριάζουν οι ηγέτες σε εθνικό και ευρωπαϊκό επίπεδο, θέτει:',
      'answers': [
        {'text': 'Τις γενικές προτεραιότητες της ΕΕ', 'score': 10},
        {'text': 'Τους κανόνες δεοντολογίας της ΕΕ', 'score': 0},
        {
          'text': 'Όρους για τις εξαγωγές προϊόντων των χωρών μελών στην Ασία',
          'score': 0
        },
        {'text': 'Όρια στις ελευθερίες των πολιτών της ΕΕ', 'score': 0},
      ],
    },

//2.30
    {
      'questionText':
          'Στο Ευρωπαϊκό κοινοβούλιο οι άμεσα εκλεγμένοι ευρωβουλευτές εκπροσωπούν:',
      'answers': [
        {'text': 'Τους Ευρωπαίους πολίτες', 'score': 10},
        {'text': 'Τα κόμματά τους', 'score': 0},
        {'text': 'Τις κυβερνήσεις των χωρών τους', 'score': 0},
        {'text': 'Τους εαυτούς τους', 'score': 0},
      ],
    },

//2.31
    {
      'questionText':
          'Η Ευρωπαϊκή Επιτροπή, της οποίας τα μέλη διορίζονται από τις εθνικές κυβερνήσεις, προωθεί:',
      'answers': [
        {'text': 'Τα συμφέροντα κάθε κράτους μέλους', 'score': 0},
        {
          'text': 'Τα συμφέροντα του κράτους μέλους που προεδρεύει κάθε φορά',
          'score': 0
        },
        {'text': 'Τις θέσεις των πέντε πλουσιότερων χωρών της ΕΕ', 'score': 0},
        {'text': 'Τα συμφέροντα της ΕΕ ως συνόλου', 'score': 10},
      ],
    },

//2.32
    {
      'questionText': 'Στο Συμβούλιο της Ευρωπαϊκής Ένωσης οι κυβερνήσεις:',
      'answers': [
        {
          'text': 'Ψηφίζουν τους βουλευτές για το Ευρωπαϊκό Κοινοβούλιο',
          'score': 0
        },
        {
          'text': 'Προασπίζουν τα εθνικά συμφέροντα των χωρών τους',
          'score': 10
        },
        {
          'text': 'Δίνουν συμβουλές στις άλλες χώρες για διάφορους τομείς',
          'score': 0
        },
        {
          'text': 'Ρυθμίζουν τις εισαγωγές προϊόντων από τρίτες χώρες',
          'score': 0
        },
      ],
    },

//2.33
    {
      'questionText': 'Το Ευρωπαϊκό Συμβούλιο έχει:',
      'answers': [
        {'text': 'Δικαστική εξουσία', 'score': 0},
        {'text': 'Νομοθετική εξουσία', 'score': 0},
        {'text': 'Εκτελεστική εξουσία', 'score': 0},
        {
          'text':
              'Την εξουσία να καθορίσει τις γενικές πολιτικές κατευθύνσεις της ΕΕ',
          'score': 10
        },
      ],
    },

//2.34
    {
      'questionText':
          'Το Ευρωπαϊκό Συμβούλιο, με επικεφαλής τον πρόεδρό του και αποτελούμενο από τους αρχηγούς των κρατών μελών και τον πρόεδρο της Επιτροπής, συνεδριάζει:',
      'answers': [
        {'text': 'Κάθε εβδομάδα', 'score': 0},
        {'text': 'Στη Νέα Υόρκη', 'score': 0},
        {'text': 'Τουλάχιστον κάθε 6 μήνες', 'score': 10},
        {'text': 'Κάθε 5 χρόνια', 'score': 0},
      ],
    },

//2.35
    {
      'questionText':
          'Οι συσκέψεις του Ευρωπαϊκού Συμβουλίου είναι στην ουσία:',
      'answers': [
        {'text': 'Σύνοδοι κορυφής', 'score': 10},
        {'text': 'Σύντομες', 'score': 0},
        {'text': 'Ανεπίσημες', 'score': 0},
        {'text': 'Ασήμαντες', 'score': 0},
      ],
    },

//2.36
    {
      'questionText': 'Στο Ευρωπαϊκό Συμβούλιο μετέχει επίσης η/ο:',
      'answers': [
        {'text': 'Πρέσβης των Ηνωμένων Πολιτειών Aμερικής στην ΕΕ', 'score': 0},
        {
          'text':
              'Εκπρόσωπος της Ένωσης για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας',
          'score': 10
        },
        {
          'text': 'Εκπρόσωπος του Oργανισμού Bορειοατλαντικού Συμφώνου (ΝΑΤΟ)',
          'score': 0
        },
        {
          'text': 'Γενικός Γραμματέας του Oργανισμού Hνωμένων Eθνών (ΟΗΕ)',
          'score': 0
        },
      ],
    },

//2.37
    {
      'questionText':
          'Οι σύνοδοι του Ευρωπαϊκού Συμβουλίου πραγματοποιούνται συνήθως:',
      'answers': [
        {'text': 'Σε χώρα εκτός της ΕΕ', 'score': 0},
        {'text': 'Πρωί', 'score': 0},
        {'text': 'Στις Βρυξέλλες', 'score': 10},
        {'text': 'Σαββατοκύριακο', 'score': 0},
      ],
    },

//2.38
    {
      'questionText':
          'Στις συνόδους του Ε.Συμβουλίου οι πρόεδροι του Ε.Συμβουλίου και της Επιτροπής, καθώς και ο ύπατος εκπρόσωπος της ΕΕ για θέματα Εξ.Πολιτικής & Πολ.Ασφάλειας:',
      'answers': [
        {'text': 'Έχουν διπλή ψήφο', 'score': 0},
        {'text': 'Δικαιούνται να παραστούν μέσω τηλεδιάσκεψης', 'score': 0},
        {'text': 'Έχουν δικαίωμα βέτο', 'score': 0},
        {'text': 'Δεν έχουν δικαίωμα ψήφου', 'score': 10},
      ],
    },

//2.39
    {
      'questionText':
          'Το Ε.Συμβούλιο άρχισε να λειτουργεί ανεπίσημα το 1974. Το 1992 απέκτησε επίσημο καθεστώς, όμως έγινε ένα από τα 7 θεσμικά όργανα της ΕΕ το:',
      'answers': [
        {'text': '2009', 'score': 10},
        {'text': '1995', 'score': 0},
        {'text': '2000', 'score': 0},
        {'text': '2003', 'score': 0},
      ],
    },

//2.40
    {
      'questionText':
          'Κατά την άτυπη σύνοδό τους στις Βρυξέλλες οι αρχηγοί κρατών ή κυβερνήσεων της ΕΕ συμφώνησαν ομόφωνα επί του διορισμού του κ. Χέρμαν βαν Ρομπουί ως του πρώτου:',
      'answers': [
        {'text': 'Αντιπροέδρου του Ευρωπαϊκού Συμβουλίου', 'score': 0},
        {'text': 'Μόνιμου Προέδρου του Ευρωπαϊκού Συμβουλίου', 'score': 10},
        {'text': 'Προέδρου του Ευρωπαϊκού Συμβουλίου', 'score': 0},
        {'text': 'Γραμματέα του Ευρωπαϊκού Συμβουλίου', 'score': 0},
      ],
    },

//2.41
    {
      'questionText':
          'Στο Συμβούλιο της ΕΕ εγκρίνονται νόμοι και συντονίζονται οι εθνικές πολιτικές των χωρών μελών. Στο Συμβούλιο της ΕΕ συμμετέχουν:',
      'answers': [
        {'text': 'Οι δήμαρχοι όλων των χωρών μελών της ΕΕ', 'score': 0},
        {
          'text': 'Οι γενικοί εισαγγελείς όλων των χωρών μελών της ΕΕ',
          'score': 0
        },
        {'text': 'Οι υπουργοί όλων των χωρών μελών της ΕΕ', 'score': 10},
        {'text': 'Οι πρωθυπουργοί όλων των χωρών μελών της ΕΕ', 'score': 0},
      ],
    },

//2.42
    {
      'questionText':
          'Το Συμβούλιο της ΕΕ δεν πρέπει να συγχέεται με το Ευρωπαϊκό Συμβούλιο αλλά ούτε και με:',
      'answers': [
        {'text': 'Τον Oργανισμό Hνωμένων Eθνών (ΟΗΕ)', 'score': 0},
        {'text': 'Τον Oργανισμό Bορειοατλαντικού Συμφώνου (ΝΑΤΟ)', 'score': 0},
        {
          'text':
              'Το Συμβούλιο της Ευρώπης – ένα όργανο που δεν έχει σχέση με την Ευρωπαϊκή Ένωση',
          'score': 10
        },
        {
          'text': 'Την Eθνική Yπηρεσία Aεροναυτικής και Διαστήματος (NASA)',
          'score': 0
        },
      ],
    },

//2.43
    {
      'questionText':
          'Το Συμβούλιο της ΕΕ και το Ευρωπαϊκό κοινοβούλιο έχουν από κοινού τον τελευταίο λόγο για τη νομοθεσία που προτείνει:',
      'answers': [
        {'text': 'Η Διεθνής Ολυμπιακή Επιτροπή', 'score': 0},
        {
          'text': 'Tο Tαμείο Παιδιών του Oργανισμού Hνωμένων Eθνών (UNICEF)',
          'score': 0
        },
        {'text': 'Η Αφρικανική Ένωση', 'score': 0},
        {'text': 'H Ευρωπαϊκή Επιτροπή', 'score': 10},
      ],
    },

//2.44
    {
      'questionText':
          'Το Συμβούλιο της ΕΕ, εξ ονόματος της ΕΕ (σε διάφορους τομείς, όπως το περιβάλλον, το εμπόριο, η ανάπτυξη, η επιστήμη κτλ.), μπορεί να:',
      'answers': [
        {'text': 'Τιμωρεί χώρες μέλη', 'score': 0},
        {'text': 'Υπογράφει διεθνείς συμφωνίες', 'score': 10},
        {'text': 'Ασκεί έλεγχο στις χώρες μέλη', 'score': 0},
        {'text': 'Αποφασίζει εκ μέρους των χωρών μελών', 'score': 0},
      ],
    },

//2.45
    {
      'questionText':
          'Το ποσό των χρημάτων που μπορεί να δαπανήσει η ΕΕ κάθε χρόνο αποφασίζεται από κοινού από το Συμβούλιο της ΕΕ και:',
      'answers': [
        {'text': 'Το Διεθνές Νομισματικό Ταμείο', 'score': 0},
        {'text': 'Το Υπουργείο Οικονομικών των ΗΠΑ', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 10},
        {'text': 'Την Κεντρική Τράπεζα του Βελγίου', 'score': 0},
      ],
    },

//2.46
    {
      'questionText':
          'Οι εθνικές κυβερνήσεις των κρατών μελών της ΕΕ συνεργάζονται για να χαράξουν μια κοινή εξωτερική και αμυντική πολιτική. Το Συμβούλιο της ΕΕ:',
      'answers': [
        {
          'text': 'Είναι ο κύριος φορέας ανάπτυξης της συνεργασίας αυτής',
          'score': 10
        },
        {'text': 'Δεν έχει καμιά ανάμειξη στη συνεργασία αυτή', 'score': 0},
        {
          'text':
              'Συνεργάζεται με τις ΗΠΑ για την εφαρμογή της πολιτικής αυτής',
          'score': 0
        },
        {
          'text':
              'Διαθέτει δικό του στρατό για την εφαρμογή της πολιτικής αυτής',
          'score': 0
        },
      ],
    },

//2.47
    {
      'questionText': 'Ποια είναι τα μέλη του Συμβουλίου της ΕΕ;',
      'answers': [
        {'text': 'Η Γαλλία και το Ηνωμένο Βασίλειο', 'score': 0},
        {
          'text': 'Οι εκάστοτε πέντε πλουσιότερες χώρες μέλη της ΕΕ',
          'score': 0
        },
        {'text': 'Η Γερμανία, η Γαλλία και το Ηνωμένο Βασίλειο', 'score': 0},
        {
          'text':
              'Κάθε χώρα εκπροσωπείται από τον υπουργό της που είναι αρμόδιος για τον εκάστοτε τομέα πολιτικής',
          'score': 10
        },
      ],
    },

//2.48
    {
      'questionText':
          'Ποιος προεδρεύει στις συσκέψεις του Συμβουλίου της ΕΕ για θέματα εξωτερικής πολιτικής;',
      'answers': [
        {'text': 'Ο υπουργός Εξωτερικών της Σουηδίας', 'score': 0},
        {'text': 'Ο γηραιότερος υπουργός Εξωτερικών', 'score': 0},
        {
          'text': 'Ο υπουργός Εξωτερικών με τις περισσότερες θητείες',
          'score': 0
        },
        {
          'text':
              'Το Συμβούλιο των υπουργών Εξωτερικών διαθέτει μόνιμο πρόεδρο',
          'score': 10
        },
      ],
    },

//2.49
    {
      'questionText':
          'Σε όλες τις άλλες συσκέψεις του Συμβουλίου της ΕΕ, πλην των θεμάτων εξωτερικών υποθέσεων, προεδρεύει:',
      'answers': [
        {'text': 'Ο αρμόδιος υπουργός της Γερμανίας', 'score': 0},
        {
          'text':
              'Ο αρμόδιος υπουργός της χώρας μέλους με τον μεγαλύτερο πληθυσμό',
          'score': 0
        },
        {
          'text':
              'Ο αρμόδιος υπουργός της χώρας που ασκεί την εκ περιτροπής προεδρία της ΕΕ',
          'score': 10
        },
        {'text': 'Ο γηραιότερος αρμόδιος υπουργός', 'score': 0},
      ],
    },

//2.50
    {
      'questionText':
          'Το δεύτερο εξάμηνο του 2012, των συσκέψεων του Συμβουλίου της ΕΕ, πλην των θεμάτων εξωτερικών υποθέσεων, προέδρευαν οι αρμόδιοι υπουργοί:',
      'answers': [
        {'text': 'Της Κύπρου', 'score': 10},
        {'text': 'Του Ισραήλ', 'score': 0},
        {'text': 'Της Τουρκίας', 'score': 0},
        {'text': 'Της Ελλάδας', 'score': 0},
      ],
    },

//2.51

    {
      'questionText':
          'Το πρώτο άτομο που διορίστηκε, το 2009, Ύπατος Εκπρόσωπος της ΕΕ για την Εξωτερική Πολιτική και την Πολιτική Ασφάλειας ήταν:',
      'answers': [
        {'text': 'H Aνδρούλα Bασιλείου', 'score': 0},
        {'text': 'Η Kάθριν Άστον (Catherine Ashton)', 'score': 10},
        {'text': 'O Nικηφόρος Διαμαντούρος', 'score': 0},
        {'text': 'O Xέρμαν Βαν Pομπουί (Herman Van Rompuy)', 'score': 0},
      ],
    },

//2.52
    {
      'questionText':
          'Η Ευρωπαϊκή Επιτροπή είναι ένα από τα κύρια θεσμικά όργανα της ΕΕ. Ποιο από τα πιο κάτω δεν περιλαμβάνεται στα καθήκοντά της;',
      'answers': [
        {
          'text':
              'Εκπροσωπεί και προασπίζει τα συμφέροντα της Ευρωπαϊκής Ένωσης στο σύνολό της',
          'score': 0
        },
        {'text': 'Καταρτίζει προτάσεις για νέα νομοθεσία', 'score': 0},
        {
          'text':
              'Διαχειρίζεται την υλοποίηση των πολιτικών και τη διάθεση των κονδυλίων της ΕΕ',
          'score': 0
        },
        {
          'text':
              'Αποφασίζει το ποσό των χρημάτων που μπορεί να δαπανήσει η ΕΕ κάθε χρόνο',
          'score': 10
        },
      ],
    },

//2.53
    {
      'questionText':
          'Πόσοι επίτροποι αποτελούν την πολιτική ηγεσία της Ευρωπαϊκής Επιτροπής  συμπεριλαμβανομένου του Προέδρου της Επιτροπής;',
      'answers': [
        {'text': '28', 'score': 10},
        {'text': '50', 'score': 0},
        {'text': '3', 'score': 0},
        {'text': '1', 'score': 0},
      ],
    },

//2.54
    {
      'questionText':
          'Από ποιες χώρες πρέπει να προέρχονται οι επίτροποι της Ευρωπαϊκής Επιτροπής; ',
      'answers': [
        {'text': 'Από χώρες εκτός της ΕΕ', 'score': 0},
        {'text': 'Από τις Κάτω Χώρες', 'score': 0},
        {'text': 'Ένας από κάθε χώρα μέλος της ΕΕ', 'score': 10},
        {'text': 'Μόνο από την Ελβετία', 'score': 0},
      ],
    },

//2.55
    {
      'questionText':
          'Πόσα χρόνια διαρκεί η θητεία των επιτρόπων της Ευρωπαϊκής Επιτροπής;',
      'answers': [
        {'text': "Εφ όρου ζωής", 'score': 0},
        {'text': '5', 'score': 10},
        {'text': '1', 'score': 0},
        {'text': 'Όσα επιθυμούν οι ίδιοι', 'score': 0},
      ],
    },

//2.56
    {
      'questionText':
          'Κάθε Ευρωπαίος επίτροπος αναλαμβάνει την ευθύνη για συγκεκριμένους τομείς πολιτικής σύμφωνα με τα καθήκοντα που του αναθέτει:',
      'answers': [
        {'text': 'Ο πρόεδρος της Μάλτας', 'score': 0},
        {'text': 'Ο πρόεδρος της Ευρωπαϊκής Επιτροπής', 'score': 10},
        {'text': 'Η Γενική Συνέλευση του ΟΗΕ', 'score': 0},
        {
          'text':
              'Ο Ύπατος Εκπρόσωπος της ΕΕ για την Εξωτερική Πολιτική και την Πολιτική Ασφάλειας',
          'score': 0
        },
      ],
    },

//2.57
    {
      'questionText':
          'Ο Ζαν-κλωντ Γιούνκερ ξεκίνησε τη θητεία του ως πρόεδρος της Ευρωπαϊκής Επιτροπής:',
      'answers': [
        {'text': 'Το 1957', 'score': 0},
        {'text': 'Το 2004', 'score': 0},
        {'text': 'Το 2010', 'score': 0},
        {'text': 'Το 2014', 'score': 10},
      ],
    },

//2.58
    {
      'questionText': 'Ο πρόεδρος της Ευρωπαϊκής Επιτροπής διορίζεται από:',
      'answers': [
        {'text': 'Το Ευρωπαϊκό Συμβούλιο', 'score': 10},
        {'text': 'Το Διεθνές Δικαστήριο της Χάγης', 'score': 0},
        {'text': 'Το Δικαστήριο της Ευρωπαϊκής Ένωσης', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Ταμείο Επενδύσεων', 'score': 0},
      ],
    },

//2.59
    {
      'questionText':
          'Το Ευρωπαϊκό Συμβούλιο διορίζει τους επιτρόπους της Ευρωπαϊκής Επιτροπής πάντοτε σε συμφωνία:',
      'answers': [
        {'text': 'Με τον πρωθυπουργό του Ηνωμένου Βασιλείου', 'score': 0},
        {
          'text': 'Με τον γενικό γραμματέα του Oργανισμού Hνωμένων Eθνών (ΟΗΕ)',
          'score': 0
        },
        {'text': 'Με τον καγκελάριο της Γερμανίας', 'score': 0},
        {'text': 'Με τον διορισθέντα πρόεδρο της Επιτροπής', 'score': 10},
      ],
    },

//2.60
    {
      'questionText':
          'Ποιος είναι απαραίτητο να δώσει την έγκρισή του για τον διορισμό όλων των επιτρόπων, συμπεριλαμβανομένου του προέδρου της Ευρωπαϊκής Επιτροπής;',
      'answers': [
        {'text': 'Η βασίλισσα της Αγγλίας', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 10},
        {'text': 'Το Ευρωπαϊκό Ταμείο Επενδύσεων', 'score': 0},
        {'text': 'Ο Ευρωπαίος Επόπτης Προστασίας Δεδομένων', 'score': 0},
      ],
    },

//2.61
    {
      'questionText':
          'Κατά τη θητεία τους, τόσο ο πρόεδρος όσο και οι επίτροποι της Ευρωπαϊκής Επιτροπής εξακολουθούν να είναι υπόλογοι στο Ευρωπαϊκό κοινοβούλιο, το οποίο:',
      'answers': [
        {'text': 'Έχει την εξουσία να καθαιρέσει την Επιτροπή', 'score': 10},
        {
          'text': 'Έχει την εξουσία να αυξήσει τον αριθμό των επιτρόπων',
          'score': 0
        },
        {
          'text': ' Έχει την εξουσία μόνο να μειώσει τον αριθμό των επιτρόπων',
          'score': 0
        },
        {
          'text': 'Έχει την εξουσία να μειώσει τον μισθό των επιτρόπων',
          'score': 0
        },
      ],
    },

//2.62
    {
      'questionText':
          'Για την καθημερινή λειτουργία της Ευρωπαϊκής Επιτροπής μεριμνά το προσωπικό της που είναι κατανεμημένο σε διάφορες υπηρεσίες, γνωστές ως:',
      'answers': [
        {'text': 'Μικρές Επιτροπές', 'score': 0},
        {'text': 'Τμήματα', 'score': 0},
        {'text': 'Γενικές Διευθύνσεις (ΓΔ)', 'score': 10},
        {'text': 'Υπηρεσίες', 'score': 0},
      ],
    },

//2.63
    {
      'questionText':
          'Η Επιτροπή προασπίζει τα συμφέροντα της ΕΕ στο σύνολό της. Επιβλέπει & υλοποιεί τις πολιτικές της ΕΕ (ένα από τα πιο κάτω είναι λάθος):',
      'answers': [
        {
          'text': 'Προτείνοντας νέους νόμους στο Κοινοβούλιο και στο Συμβούλιο',
          'score': 0
        },
        {
          'text':
              'Διαχειριζόμενη τον προϋπολογισμό της ΕΕ και κατανέμοντας τα διαθέσιμα κονδύλια',
          'score': 0
        },
        {
          'text':
              'Μεριμνώντας για την εφαρμογή του δικαίου της ΕΕ (μαζί με το Δικαστήριο)',
          'score': 0
        },
        {
          'text':
              'Εκπροσωπώντας την Ευρωπαϊκή Ένωση στον Oργανισμό Hνωμένων Eθνών (ΟΗΕ)',
          'score': 10
        },
      ],
    },

//2.64
    {
      'questionText':
          'Η Επιτροπή έχει το «δικαίωμα της πρωτοβουλίας», μπορεί δηλαδή να προτείνει νέους νόμους για να προστατεύσει τα συμφέροντα της ΕΕ, μόνο για θέματα: ',
      'answers': [
        {'text': 'Άμυνας', 'score': 0},
        {
          'text':
              'Που δεν είναι δυνατόν να αντιμετωπισθούν αποτελεσματικά σε εθνικό ή περιφερειακό επίπεδο',
          'score': 10
        },
        {'text': 'Γεωργίας', 'score': 0},
        {'text': 'Διαστήματος', 'score': 0},
      ],
    },

//2.65
    {
      'questionText':
          'Όταν καταρτιστεί μια νομοθετική πρόταση, και συμφωνούν τουλάχιστον οι 14 από τους 28 επιτρόπους, τότε η πρόταση υποβάλλεται, για συζήτηση, τροποποίηση ή έγκριση:',
      'answers': [
        {'text': 'Στο Συμβούλιο και το Κοινοβούλιο', 'score': 10},
        {
          'text': 'Στο Συμβούλιο και τη Διεθνή Ποδοσφαιρική Oμοσπονδία (FIFA)',
          'score': 0
        },
        {
          'text':
              'Στο Κοινοβούλιο και τη Διεθνή Ποδοσφαιρική Oμοσπονδία (FIFA)',
          'score': 0
        },
        {'text': 'Στο Ευρωπαϊκό Ταμείο Επενδύσεων', 'score': 0},
      ],
    },

//2.66
    {
      'questionText':
          'Η Επιτροπή διαχειρίζεται τα κονδύλια για τις πολιτικές της ΕΕ (π.χ. για τη γεωργία και την αγροτική ανάπτυξη) καθώς και προγράμματα όπως:',
      'answers': [
        {'text': 'Το Apollo-2', 'score': 0},
        {'text': 'Το Erasmus+', 'score': 10},
        {'text': 'Το Soyuz', 'score': 0},
        {'text': 'Το Shenzhou-9', 'score': 0},
      ],
    },

//2.67
    {
      'questionText':
          'H Ευρωπαϊκή Επιτροπή ελέγχει κατά πόσο κάθε χώρα μέλος εφαρμόζει ορθά το δίκαιο της ΕΕ. Για αυτό το λόγο ονομάζεται και:',
      'answers': [
        {'text': 'Τερματοφύλακας των Συνθηκών', 'score': 0},
        {'text': 'Θεματοφύλακας των Συνθηκών', 'score': 10},
        {'text': 'Ρομπέν των Ευρωπαίων', 'score': 0},
        {'text': 'Προστάτης των αδικημένων', 'score': 0},
      ],
    },

//2.68
    {
      'questionText':
          'Η Ευρωπαϊκή Επιτροπή διαθέτει γραφεία σε κάθε χώρα της ΕΕ. Έχει την έδρα της:',
      'answers': [
        {'text': 'Στις Βρυξέλλες και το Λουξεμβούργο', 'score': 10},
        {'text': 'Στις Βρυξέλλες και την Αθήνα', 'score': 0},
        {'text': 'Στις Βρυξέλλες και το Τορόντο', 'score': 0},
        {'text': 'Στις Βρυξέλλες και την Ιερουσαλήμ', 'score': 0},
      ],
    },

//2.69
    {
      'questionText':
          'Η ομοιόμορφη ερμηνεία και εφαρμογή του δικαίου της ΕΕ σε όλες τις χώρες μέλη της διασφαλίζεται από:',
      'answers': [
        {'text': 'Το Διεθνές Δικαστήριο της Χάγης', 'score': 0},
        {'text': ' Τον Οργανισμό Ηνωμένων Eθνών (ΟΗΕ) ', 'score': 0},
        {'text': 'Το Δικαστήριο της Ευρωπαϊκής Ένωσης ', 'score': 10},
        {
          'text': ' Την Ευρωπαϊκή Οικονομική και Κοινωνική Επιτροπή',
          'score': 0
        },
      ],
    },

//2.70
    {
      'questionText':
          'Το Δικαστήριο της Ευρωπαϊκής Ένωσης διευθετεί τις νομικές διαφορές μεταξύ των κυβερνήσεων των χωρών μελών και:',
      'answers': [
        {'text': 'Των ΗΠΑ', 'score': 0},
        {'text': 'Χωρών που δεν είναι μέλη της ΕΕ', 'score': 0},
        {'text': 'Των θεσμικών οργάνων της ΕΕ', 'score': 10},
        {'text': 'Διεθνών οργανισμών', 'score': 0},
      ],
    },

//2.71
    {
      'questionText': 'Στο Δικαστήριο της Ευρωπαϊκής Ένωσης μετέχουν:',
      'answers': [
        {'text': 'Δύο δικαστές', 'score': 0},
        {'text': 'Πενήντα δικαστές', 'score': 0},
        {'text': 'Ένας δικαστής από κάθε χώρα της ΕΕ', 'score': 10},
        {'text': 'Ένας δικαστής', 'score': 0},
      ],
    },

//2.72
    {
      'questionText':
          'Στο Δικαστήριο της Ευρωπαϊκής Ένωσης η θητεία κάθε δικαστή και γενικού εισαγγελέα είναι εξαετής. Ο διορισμός τους γίνεται κατόπιν συμφωνίας:',
      'answers': [
        {'text': 'Της Τουρκίας και του Σαν Μαρίνο', 'score': 0},
        {'text': 'Των κυβερνήσεων των χωρών της ΕΕ', 'score': 10},
        {'text': 'Της Νορβηγίας και του Καναδά', 'score': 0},
        {'text': 'Των μελών του ΝΑΤΟ', 'score': 0},
      ],
    },

//2.73
    {
      'questionText': 'Το Δικαστήριο της Ευρωπαϊκής Ένωσης ιδρύθηκε το:',
      'answers': [
        {'text': '2012', 'score': 0},
        {'text': '1787', 'score': 0},
        {'text': '1786', 'score': 0},
        {'text': '1952', 'score': 10},
      ],
    },

//2.74
    {
      'questionText': 'Η έδρα του Δικαστηρίου της ΕΕ βρίσκεται:',
      'answers': [
        {'text': 'Στο Λουξεμβούργο', 'score': 10},
        {'text': 'Στη Ζυρίχη', 'score': 0},
        {'text': 'Στην Κωνσταντινούπολη', 'score': 0},
        {'text': 'Στο Δουβλίνο', 'score': 0},
      ],
    },

//2.75
    {
      'questionText':
          'Το Ελεγκτικό Συνέδριο της ΕΕ ιδρύθηκε το 1975 και έχει την έδρα του στο Λουξεμβούργο. Ποιο είναι το έργο του;',
      'answers': [
        {'text': 'Να διοργανώνει εκδηλώσεις για την ΕΕ', 'score': 0},
        {
          'text': 'Να ελέγχει τις πωλήσεις αυτοκινήτων στις χώρες της ΕΕ',
          'score': 0
        },
        {'text': 'Να ελέγχει τα οικονομικά της ΕΕ', 'score': 10},
        {'text': 'Να προστατεύει από τρομοκρατικές ενέργειες', 'score': 0},
      ],
    },

//2.76
    {
      'questionText':
          'Εκπρόσωποι των εργοδοτών και των εργαζομένων καθώς και άλλων ομάδων μπορούν να διατυπώνουν τις απόψεις τους επί ζητημάτων της ΕΕ μέσω:',
      'answers': [
        {'text': 'Σιωπηρής διαμαρτυρίας', 'score': 0},
        {
          'text': 'Της Ευρωπαϊκής Οικονομικής και Κοινωνικής Επιτροπής (ΕΟΚΕ)',
          'score': 10
        },
        {'text': 'Του Υπουργείου Εξωτερικών της Αυστρίας', 'score': 0},
        {'text': 'Ταχυδρομείου', 'score': 0},
      ],
    },

//2.77
    {
      'questionText':
          'Η ΕΟΚΕ παρέχει γνωμοδοτήσεις στα μεγαλύτερα θεσμικά όργανα, ιδίως το Συμβούλιο, την Επιτροπή και το Ευρωπαϊκό κοινοβούλιο. Πρόκειται για: ',
      'answers': [
        {'text': 'Γραφείο παραπόνων', 'score': 0},
        {'text': 'Γραφείο ευημερίας', 'score': 0},
        {'text': 'Δεξαμενή σκέψης', 'score': 0},
        {'text': 'Συμβουλευτικό όργανο', 'score': 10},
      ],
    },

//2.78
    {
      'questionText':
          'Η ΕΟΚΕ παρέχει στις ομάδες συμφερόντων της Ευρώπης, π.χ. συνδικαλιστές, εργοδότες, γεωργούς, βήμα για να διατυπώνουν τις απόψεις τους σχετικά:',
      'answers': [
        {'text': 'Με τις νομοθετικές προτάσεις της ΕΕ', 'score': 10},
        {'text': 'Με τους θεσμούς της ΕΕ', 'score': 0},
        {'text': 'Με το προσωπικό της Ευρωπαϊκής Επιτροπής', 'score': 0},
        {'text': 'Με το Ελεγκτικό Συνέδριο της ΕΕ', 'score': 0},
      ],
    },

//2.79
    {
      'questionText':
          'Ο αριθμός των μελών της ΕΟΚΕ από κάθε κράτος μέλος είναι ανάλογος του εθνικού πληθυσμού. Το Λουξεμβούργο και η Κύπρος έχουν:',
      'answers': [
        {'text': 'Τα πιο λίγα μέλη', 'score': 10},
        {'text': 'Τα πιο πολλά μέλη', 'score': 0},
        {'text': 'Έξι μέλη', 'score': 0},
        {'text': 'Μηδέν μέλη', 'score': 0},
      ],
    },

//2.80
    {
      'questionText':
          'Η Επιτροπή των Περιφερειών είναι ένα συμβουλευτικό σώμα. Ποιους εκπροσωπεί;',
      'answers': [
        {
          'text':
              'Τις τοπικές και περιφερειακές αρχές των χωρών μελών της Ευρωπαϊκής Ένωσης',
          'score': 10
        },
        {'text': 'Τις μειονότητες', 'score': 0},
        {'text': 'Τους εθνικιστές της ΕΕ', 'score': 0},
        {'text': 'Τις μικρές χώρες μέλη της ΕΕ', 'score': 0},
      ],
    },

//SOS
//2.81
    {
      'questionText':
          'Ποια από τις πιο κάτω δεν ανήκει στις κύριες πολιτικές οικογένειες της ΕΕ;',
      'answers': [
        {'text': 'Eυρωπαϊκό Λαϊκό Κόμμα', 'score': 0},
        {'text': 'Κόμμα των Ευρωπαίων Σοσιαλιστών', 'score': 0},
        {
          'text':
              'Ομάδα της Συμμαχίας Φιλελευθέρων και Δημοκρατών για την Ευρώπη',
          'score': 0
        },
        {'text': 'Ένωση Φίλων της Ευρώπης', 'score': 10},
      ],
    },

//ΣΟΣ
//2.82
    {
      'questionText':
          'H Ευρωπαϊκή Τράπεζα Επενδύσεων δανείζεται χρήματα από τις αγορές κεφαλαίων και στη συνέχεια τα δανείζει με χαμηλά επιτόκια. H Ευρωπαϊκή Τράπεζα Επενδύσεων ανήκει:',
      'answers': [
        {'text': 'Στη Γερμανία', 'score': 0},
        {'text': 'Στα 28 κράτη μέλη της ΕΕ', 'score': 10},
        {'text': 'Στην Ελβετία', 'score': 0},
        {'text': 'Στις ΗΠΑ', 'score': 0},
      ],
    },

//2.83
    {
      'questionText':
          'Η Ευρωπαϊκή Τράπεζα Επενδύσεων στηρίζει έργα σε όλα τα κράτη μέλη της ΕΕ και επενδύει:',
      'answers': [
        {'text': 'Σε μελλοντικά κράτη μέλη και χώρες εταίρους', 'score': 10},
        {'text': 'Σε ομόλογα', 'score': 0},
        {'text': 'Σε αξιόγραφα', 'score': 0},
        {'text': 'Σε ακίνητα', 'score': 0},
      ],
    },

//2.84
    {
      'questionText':
          'Η Ευρωπαϊκή Τράπεζα Επενδύσεων λειτουργεί σε μη κερδοσκοπική βάση και δανείζει χρήματα με επιτόκια που πλησιάζουν:',
      'answers': [
        {'text': 'Το 20%', 'score': 0},
        {'text': 'Το 15%', 'score': 0},
        {'text': 'Το κόστος δανεισμού της', 'score': 10},
        {'text': 'Το 10%', 'score': 0},
      ],
    },

//2.85
    {
      'questionText': 'Η Ευρωπαϊκή κεντρική Τράπεζα (ΕΚΤ) είναι:',
      'answers': [
        {'text': 'Απολύτως ανεξάρτητη', 'score': 10},
        {'text': 'Η μεγαλύτερη τράπεζα στον κόσμο', 'score': 0},
        {
          'text':
              'Υπό τον έλεγχο των κεντρικών τραπεζών της Γερμανίας και του Ηνωμένου Βασιλείου',
          'score': 0
        },
        {
          'text':
              'Εξαρτημένη από τις κεντρικές τράπεζες της Κίνας και της Ιαπωνίας',
          'score': 0
        },
      ],
    },

//2.86
    {
      'questionText':
          'Η Ευρωπαϊκή κεντρική Τράπεζα που είναι ένα από τα θεσμικά όργανα της ΕΕ και εδρεύει στη Φρανκφούρτη της Γερμανίας:',
      'answers': [
        {
          'text': 'Διαχειρίζεται όλα τα νομίσματα των χωρών μελών της ΕΕ',
          'score': 0
        },
        {'text': 'Διοικείται από τη Γερμανία', 'score': 0},
        {'text': 'Διοικείται από τις 5 πλουσιότερες χώρες της ΕΕ', 'score': 0},
        {
          'text':
              'Διαχειρίζεται το ευρώ και διαφυλάσσει τη σταθερότητα των τιμών στην ΕΕ',
          'score': 10
        },
      ],
    },

//2.87
    {
      'questionText':
          'Στο πλαίσιο του Ευρωπαϊκού Συστήματος κεντρικών Τραπεζών (ΕΣΚΤ), με ποιες τράπεζες συνεργάζεται η Ευρωπαϊκή κεντρική Τράπεζα;',
      'answers': [
        {'text': 'Με το Διεθνές Νομισματικό Ταμείο', 'score': 0},
        {
          'text': 'Με τις κεντρικές τράπεζες και των 28 κρατών μελών της ΕΕ',
          'score': 10
        },
        {
          'text': 'Με τις μεγαλύτερες ιδιωτικές τράπεζες κάθε κράτους μέλους',
          'score': 0
        },
        {'text': 'Με την Κεντρική Τράπεζα των ΗΠΑ', 'score': 0},
      ],
    },

//2.88
    {
      'questionText':
          'Ο Ευρωπαίος Διαμεσολαβητής διερευνά καταγγελίες σχετικά:',
      'answers': [
        {'text': 'Με βία στην οικογένεια', 'score': 0},
        {'text': 'Με βία στα γήπεδα της Ευρώπης', 'score': 0},
        {
          'text':
              'Με τα θεσμικά όργανα, τις υπηρεσίες και τους οργανισμούς της ΕΕ',
          'score': 01
        },
        {'text': 'Με ρατσιστικά κινήματα', 'score': 0},
      ],
    },

//2.89
    {
      'questionText': 'Ο Ευρωπαίος Διαμεσολαβητής:',
      'answers': [
        {
          'text':
              'Είναι απολύτως ανεξάρτητη υπηρεσία και δεν λαμβάνει εντολές από  καμία κυβέρνηση ή οργανισμό',
          'score': 10
        },
        {'text': 'Έχει τυπικό ρόλο', 'score': 0},
        {'text': 'Είναι πάντοτε Έλληνας', 'score': 0},
        {'text': 'Πρέπει να υπακούει στην Ευρωπαϊκή Επιτροπή', 'score': 0},
      ],
    },

//2.90
    {
      'questionText':
          'Η Έμιλυ ο Ράιλι, πρώην εθνική διαμεσολαβήτρια της Ιρλανδίας, εξελέγη τον Ιούλιο του 2013 και η θητεία της ανανεώθηκε τον Δεκέμβριο του 2014:',
      'answers': [
        {'text': 'Εφ όρου ζωής', 'score': 0},
        {'text': 'Για πέντε χρόνια', 'score': 10},
        {'text': 'Για 20 χρόνια', 'score': 0},
        {'text': 'Για 15 χρόνια', 'score': 0},
      ],
    },

//2.91
    {
      'questionText':
          'Ποιοι δικαιούνται να υποβάλουν καταγγελία στον Ευρωπαίο Διαμεσολαβητή;',
      'answers': [
        {
          'text': 'Οι πρόεδροι ή οι πρωθυπουργοί των κρατών μελών της ΕΕ',
          'score': 0
        },
        {'text': 'Οι αρχηγοί της αστυνομίας κάθε κράτους μέλους', 'score': 0},
        {'text': 'Οι γενικοί εισαγγελείς κάθε κράτους μέλους', 'score': 0},
        {
          'text':
              'Πολίτες, επιχειρήσεις, ενώσεις πολιτών, άλλα σωματεία ή όποιος διαμένει σε κράτος μέλος της ΕΕ',
          'score': 10
        },
      ],
    },

//2.92
    {
      'questionText':
          'Η θέση του Ευρωπαίου Επόπτη Προστασίας Δεδομένων (ΕΕΠΔ) δημιουργήθηκε το 2001. Έργο του ΕΕΠΔ είναι να εξασφαλίζει ότι:',
      'answers': [
        {
          'text': 'Τα όργανα και οι οργανισμοί της ΕΕ είναι εχέμυθοι',
          'score': 0
        },
        {
          'text': 'Όλα τα αρχεία της ΕΕ διαγράφονται κάθε πέντε χρόνια',
          'score': 0
        },
        {
          'text':
              'Τα όργανα και οι οργανισμοί της ΕΕ σέβονται το δικαίωμα ιδιωτικής ζωής των πολιτών',
          'score': 10
        },
        {'text': 'Τα απόρρητα έγγραφα της ΕΕ φυλάσσονται σωστά', 'score': 0},
      ],
    },

//2.93
    {
      'questionText':
          'Τι καθήκοντα ασκεί η Υπηρεσία Εκδόσεων της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Εκδοτικού οίκου για τα όργανα της Ένωσης', 'score': 10},
        {'text': 'Αστυνόμευσης', 'score': 0},
        {'text': 'Ασφάλειας των συνόρων', 'score': 0},
        {'text': 'Απέλασης παράνομων οικονομικών μεταναστών', 'score': 0},
      ],
    },

//2.94
    {
      'questionText':
          'Έργο της Ευρωπαϊκής Υπηρεσίας Επιλογής Προσωπικού (ΕΥΕΠ) είναι να διοργανώνει εξετάσεις για την πρόσληψη προσωπικού που θα εργαστεί:',
      'answers': [
        {'text': 'Σε χώρες της Αφρικής', 'score': 0},
        {'text': 'Στην Κίνα', 'score': 0},
        {'text': 'Σε όλα τα όργανα της Ένωσης', 'score': 10},
        {'text': 'Σε εταιρείες του Ντουμπάι', 'score': 0},
      ],
    },

//2.95
    {
      'questionText':
          'Η Ευρωπαϊκή Σχολή Δημόσιας Διοίκησης άρχισε να λειτουργεί στις 10/2/2005. Αποστολή της είναι η παροχή κατάρτισης επί μιας σειράς εξειδικευμένων θεμάτων:',
      'answers': [
        {'text': 'Σε όποιον ενδιαφέρεται', 'score': 0},
        {'text': 'Σε μετανάστες από τρίτες χώρες', 'score': 0},
        {'text': 'Σε μέλη του προσωπικού της ΕΕ', 'score': 10},
        {'text': 'Σε Καναδούς υπηκόους', 'score': 0},
      ],
    },

//ΣΟΣ
//2.96
    {
      'questionText':
          'Το Ευρωπαϊκό Ινστιτούτο καινοτομίας και Τεχνολογίας (EIT) είναι ανεξάρτητος, αποκεντρωμένος φορέας της ΕΕ ο οποίος έχει σκοπό:',
      'answers': [
        {'text': 'Να εξελιχθεί η ΕΕ περισσότερο από τις ΗΠΑ', 'score': 0},
        {
          'text': 'Να ενισχύσει την ικανότητα καινοτομίας της Ένωσης',
          'score': 10
        },
        {'text': 'Να εξελιχθεί η ΕΕ περισσότερο από την Ιαπωνία', 'score': 0},
        {'text': 'Την ανακάλυψη του «σωματιδίου του Θεού»', 'score': 0},
      ],
    },

//3.97
    {
      'questionText': 'Πότε θα πραγματοποιηθούν οι επόμενες ευρωεκλογές;',
      'answers': [
        {'text': '2022', 'score': 0},
        {'text': '2024', 'score': 10},
        {'text': '2020', 'score': 0},
        {'text': '2021', 'score': 0},
      ],
    },

//3.98
    {
      'questionText':
          'Με πόσους βουλευτές εκπροσωπείται η Κύπρος στο Ευρωπαϊκό Κοινοβούλιο;',
      'answers': [
        {'text': 'Δύο', 'score': 0},
        {'text': 'Έξι', 'score': 10},
        {'text': 'Οκτώ', 'score': 0},
        {'text': 'Δεκαέξι', 'score': 0},
      ],
    },

//3.99
    {
      'questionText': 'Πρόεδρος του Ευρωπαϊκού Κοινοβουλίου είναι ο/η:',
      'answers': [
        {'text': 'Ζαν-Κλοντ Γιούνκερ (Jean-Claude Juncker)', 'score': 0},
        {'text': 'Φεντερίκα Μογκερίνι (Federica Mogherini)', 'score': 0},
        {
          'text': 'Νταβίντ - Μαρία Σασσόλι (David - Maria Sassoli)',
          'score': 10
        },
        {'text': 'Ντόναλντ Τουσκ (Donald Tusk)', 'score': 0},
      ],
    },

//3.100
    {
      'questionText':
          'Ποια από τις πιο κάτω πόλεις δεν αποτελεί έδρα εργασιών του Ευρωπαϊκού Κοινοβουλίου;',
      'answers': [
        {'text': 'Λουξεμβούργο', 'score': 0},
        {'text': 'Βρυξέλλες', 'score': 0},
        {'text': 'Βρυξέλλες', 'score': 0},
        {'text': 'Αμβούργο', 'score': 10},
      ],
    },

//3.101
    {
      'questionText': 'Πόσους βουλευτές διαθέτει το Ευρωπαϊκό Κοινοβούλιο;',
      'answers': [
        {'text': 'Κάτω από 500', 'score': 0},
        {'text': 'Λιγότερους από 600', 'score': 0},
        {'text': 'Περισσότερους από 700', 'score': 10},
        {'text': 'Περισσότερους από 1000', 'score': 0},
      ],
    },

//3.102
    {
      'questionText': 'Τον Ευρωπαϊκό Προϋπολογισμό εγκρίνει:',
      'answers': [
        {'text': 'Η Ευρωπαϊκή Επιτροπή και το Συμβούλιο της ΕΕ', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Συμβούλιο', 'score': 0},
        {
          'text': 'Το Ευρωπαϊκό Κοινοβούλιο και η Ευρωπαϊκή Επιτροπή',
          'score': 0
        },
        {
          'text': 'Το Ευρωπαϊκό Κοινοβούλιο και το Συμβούλιο της ΕΕ',
          'score': 10
        },
      ],
    },

//3.103
    {
      'questionText':
          'Οι πρώτες εκλογές για την άμεση ανάδειξη των μελών του Ευρωπαϊκού Κοινοβουλίου έγιναν το:',
      'answers': [
        {'text': '1950', 'score': 0},
        {'text': '1967', 'score': 0},
        {'text': '1979', 'score': 10},
        {'text': '1980', 'score': 0},
      ],
    },

//3.104
    {
      'questionText': 'Το Ευρωπαϊκό Κοινοβούλιο (ΕΚ) διορίζει τον:',
      'answers': [
        {'text': 'Ευρωπαίο Διαμεσολαβητή', 'score': 10},
        {'text': 'Πρόεδρο της Γαλλίας', 'score': 0},
        {'text': 'Πρόεδρο του Συμβουλίου της ΕΕ', 'score': 0},
        {
          'text':
              'Ύπατο Εκπρόσωπο για την Εξωτερική Πολιτική και Πολιτικής Ασφαλείας',
          'score': 0
        },
      ],
    },

//3.105
    {
      'questionText':
          'Ποιο από τα πιο κάτω δεν αποτελεί αρμοδιότητα του Ευρωπαϊκού Κοινοβουλίου;',
      'answers': [
        {'text': 'Ψήφιση νόμων', 'score': 0},
        {'text': 'Έγκριση του προϋπολογισμού της ΕΕ', 'score': 0},
        {
          'text': 'Εκδίκαση ποινικών υποθέσεων που καθυστερούν στα κράτη μέλη',
          'score': 10
        },
        {
          'text':
              'Άσκηση ελέγχου πάνω στη δράση της Ευρωπαϊκής Επιτροπής  και του Ευρωπαϊκού Συμβουλίου',
          'score': 0
        },
      ],
    },

//3.106
    {
      'questionText': 'Τα έγγραφα του Κοινοβουλίου δημοσιεύονται:',
      'answers': [
        {'text': 'Μόνο στα αγγλικά', 'score': 0},
        {'text': 'Στα αγγλικά και τα γαλλικά', 'score': 0},
        {'text': 'Στα αγγλικά, τα γαλλικά και τα γερμανικά', 'score': 0},
        {'text': 'Σε όλες τις επίσημες γλώσσες της ΕΕ', 'score': 10},
      ],
    },

//3.107
    {
      'questionText': 'Στο Κοινοβούλιο κάθε βουλευτής:',
      'answers': [
        {'text': 'Πρέπει να μιλά στα αγγλικά', 'score': 0},
        {
          'text': 'Πρέπει να μιλά είτε στα αγγλικά είτε στα γαλλικά',
          'score': 0
        },
        {
          'text': 'Πρέπει να μιλά ή στα αγγλικά ή στα γαλλικά ή στα γερμανικά',
          'score': 0
        },
        {
          'text': 'Έχει δικαίωμα να μιλά στην επίσημη γλώσσα της επιλογής του',
          'score': 10
        },
      ],
    },

//3.108
    {
      'questionText':
          'Οι έδρες στο ΕΚ κατανέμονται, κατά γενικό κανόνα, αναλογικά:',
      'answers': [
        {'text': 'Με το πότε εντάχθηκε το κάθε κράτος στην ΕΕ:', 'score': 0},
        {'text': 'Με τον πληθυσμό κάθε κράτους μέλους', 'score': 10},
        {'text': 'Με την πολιτική ομάδα', 'score': 0},
        {'text': 'Με την έκταση της κάθε χώρας', 'score': 0},
      ],
    },

//3.109
    {
      'questionText':
          'Ποια χώρα εκπροσωπείται με τους περισσότερους ευρωβουλευτές;',
      'answers': [
        {'text': 'Γερμανία', 'score': 10},
        {'text': 'Γαλλία', 'score': 0},
        {'text': 'Ολλανδία', 'score': 0},
        {'text': 'Πορτογαλία', 'score': 0},
      ],
    },

//3.110
    {
      'questionText': 'Ο πρόεδρος του Ευρωπαϊκού Κοινοβουλίου εκλέγεται:',
      'answers': [
        {'text': 'Για δύο χρόνια', 'score': 0},
        {'text': 'Για δυόμισι χρόνια', 'score': 10},
        {'text': 'Για τρία χρόνια', 'score': 0},
        {'text': 'Για πέντε χρόνια', 'score': 0},
      ],
    },

//3.111
    {
      'questionText':
          'Με ποια συνθήκη αυξήθηκαν οι νομοθετικές εξουσίες του Ευρωπαϊκού Κοινοβουλίου;',
      'answers': [
        {'text': 'Του Μάαστριχτ', 'score': 0},
        {'text': 'Της Λισαβόνας', 'score': 10},
        {'text': 'Της Νίκαιας', 'score': 0},
        {'text': 'Του Άμστερνταμ', 'score': 0},
      ],
    },

//3.112
    {
      'questionText': 'Το πρόγραμμα «EUROSCOLA» αφορά:',
      'answers': [
        {'text': 'Πρακτική άσκηση μαθητών', 'score': 0},
        {'text': 'Εξετάσεις για εισδοχή στο ΕΚ', 'score': 0},
        {'text': 'Ημερίδες Ευρωπαϊκού Κοινοβουλίου Νέων', 'score': 10},
        {'text': 'Διαδικτυακή πύλη για μαθητές', 'score': 0},
      ],
    },

//3.113
    {
      'questionText': 'Ο Ευρωπαίος Διαμεσολαβητής:',
      'answers': [
        {
          'text':
              'Εξετάζει καταγγελίες, προκειμένου να εντοπίσει κρούσματα κακοδιοίκησης',
          'score': 10
        },
        {
          'text':
              'Εκπροσωπεί την ΕΕ στις εξωτερικές σχέσεις της ΕΕ με άλλους  διεθνείς οργανισμούς',
          'score': 0
        },
        {
          'text':
              'Ορίζει τη γενική κατεύθυνση και τις προτεραιότητες της Ένωσης',
          'score': 0
        },
        {
          'text':
              'Διασφαλίζει την ομοιόμορφη ερμηνεία και εφαρμογή του δικαίου της ΕΕ σε όλα τα μέλη της',
          'score': 0
        },
      ],
    },

//3.114
    {
      'questionText': 'Για να ενταχθεί ένα νέο κράτος μέλος στην ΕΕ:',
      'answers': [
        {'text': 'Πρέπει να πάρει την έγκριση του ΕΚ', 'score': 10},
        {'text': 'Πρέπει να το προτείνει το ΕΚ', 'score': 0},
        {'text': 'Πρέπει να πάρει έγκριση από τον ΟΗΕ', 'score': 0},
        {'text': 'Πρέπει να έχει προεδρικό σύστημα', 'score': 0},
      ],
    },

//3.115
    {
      'questionText':
          'Οι Σύνοδοι ολομέλειας του Ευρωπαϊκού Κοινοβουλίου πραγματοποιούνται:',
      'answers': [
        {'text': 'Δύο φορές το χρόνο', 'score': 0},
        {'text': 'Κάθε τρεις μήνες', 'score': 0},
        {'text': 'Κάθε μήνα', 'score': 10},
        {'text': 'Πριν από κάθε Σύνοδο Κορυφής', 'score': 0},
      ],
    },

//3.116
    {
      'questionText': 'Οι ευρωβουλευτές χωρίζονται σε ομάδες με βάση:',
      'answers': [
        {'text': 'Το κράτος μέλος που εκπροσωπούν', 'score': 0},
        {'text': 'Την πολιτική τους ταυτότητα', 'score': 10},
        {'text': 'Τη μητρική τους γλώσσα', 'score': 0},
        {'text': 'Το κόμμα που τους υποστηρίζει', 'score': 0},
      ],
    },

//3.117
    {
      'questionText': 'Κάθε πότε γίνονται ευρωεκλογές;',
      'answers': [
        {'text': 'Κάθε χρόνο', 'score': 0},
        {'text': 'Κάθε δύο χρόνια', 'score': 0},
        {'text': 'Κάθε τρία χρόνια', 'score': 0},
        {'text': 'Κάθε πέντε χρόνια', 'score': 10},
      ],
    },

//3.118
    {
      'questionText': 'Ποιο από τα πιο κάτω ισχύει;',
      'answers': [
        {
          'text':
              'Οι ευρωπαϊκοί νόμοι είναι ανώτεροι των νόμων των κρατών μελών',
          'score': 10
        },
        {
          'text':
              'Οι ευρωπαϊκοί νόμοι δεν έχουν υποχρεωτικό χαρακτήρα για τα κράτη μέλη',
          'score': 0
        },
        {
          'text':
              'Οι νόμοι των κρατών μελών είναι ανώτεροι των αντίστοιχων ευρωπαϊκών',
          'score': 0
        },
        {
          'text':
              'Οι ευρωπαϊκοί νόμοι ισχύουν εφόσον εγκριθούν από το Δικαστήριο της ΕΕ',
          'score': 0
        },
      ],
    },

//3.119
    {
      'questionText':
          'Μια πρόταση μομφής (επίπληξης) προς την Ευρωπαϊκή Επιτροπή από το ΕΚ μπορεί να υιοθετηθεί: ',
      'answers': [
        {'text': 'Με απλή πλειοψηφία', 'score': 0},
        {'text': 'Με απόλυτη πλειοψηφία', 'score': 0},
        {'text': 'Με πλειοψηφία των δύο τρίτων των ψήφων', 'score': 10},
        {'text': 'Με πλειοψηφία των πέντε έκτων των μελών του', 'score': 0},
      ],
    },

//3.120
    {
      'questionText':
          'Ποια ήταν η πρώτη γυναίκα που εκλέχθηκε πρόεδρος του Ευρωπαϊκού Κοινοβουλίου;',
      'answers': [
        {'text': 'Nικόλ Φοντέν (Nicole Fontaine)', 'score': 0},
        {'text': 'Σιμόν Bέιλ (Simone Veil)', 'score': 10},
        {'text': 'Μαργκό Γουόλστρομ (Margot Wallström)', 'score': 0},
        {'text': 'Ντανούτα Χούμπνερ (Danuta Hübner)', 'score': 0},
      ],
    },

//3.121
    {
      'questionText':
          'Οι Σύνοδοι ολομέλειας (πλήρεις και μίνι) του Ευρωπαϊκού Κοινοβουλίου πραγματοποιούνται:',
      'answers': [
        {'text': 'Στο Στρασβούργο και στο Λουξεμβούργο', 'score': 0},
        {
          'text': 'Στις Βρυξέλλες, το Λουξεμβούργο και το Στρασβούργο',
          'score': 0
        },
        {
          'text':
              'Στο Στρασβούργο οι πλήρεις ολομέλειες και στις Βρυξέλλες οι μίνι ολομέλειες',
          'score': 10
        },
        {'text': 'Μόνο στο Στρασβούργο', 'score': 0},
      ],
    },

//3.122
    {
      'questionText': 'Η ανάδειξη των ευρωβουλευτών γίνεται:',
      'answers': [
        {'text': 'Με διορισμό τους από τα εθνικά κοινοβούλια', 'score': 0},
        {
          'text':
              'Με γνωμοδότηση της Ευρωπαϊκής Επιτροπής και του Συμβουλίου της ΕΕ',
          'score': 0
        },
        {
          'text': 'Με καθολική και μυστική ψηφοφορία της Συνόδου Κορυφής',
          'score': 0
        },
        {
          'text':
              'Με άμεση, καθολική και μυστική ψηφοφορία από τους πολίτες της ΕΕ',
          'score': 10
        },
      ],
    },

//3.123
    {
      'questionText': 'Η έδρα του Ευρωπαίου Διαμεσολαβητή βρίσκεται:',
      'answers': [
        {'text': 'Στην Ελλάδα', 'score': 0},
        {'text': 'Στις Βρυξέλλες', 'score': 0},
        {'text': 'Στο Στρασβούργο', 'score': 10},
        {'text': 'Στο Λουξεμβούργο', 'score': 0},
      ],
    },

//3.124
    {
      'questionText':
          'Ποιο από τα πιο κάτω δεν αποτελεί αρμοδιότητα του Γραφείου του Ευρωπαϊκού Κοινοβουλίου στην κύπρο:',
      'answers': [
        {
          'text':
              'Να απαντά σε ερωτήσεις του κοινού για το Ευρωπαϊκό Κοινοβούλιο και τις πολιτικές της ΕΕ',
          'score': 0
        },
        {
          'text':
              'Να τηρεί ενήμερα τα μέσα μαζικής ενημέρωσης για νέα του Κοινοβουλίου',
          'score': 0
        },
        {
          'text':
              'Να εργάζεται σε στενή επαφή με ακαδημαϊκούς φορείς και να παρέχει εκπαιδευτικό υλικό',
          'score': 0
        },
        {
          'text':
              'Να εξετάζει καταγγελίες, προκειμένου να εντοπίσει κρούσματα κακοδιοίκησης',
          'score': 10
        },
      ],
    },

//3.125
    {
      'questionText':
          'Για την υποβολή μιας νομοθετικής πρότασης μέσω της Ευρωπαϊκής Πρωτοβουλίας Πολιτών απαιτούνται:',
      'answers': [
        {'text': '100 χιλιάδες υπογραφές', 'score': 0},
        {'text': 'Ένα εκατομμύριο υπογραφές', 'score': 10},
        {'text': 'Δύο εκατομμύρια υπογραφές', 'score': 0},
        {'text': 'Τρία εκατομμύρια υπογραφές', 'score': 0},
      ],
    },

//3.126
    {
      'questionText':
          'Ποιο από τα πιο κάτω δεν ισχύει αναφορικά με τη διαδικασία συνδιαλλαγής μεταξύ ΕΚ και Συμβουλίου;',
      'answers': [
        {
          'text':
              'Αφού σταλεί από την Επιτροπή η πρόταση εξετάζεται και συζητείται δύο φορές διαδοχικά',
          'score': 0
        },
        {
          'text':
              'Αν τα δύο όργανα δεν μπορούν να συμφωνήσουν, η πρόταση υποβάλλεται στην επιτροπή συνδιαλλαγής',
          'score': 0
        },
        {
          'text':
              'Η οριστική συμφωνία των δύο θεσμικών οργάνων είναι αναγκαία για την έγκριση του κειμένου',
          'score': 0
        },
        {
          'text':
              'Το Κοινοβούλιο δεν μπορεί να απορρίψει σε καμία περίπτωση την οριστική συμφωνία',
          'score': 10
        },
      ],
    },
//3.127
    {
      'questionText':
          'Η διαδικασία συναπόφασης μεταξύ ΕΚ και Συμβουλίου καθιερώθηκε με τη Συνθήκη:',
      'answers': [
        {'text': 'Του Μάαστριχτ', 'score': 10},
        {'text': 'Της Λισαβόνας', 'score': 0},
        {'text': 'Του Παρισιού', 'score': 0},
        {'text': 'Του Άμστερνταμ', 'score': 0},
      ],
    },

//3.128
    {
      'questionText': 'Το ΕΚ είχε ονομάσει το 2018 έτος:',
      'answers': [
        {'text': 'Ανάπτυξης', 'score': 0},
        {'text': 'Ισότητας των δύο φύλων', 'score': 0},
        {
          'text': 'Ενεργού γήρανσης και αλληλεγγύης μεταξύ των γενεών',
          'score': 0
        },
        {'text': 'Ευρωπαϊκό έτος πολιτιστικής κληρονομιάς', 'score': 10},
      ],
    },

//3.129
    {
      'questionText':
          'Ποιος/α από τους πιο κάτω δεν είναι κύπριος ευρωβουλευτής;',
      'answers': [
        {'text': 'Λευτέρης Χριστοφόρου', 'score': 0},
        {'text': 'Δημήτρης Παπαδάκης', 'score': 0},
        {'text': 'Niyazi Kızılyürek', 'score': 0},
        {'text': 'Ελένη Θεοχάρους', 'score': 10},
      ],
    },

//3.130
    {
      'questionText':
          'Η πολιτική ομάδα που είχε τους περισσότερους βουλευτές στο Ευρωπαϊκό Κοινοβούλιο το 2014 είναι η ομάδα:',
      'answers': [
        {
          'text': 'Της Συμμαχίας Φιλελευθέρων και Δημοκρατών για την Ευρώπη ',
          'score': 0
        },
        {'text': 'Του Ευρωπαϊκού Λαϊκού Κόμματος ', 'score': 10},
        {'text': 'Της Ευρώπης Ελευθερίας και Δημοκρατίας ', 'score': 0},
        {'text': 'Των Πρασίνων/Ευρωπαϊκή Ελεύθερη Συμμαχία', 'score': 0},
      ],
    },

//3.131
    {
      'questionText':
          'Για την ελευθερία της σκέψης, κάθε χρόνο το Ευρωπαϊκό Κοινοβούλιο απονέμει σε άτομα ή οργανώσεις το βραβείο:',
      'answers': [
        {'text': 'Μπούκερ', 'score': 0},
        {'text': 'Νόμπελ', 'score': 0},
        {'text': 'Άμπελ', 'score': 0},
        {'text': 'Ζαχάρωφ', 'score': 10},
      ],
    },

//3.132
    {
      'questionText':
          'Πόσες πολιτικές ομάδες υπάρχουν σήμερα στο Ευρωπαϊκό Κοινοβούλιο;',
      'answers': [
        {'text': '3', 'score': 0},
        {'text': '4', 'score': 0},
        {'text': '6', 'score': 0},
        {'text': '8', 'score': 10},
      ],
    },

//4.133
    {
      'questionText':
          'Την 1η Οκτωβρίου 2019, από πόσα κράτη μέλη αποτελείτο η Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': '15', 'score': 0},
        {'text': '25', 'score': 0},
        {'text': '28', 'score': 10},
        {'text': '30', 'score': 0},
      ],
    },

//4.134
    {
      'questionText':
          'Πως λέγεται το χρηματοδοτικό πρόγραμμα της Ευρωπαϊκής Ένωσης που στηρίζει τον πολιτισμό;',
      'answers': [
        {'text': 'Δημιουργική Ευρώπη', 'score': 10},
        {'text': 'Πολιτιστική Ευρώπη', 'score': 0},
        {'text': 'Διασυνοριακή Ευρώπη', 'score': 0},
        {'text': 'Ευρώπη της κουλτούρας', 'score': 0},
      ],
    },

//4.135
    {
      'questionText':
          'Ποια από τις πιο κάτω δεν είναι υποψήφια προς ένταξη στην Ευρωπαϊκή Ένωση χώρα;',
      'answers': [
        {'text': 'Ιρλανδία', 'score': 10},
        {'text': 'Μαυροβούνιο', 'score': 0},
        {'text': 'Σερβία', 'score': 0},
        {'text': 'Τουρκία', 'score': 0},
      ],
    },

//4.136
    {
      'questionText':
          'Ποιο από τα πιο κάτω κράτη της ευρωπαϊκής ηπείρου δεν ανήκει στην Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': 'Εσθονία', 'score': 0},
        {'text': 'Λετονία', 'score': 0},
        {'text': 'Ελβετία', 'score': 10},
        {'text': 'Ουγγαρία', 'score': 0},
      ],
    },

//4.137
    {
      'questionText':
          'Ποια από τις πιο κάτω είναι εν δυνάμει υποψήφια προς ένταξη στην Ευρωπαϊκή Ένωση χώρα;',
      'answers': [
        {'text': 'Λιθουανία', 'score': 0},
        {'text': 'Βοσνία - Ερζεγοβίνη', 'score': 10},
        {'text': 'Λετονία', 'score': 0},
        {'text': 'Κροατία', 'score': 0},
      ],
    },

//4.138
    {
      'questionText':
          'Ποιο κράτος προσχώρησε στην Ευρωπαϊκή Ένωση την 1η Ιουλίου 2013;',
      'answers': [
        {'text': 'Ρουμανία', 'score': 0},
        {'text': 'Κροατία', 'score': 10},
        {'text': 'Νορβηγία', 'score': 0},
        {'text': 'Δανία', 'score': 0},
      ],
    },

//4.139
    {
      'questionText':
          'Με πόσα ακόμη κράτη της ευρωπαϊκής ηπείρου συνορεύει η Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': '6', 'score': 0},
        {'text': '10', 'score': 0},
        {'text': '12', 'score': 0},
        {'text': '18', 'score': 10},
      ],
    },

//4.140
    {
      'questionText':
          'Ποιο είναι το μικρότερο πληθυσμιακά κράτος μέλος της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Κύπρος', 'score': 0},
        {'text': 'Μάλτα', 'score': 10},
        {'text': 'Πολωνία', 'score': 0},
        {'text': 'Λουξεμβούργο', 'score': 0},
      ],
    },

//4.141
    {
      'questionText':
          'Ποια κριτήρια πρέπει να πληροί ένα κράτος για να προσχωρήσει στην Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': 'Μάαστριχτ', 'score': 0},
        {'text': 'Σένγκεν', 'score': 0},
        {'text': 'Λισαβόνας', 'score': 0},
        {'text': 'Κοπεγχάγης', 'score': 10},
      ],
    },

//4.142
    {
      'questionText': 'Δεν είναι ιδρυτικό μέλος της Ευρωπαϊκής Ένωσης:',
      'answers': [
        {'text': 'Το Βέλγιο', 'score': 0},
        {'text': 'Το Λουξεμβούργο', 'score': 0},
        {'text': 'Η Ισπανία', 'score': 10},
        {'text': 'Οι Κάτω Χώρες', 'score': 0},
      ],
    },

//4.143
    {
      'questionText': 'Το βορειότερο άκρο της Ευρωπαϊκής Ένωσης είναι η:',
      'answers': [
        {'text': 'Εσθονία', 'score': 0},
        {'text': 'Φινλανδία', 'score': 10},
        {'text': 'Λετονία', 'score': 0},
        {'text': 'Σουηδία', 'score': 0},
      ],
    },

//4.144
    {
      'questionText':
          'Η Λιουμπλιάνα είναι πρωτεύουσα αυτού του κράτους της ΕΕ:',
      'answers': [
        {'text': 'Αυστρίας', 'score': 0},
        {'text': 'Σλοβακίας', 'score': 0},
        {'text': 'Ιρλανδίας', 'score': 0},
        {'text': 'Σλοβενίας', 'score': 10},
      ],
    },

//4.145
    {
      'questionText':
          'Κράτος μέλος του οποίου η ονομασία σημαίνει «ανατολικό βασίλειο»:',
      'answers': [
        {'text': 'Βουλγαρία', 'score': 0},
        {'text': 'Τσεχία', 'score': 0},
        {'text': 'Αυστρία', 'score': 10},
        {'text': 'Ρουμανία', 'score': 0},
      ],
    },

//4.146
    {
      'questionText':
          'Ποιο από τα παρακάτω εδάφη δεν αποτελεί μέρος της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Μαδέρα', 'score': 0},
        {'text': 'Κανάριοι Νήσοι', 'score': 0},
        {'text': 'Γουαδελούπη', 'score': 0},
        {'text': 'Νήσοι Φερόες', 'score': 10},
      ],
    },

//4.147
    {
      'questionText':
          'Πότε έλαβε χώρα η τελευταία διεύρυνση της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': '1995', 'score': 0},
        {'text': '2004', 'score': 0},
        {'text': '2007', 'score': 0},
        {'text': '2013', 'score': 10},
      ],
    },

//4.148
    {
      'questionText':
          'Κοινή πατρίδα των Μότσαρτ, Σούμπερτ, Φρόυντ και Βιτγκενστάιν:',
      'answers': [
        {'text': 'Γερμανία', 'score': 0},
        {'text': 'Αυστρία', 'score': 10},
        {'text': 'Ουγγαρία', 'score': 0},
        {'text': 'Δανία', 'score': 0},
      ],
    },

//4.149
    {
      'questionText':
          'To Ίνσμπρουκ είναι πρωτεύουσα αυτού του κρατιδίου χώρας μέλους της ΕΕ:',
      'answers': [
        {'text': 'Μπούργκενλαντ', 'score': 0},
        {'text': 'Καρινθία', 'score': 0},
        {'text': 'Στυρία', 'score': 0},
        {'text': 'Τυρόλο της Αυστρίας', 'score': 10},
      ],
    },

//4.150
    {
      'questionText': 'Στο Βέλγιο αυτή η επαρχία αποτελεί τμήμα της Φλάνδρας:',
      'answers': [
        {'text': 'Λιμβουργία', 'score': 10},
        {'text': 'Ενό', 'score': 0},
        {'text': 'Ναμίρ', 'score': 0},
        {'text': 'Ζηλανδία', 'score': 0},
      ],
    },

//4.151
    {
      'questionText': 'Ο κωδικός κλήσης +32 ανήκει στο κράτος μέλος:',
      'answers': [
        {'text': 'Ελλάδα', 'score': 0},
        {'text': 'Βουλγαρία', 'score': 0},
        {'text': 'Βέλγιο', 'score': 10},
        {'text': 'Λουξεμβούργο', 'score': 0},
      ],
    },

//4.152
    {
      'questionText':
          'Βασική έδρα θεσμικών οργάνων της Ευρωπαϊκής Ένωσης, το όνομα της οποίας σημαίνει «σπίτι στον βάλτο»:',
      'answers': [
        {'text': 'Στρασβούργο', 'score': 0},
        {'text': 'Βρυξέλλες', 'score': 10},
        {'text': 'Χάγη', 'score': 0},
        {'text': 'Φρανκφούρτη', 'score': 0},
      ],
    },

//4.153
    {
      'questionText':
          'Το Λεβ αποτελεί εθνικό νόμισμα αυτού του κράτους μέλους:',
      'answers': [
        {'text': 'Ρουμανίας', 'score': 0},
        {'text': 'Ουγγαρίας', 'score': 0},
        {'text': 'Βουλγαρίας', 'score': 10},
        {'text': 'Πολωνίας', 'score': 0},
      ],
    },

//4.154
    {
      'questionText':
          'Ποιος ποταμός αποτελεί φυσικό σύνορο της Ρουμανίας και της Βουλγαρίας;',
      'answers': [
        {'text': 'Βόλγας', 'score': 0},
        {'text': 'Δούναβης', 'score': 10},
        {'text': 'Σηκουάνας', 'score': 0},
        {'text': 'Ρήνος', 'score': 0},
      ],
    },

//4.155
    {
      'questionText':
          'Ποια πόλη της Βουλγαρίας αποκαλείται και «θερινή πρωτεύουσα»;',
      'answers': [
        {'text': 'Σόφια', 'score': 0},
        {'text': 'Λόβετς', 'score': 0},
        {'text': 'Ρούσε', 'score': 0},
        {'text': 'Βάρνα', 'score': 10},
      ],
    },

//4.156
    {
      'questionText':
          'Η καγιέν είναι πρωτεύουσα υπερπόντιου διαμερίσματος της χώρας αυτής της ΕΕ:',
      'answers': [
        {'text': 'Γαλλίας', 'score': 10},
        {'text': 'Ιταλίας', 'score': 0},
        {'text': 'Πορτογαλίας', 'score': 0},
        {'text': 'Ισπανίας', 'score': 0},
      ],
    },

//4.157
    {
      'questionText':
          'Στο έμβλημά της αναγράφεται το σύνθημα «Ελευθερία, Ισότητα, Αδελφοσύνη»:',
      'answers': [
        {'text': 'Σλοβακίας', 'score': 0},
        {'text': 'Δανίας', 'score': 0},
        {'text': 'Ηνωμένου Βασιλείου', 'score': 0},
        {'text': 'Γαλλίας', 'score': 10},
      ],
    },

//4.158
    {
      'questionText':
          'Οι όχθες του ποταμού αυτού καταγράφονται από την UNESCO ανάμεσα στα μνημεία παγκόσμιας πολιτισμικής κληρονομιάς:',
      'answers': [
        {'text': 'Τάμεση', 'score': 0},
        {'text': 'Λίγηρα', 'score': 0},
        {'text': 'Σηκουάνα', 'score': 10},
        {'text': 'Γαρούνα', 'score': 0},
      ],
    },

//4.159
    {
      'questionText': 'Ποια είναι η πολυπληθέστερη χώρα στην Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': 'Πολωνία', 'score': 0},
        {'text': 'Γερμανία', 'score': 10},
        {'text': 'Ισπανία', 'score': 0},
        {'text': 'Ηνωμένο Βασίλειο', 'score': 0},
      ],
    },

//4.160
    {
      'questionText': 'Οι 12 κίονες στην Πύλη του Βρανδεμβούργου είναι ρυθμού:',
      'answers': [
        {'text': 'Ιωνικού', 'score': 0},
        {'text': 'Γοτθικού', 'score': 0},
        {'text': 'Κορινθιακού', 'score': 0},
        {'text': 'Δωρικού', 'score': 10},
      ],
    },

//4.161
    {
      'questionText':
          'Το Σπίτι του Γκαίτε αποτελεί αξιοθέατο της πόλης αυτής της ΕΕ:',
      'answers': [
        {'text': 'Δρέσδης', 'score': 0},
        {'text': 'Φρανκφούρτης', 'score': 10},
        {'text': 'Στουτγκάρδης', 'score': 0},
        {'text': 'Βρέμης', 'score': 0},
      ],
    },

//4.162
    {
      'questionText':
          'Η μικρή γοργόνα είναι τοποθετημένη στην άκρη του λιμανιού της:',
      'answers': [
        {'text': 'Μασσαλίας', 'score': 0},
        {'text': 'Νίκαιας', 'score': 0},
        {'text': 'Θεσσαλονίκης', 'score': 0},
        {'text': 'Κοπεγχάγης', 'score': 10},
      ],
    },

//4.163
    {
      'questionText':
          'Από πού καταγόταν ο λογοτέχνης και συγγραφέας παραμυθιών Χανς Κρίστιαν Άντερσεν;',
      'answers': [
        {'text': 'Σουηδία', 'score': 0},
        {'text': 'Αυστρία', 'score': 0},
        {'text': 'Δανία', 'score': 10},
        {'text': 'Φινλανδία', 'score': 0},
      ],
    },

//4.164
    {
      'questionText':
          'Πόσα μέτρα πάνω από το επίπεδο της θάλασσας βρίσκεται το υψηλότερο σημείο της Δανίας; ',
      'answers': [
        {'text': '532', 'score': 0},
        {'text': '173', 'score': 10},
        {'text': '246', 'score': 0},
        {'text': '309', 'score': 0},
      ],
    },

//4.165
    {
      'questionText': 'Κράτος μέλος στο νοτιότερο άκρο των Βαλκανίων:',
      'answers': [
        {'text': 'Ιταλία', 'score': 0},
        {'text': 'Ουγγαρία', 'score': 0},
        {'text': 'Σλοβενία', 'score': 0},
        {'text': 'Ελλάδα', 'score': 10},
      ],
    },

//4.166
    {
      'questionText':
          'Η Ελλάδα είναι το μοναδικό κράτος μέλος της Ευρωπαϊκής Ένωσης που έχει μεγαλύτερη ακτογραμμή από την:',
      'answers': [
        {'text': 'Κίνα', 'score': 10},
        {'text': 'Αυστραλία', 'score': 0},
        {'text': 'Ιαπωνία', 'score': 0},
        {'text': 'Ινδονησία', 'score': 0},
      ],
    },

//4.167
    {
      'questionText': 'Γιος του Δία και της Ευρώπης σύμφωνα με τη μυθολογία:',
      'answers': [
        {'text': 'Ορφέας', 'score': 0},
        {'text': 'Ηρακλής', 'score': 0},
        {'text': 'Περσέας', 'score': 0},
        {'text': 'Μίνωας', 'score': 10},
      ],
    },

//4.168
    {
      'questionText':
          'Το Σάαρεμαα είναι το μεγαλύτερο νησί της πιο κάτω χώρας της ΕΕ στη Βαλτική θάλασσα:',
      'answers': [
        {'text': 'Σουηδίας', 'score': 0},
        {'text': 'Λετονίας', 'score': 0},
        {'text': 'Εσθονίας', 'score': 10},
        {'text': 'Φινλανδίας', 'score': 0},
      ],
    },

//4.169
    {
      'questionText':
          'Η μεγαλύτερη υπερεθνική λίμνη γλυκού νερού στην Ευρώπη, στα σύνορα μεταξύ της Εσθονίας και της Ρωσίας, ονομάζεται:',
      'answers': [
        {'text': 'Λάντογκα', 'score': 0},
        {'text': 'Πέιπους', 'score': 10},
        {'text': 'Βένερν', 'score': 0},
        {'text': 'Σαϊμάα', 'score': 0},
      ],
    },

//4.170
    {
      'questionText':
          'Ο χαρακτηρισμός «Γηραιά Αλβιώνα» χρησιμοποιείται κάποιες φορές ως εναλλακτικό όνομα για αυτό το κράτος μέλος:',
      'answers': [
        {'text': 'Ηνωμένο Βασίλειο', 'score': 10},
        {'text': 'Γαλλία', 'score': 0},
        {'text': 'Ισπανία', 'score': 0},
        {'text': 'Γερμανία', 'score': 0},
      ],
    },

//4.171
    {
      'questionText': 'Με ποια από τις πιο κάτω χώρες δεν συνορεύει η Κροατία;',
      'answers': [
        {'text': 'Ουγγαρία', 'score': 0},
        {'text': 'Σλοβενία', 'score': 0},
        {'text': 'Σερβία', 'score': 0},
        {'text': 'Αυστρία', 'score': 10},
      ],
    },

//4.172
    {
      'questionText':
          'Αστικό κέντρο που δεν βρίσκεται στη βρετανική πλευρά της Μάγχης:',
      'answers': [
        {'text': 'Τόρκι', 'score': 0},
        {'text': 'Χερβούργο', 'score': 10},
        {'text': 'Μπόνορ Ρέτζις', 'score': 0},
        {'text': 'Ντόβερ', 'score': 0},
      ],
    },

//4.173
    {
      'questionText': 'Κράτος το οποίο εντάχθηκε στην Ευρωπαϊκή Ένωση το 1973:',
      'answers': [
        {'text': 'Λουξεμβούργο', 'score': 0},
        {'text': 'Τσεχία', 'score': 0},
        {'text': 'Ιρλανδία', 'score': 10},
        {'text': 'Βέλγιο', 'score': 0},
      ],
    },

//4.174
    {
      'questionText':
          'Το The Spire, μια χαλύβδινη «βελόνα» ύψους 120 μ., αποτελεί σύμβολο της πιο κάτω πρωτεύουσας κράτους μέλους:',
      'answers': [
        {'text': 'Ρίγας', 'score': 0},
        {'text': 'Πράγας', 'score': 0},
        {'text': 'Βίλνιους', 'score': 0},
        {'text': 'Δουβλίνου', 'score': 10},
      ],
    },

//4.175
    {
      'questionText':
          'Κράτος μέλος το οποίο καταλαμβάνει το μεγαλύτερο μέρος της Ιβηρικής χερσονήσου:',
      'answers': [
        {'text': 'Πορτογαλία', 'score': 0},
        {'text': 'Ισπανία', 'score': 10},
        {'text': 'Ιταλία', 'score': 0},
        {'text': 'Γαλλία', 'score': 0},
      ],
    },

//4.176
    {
      'questionText': 'Αρχηγός του ισπανικού κράτους είναι ο:',
      'answers': [
        {'text': 'Βασιλιάς', 'score': 10},
        {'text': 'Πρωθυπουργός', 'score': 0},
        {'text': 'Πρόεδρος της Δημοκρατίας', 'score': 0},
        {'text': 'Καγκελάριος', 'score': 0},
      ],
    },

//4.177
    {
      'questionText':
          'Το ημιτελές έργο του Γκαουντί, η εκκλησία Σαγράδα Φαμίλια, βρίσκεται στη(ν):',
      'answers': [
        {'text': 'Μαδρίτη', 'score': 0},
        {'text': 'Ανδαλουσία', 'score': 0},
        {'text': 'Βαρκελώνη', 'score': 10},
        {'text': 'Βαλένθια', 'score': 0},
      ],
    },

//4.178
    {
      'questionText': 'Το σχήμα αυτής της χώρας της ΕΕ μοιάζει με μπότα:',
      'answers': [
        {'text': 'Σουηδία', 'score': 0},
        {'text': 'Πορτογαλία', 'score': 0},
        {'text': 'Ελλάδα', 'score': 0},
        {'text': 'Ιταλία', 'score': 10},
      ],
    },

//4.179
    {
      'questionText':
          'Από πόσους ορόφους (μαζί με το καμπαναριό) αποτελείται ο κεκλιμένος πύργος της Πίζας, στη βορειοδυτική Ιταλία;',
      'answers': [
        {'text': '6', 'score': 0},
        {'text': '8', 'score': 10},
        {'text': '12', 'score': 0},
        {'text': '17', 'score': 0},
      ],
    },

//4.180
    {
      'questionText': 'Πρόεδρος της Ιταλίας από το 2015 είναι ο:',
      'answers': [
        {'text': 'Μάριο Μόντι (Mario Monti)', 'score': 0},
        {'text': 'Ρομάνο Πρόντι (Romano Prodi)', 'score': 0},
        {'text': 'Τζόρτζιο Ναπολιτάνο (Giorgio Napolitano)', 'score': 0},
        {'text': 'Σέρτζιο Ματαρέλα (Sergio Mattarella)', 'score': 10},
      ],
    },

//4.181
    {
      'questionText':
          'Νοτιοανατολικό άκρο της Ευρωπαϊκής Ένωσης αλλά και της Ευρώπης ολόκληρης:',
      'answers': [
        {'text': 'Ρουμανία', 'score': 0},
        {'text': 'Ελλάδα', 'score': 0},
        {'text': 'Κύπρος', 'score': 10},
        {'text': 'Βουλγαρία', 'score': 0},
      ],
    },

//4.182
    {
      'questionText':
          'Στα κυπριακά κέρματα ευρώ των 1, 2 και 5 λεπτών απεικονίζεται:',
      'answers': [
        {'text': 'Το αρχαίο καράβι της Κερύνειας', 'score': 0},
        {'text': 'Η Πέτρα του Ρωμιού', 'score': 0},
        {'text': 'Το σταυρόσχημο ειδώλιο του Πωμού', 'score': 0},
        {'text': 'Το αγρινό', 'score': 10},
      ],
    },

//4.183
    {
      'questionText': 'Το πολίτευμα της Κύπρου είναι:',
      'answers': [
        {'text': 'Βασιλευόμενη κοινοβουλευτική δημοκρατία', 'score': 0},
        {'text': 'Απόλυτη μοναρχία', 'score': 0},
        {'text': 'Προεδρική δημοκρατία', 'score': 10},
        {'text': 'Προεδρευόμενη κοινοβουλευτική δημοκρατία', 'score': 0},
      ],
    },

//4.184
    {
      'questionText':
          'Ποιας κουζίνας, κράτους της ΕΕ, χαρακτηριστική σπεσιαλιτέ είναι τα πιροσκί με μπέικον; ',
      'answers': [
        {'text': 'Ιταλικής', 'score': 0},
        {'text': 'Λετονικής', 'score': 10},
        {'text': 'Φινλανδικής', 'score': 0},
        {'text': 'Εσθονικής', 'score': 0},
      ],
    },

//4.185
    {
      'questionText':
          'Άγαλμα της Ελευθερίας, ύψους 43 μέτρων, βρίσκεται στην πρωτεύουσα της πιο κάτω χώρας της Ευρωπαϊκής Ένωσης:',
      'answers': [
        {'text': 'Σουηδίας', 'score': 0},
        {'text': 'Γερμανίας', 'score': 0},
        {'text': 'Γαλλίας', 'score': 0},
        {'text': 'Λετονίας', 'score': 10},
      ],
    },

//4.186
    {
      'questionText':
          'Το λετονικό κοινοβούλιο (Saeima), είναι ένα νομοθετικό σώμα:',
      'answers': [
        {'text': '84 εδρών', 'score': 0},
        {'text': '100 εδρών', 'score': 10},
        {'text': '165 εδρών', 'score': 0},
        {'text': '300 εδρών', 'score': 0},
      ],
    },

//4.187
    {
      'questionText':
          'Ποιο είναι το μεγαλύτερο και πολυπληθέστερο βαλτικό κράτος της ΕΕ;',
      'answers': [
        {'text': 'Εσθονία', 'score': 0},
        {'text': 'Λετονία', 'score': 0},
        {'text': 'Λιθουανία', 'score': 10},
        {'text': 'Σουηδία', 'score': 0},
      ],
    },

//4.188
    {
      'questionText':
          'Πότε απέκτησε την ανεξαρτησία της η Λιθουανία από τη Σοβιετική Ένωση;',
      'answers': [
        {'text': '1959', 'score': 0},
        {'text': '1964', 'score': 0},
        {'text': '1978', 'score': 0},
        {'text': '1990', 'score': 10},
      ],
    },

//4.189
    {
      'questionText': 'Οι λίμνες της Λιθουανίας είναι περισσότερες από:',
      'answers': [
        {'text': '8000', 'score': 0},
        {'text': '11000', 'score': 0},
        {'text': '2800', 'score': 10},
        {'text': '7000', 'score': 0},
      ],
    },

//4.190
    {
      'questionText':
          'Ιδρυτικό κράτος μέλος της ΕΕ και του OΗΕ, με μόλις μισό εκατομμύριο πληθυσμό:',
      'answers': [
        {'text': 'Μάλτα', 'score': 0},
        {'text': 'Λουξεμβούργο', 'score': 10},
        {'text': 'Δανία', 'score': 0},
        {'text': 'Κύπρος', 'score': 0},
      ],
    },

//4.191
    {
      'questionText': 'Το Λουξεμβούργο είναι ένα μεγάλο:',
      'answers': [
        {'text': 'Δουκάτο', 'score': 10},
        {'text': 'Πριγκιπάτο', 'score': 0},
        {'text': 'Εμιράτο', 'score': 0},
        {'text': 'Καντόνιο', 'score': 0},
      ],
    },

//4.192
    {
      'questionText':
          'Ο Σαβιέ Μπετέλ είναι πρωθυπουργός του Λουξεμβούργου από το:',
      'answers': [
        {'text': '1984', 'score': 0},
        {'text': '1995', 'score': 0},
        {'text': '2008', 'score': 0},
        {'text': '2013', 'score': 10},
      ],
    },

//4.193
    {
      'questionText':
          'Κράτος μέλος του οποίου η εθνική γλώσσα ανήκει στην ίδια οικογένεια σημιτικών γλωσσών με τα αραβικά:',
      'answers': [
        {'text': 'Ισπανία', 'score': 0},
        {'text': 'Κύπρος', 'score': 0},
        {'text': 'Μάλτα', 'score': 10},
        {'text': 'Βουλγαρία', 'score': 0},
      ],
    },

//4.194
    {
      'questionText': 'Ποιο νησί του αρχιπελάγους της Μάλτας δεν κατοικείται;',
      'answers': [
        {'text': 'Μάλτα', 'score': 0},
        {'text': 'Γκόζο', 'score': 0},
        {'text': 'Κομίνο', 'score': 0},
        {'text': 'Φίλφλα', 'score': 10},
      ],
    },

//4.195
    {
      'questionText': 'Χώρα της ΕΕ που αποκαλείται και «χώρα της τουλίπας»:',
      'answers': [
        {'text': 'Σλοβακία', 'score': 0},
        {'text': 'Ολλανδία', 'score': 10},
        {'text': 'Τσεχία', 'score': 0},
        {'text': 'Αυστρία', 'score': 0},
      ],
    },

//4.196
    {
      'questionText':
          'Η επαρχία Φλέβολαντ της Ολλανδίας ονομάζεται Πόλντερ, καθότι προηγουμένως υπήρξε:',
      'answers': [
        {'text': 'Λίμνη', 'score': 0},
        {'text': 'Βάλτος', 'score': 0},
        {'text': 'Οροπέδιο', 'score': 0},
        {'text': 'Θάλασσα', 'score': 10},
      ],
    },

//4.197
    {
      'questionText':
          'Με τη σημαία ποιου άλλου κράτους της ΕΕ μοιάζει περισσότερο η σημαία της Ολλανδίας;',
      'answers': [
        {'text': 'Γαλλίας', 'score': 0},
        {'text': 'Τσεχίας', 'score': 0},
        {'text': 'Λουξεμβούργου', 'score': 10},
        {'text': 'Σλοβενίας', 'score': 0},
      ],
    },

//4.198
    {
      'questionText':
          'Οι άλλοτε δύο ξεχωριστές πόλεις Βούδα και Πέστη αποτελούν τώρα πρωτεύουσα αυτής της χώρας της Ευρωπαϊκής Ένωσης:',
      'answers': [
        {'text': 'Ρουμανίας', 'score': 0},
        {'text': 'Αυστρίας', 'score': 0},
        {'text': 'Γερμανίας', 'score': 0},
        {'text': 'Ουγγαρίας', 'score': 10},
      ],
    },

//4.199
    {
      'questionText':
          'Με ποιο άλλο μεγάλο κράτος της ΕΕ συναποτέλεσε μέχρι το 1918 η Ουγγαρία μέρος μιας μεγάλης αυτοκρατορίας της κεντρικής Ευρώπης;',
      'answers': [
        {'text': 'Αυστρία', 'score': 10},
        {'text': 'Πολωνία', 'score': 0},
        {'text': 'Γαλλία', 'score': 0},
        {'text': 'Βουλγαρία', 'score': 0},
      ],
    },

//4.200
    {
      'questionText':
          'Το αλατωρυχείο της Βιελίτσκα, μνημείο Παγκόσμιας κληρονομιάς της ουνέσκο, μια ολόκληρη πόλη κάτω από το έδαφος, βρίσκεται σε αυτό το κράτος μέλος:',
      'answers': [
        {'text': 'Ολλανδία', 'score': 0},
        {'text': 'Σουηδία', 'score': 0},
        {'text': 'Ρουμανία', 'score': 0},
        {'text': 'Πολωνία', 'score': 10},
      ],
    },

//4.201
    {
      'questionText': 'Επιφανής προσωπικότητα, όχι όμως πολωνικής καταγωγής:',
      'answers': [
        {'text': 'Βάγκνερ (Wagner)', 'score': 10},
        {'text': 'Κοπέρνικος (Copernicus)', 'score': 0},
        {'text': 'Σοπέν (Chopin)', 'score': 0},
        {'text': 'Μαρί Κιουρί (Marie Curie)', 'score': 0},
      ],
    },

//4.202
    {
      'questionText':
          'Ο διεθνής ποδοσφαιριστής Κριστιάνο Ρονάλντο κατάγεται από αυτό το κράτος μέλος της ΕΕ:',
      'answers': [
        {'text': 'Ιταλία', 'score': 0},
        {'text': 'Πορτογαλία', 'score': 10},
        {'text': 'Κύπρο', 'score': 0},
        {'text': 'Φινλανδία', 'score': 0},
      ],
    },

//4.203
    {
      'questionText':
          'Στην Ιβηρική χερσόνησο, μαζί με την Πορτογαλία, βρίσκεται ακόμη μία χώρα της ΕΕ, η:',
      'answers': [
        {'text': 'Γερμανία', 'score': 0},
        {'text': 'Γαλλία', 'score': 0},
        {'text': 'Ισπανία', 'score': 10},
        {'text': 'Δανία', 'score': 0},
      ],
    },

//4.204
    {
      'questionText':
          'Ο θρύλος του Δράκουλα ανάγεται στον κόμη Βλαντ Ντρακούλ, που έζησε το 15ο αιώνα, στη σημερινή (χώρα της ΕΕ):',
      'answers': [
        {'text': 'Αυστρία', 'score': 0},
        {'text': 'Ουγγαρία', 'score': 0},
        {'text': 'Βουλγαρία', 'score': 0},
        {'text': 'Ρουμανία', 'score': 10},
      ],
    },

//4.205
    {
      'questionText':
          'Κορυφαία αθλήτρια της ενόργανης γυμναστικής από τη Ρουμανία, η πρώτη που βραβεύτηκε με το τέλειο 10:',
      'answers': [
        {'text': 'Καρολίν Βοζνιάκι (Caroline Wozniacki)', 'score': 0},
        {'text': 'Νάντια Κομανέτσι (Nadia Comaneci)', 'score': 10},
        {'text': 'Σερένα Γουίλιαμς (Serena Williams)', 'score': 0},
        {'text': 'Άνα Ιβάνοβιτς (Ana Ivanovic)', 'score': 0},
      ],
    },

//4.206
    {
      'questionText':
          'Χώρα μέλος της ΕΕ που προέκυψε το 1993 όταν χωρίστηκε στα δύο ένα άλλο κράτος:',
      'answers': [
        {'text': 'Σλοβενία', 'score': 0},
        {'text': 'Γερμανία', 'score': 0},
        {'text': 'Σλοβακία', 'score': 10},
        {'text': 'Λιθουανία', 'score': 0},
      ],
    },

//4.207
    {
      'questionText':
          'Ο Σλοβακικής καταγωγής Στέφαν Μπάνιτς, εφηύρε, το 1913, το σύγχρονο:',
      'answers': [
        {'text': 'Αλεξίπτωτο', 'score': 10},
        {'text': 'Αερόστατο', 'score': 0},
        {'text': 'Ανεμόπτερο', 'score': 0},
        {'text': 'Αλεξικέραυνο', 'score': 0},
      ],
    },

//4.208
    {
      'questionText':
          'Η πρώτη χώρα, κομμάτι της πρώην Γιουγκοσλαβίας, η οποία το 2004 έγινε κράτος μέλος της Ευρωπαϊκής Ένωσης:',
      'answers': [
        {'text': 'Σερβία', 'score': 0},
        {'text': 'Κροατία', 'score': 0},
        {'text': 'Βουλγαρία', 'score': 0},
        {'text': 'Σλοβενία', 'score': 10},
      ],
    },

//4.209
    {
      'questionText':
          'Ο φανταστικός χαρακτήρας Μαρτίν κρπαν, λαϊκός ήρωας της Σλοβενίας, σύμφωνα με τον μύθο, έκανε αρχικά λαθρεμπόριο:',
      'answers': [
        {'text': 'Μπαχαρικών', 'score': 0},
        {'text': 'Μεταξιού', 'score': 0},
        {'text': 'Αλατιού', 'score': 10},
        {'text': 'Διαμαντιών', 'score': 0},
      ],
    },

//4.210
    {
      'questionText':
          'Χώρα της Ευρωπαϊκής Ένωσης με τον μεγαλύτερο πληθυσμό από όλες τις σκανδιναβικές χώρες:',
      'answers': [
        {'text': 'Φινλανδία', 'score': 0},
        {'text': 'Σουηδία', 'score': 10},
        {'text': 'Δανία', 'score': 0},
        {'text': 'Γερμανία', 'score': 0},
      ],
    },

//4.211
    {
      'questionText':
          'Η Στοκχόλμη, πρωτεύουσα της Σουηδίας, είναι γνωστή για τα βραβεία:',
      'answers': [
        {'text': 'Όσκαρ', 'score': 0},
        {'text': 'Έμμυ', 'score': 0},
        {'text': 'Πούλιτζερ', 'score': 0},
        {'text': 'Νόμπελ', 'score': 10},
      ],
    },

//4.212
    {
      'questionText':
          'Κράτος μέλος της ΕΕ που παράγει μεγάλες ποσότητες μεταλλικού νερού από 900 φυσικές πηγές (παγκόσμιο ρεκόρ):',
      'answers': [
        {'text': 'Τσεχία', 'score': 10},
        {'text': 'Κύπρος', 'score': 0},
        {'text': 'Ελλάδα', 'score': 0},
        {'text': 'Ολλανδία', 'score': 0},
      ],
    },

//4.213
    {
      'questionText':
          'Τα νερά των ποταμών της Τσεχίας δεν χύνονται σε αυτή τη θάλασσα:',
      'answers': [
        {'text': 'Βόρεια Θάλασσα', 'score': 0},
        {'text': 'Βαλτική Θάλασσα', 'score': 0},
        {'text': 'Μεσόγειο Θάλασσα', 'score': 10},
        {'text': 'Μαύρη Θάλασσα', 'score': 0},
      ],
    },

//4.214
    {
      'questionText':
          'Τον χειμώνα, σε αυτή τη χώρα της Ευρωπαϊκής Ένωσης, για 8 περίπου εβδομάδες ο ήλιος δεν ανατέλλει:',
      'answers': [
        {'text': 'Δανία', 'score': 0},
        {'text': 'Εσθονία', 'score': 0},
        {'text': 'Πορτογαλία', 'score': 0},
        {'text': 'Φινλανδία', 'score': 10},
      ],
    },

//4.215
    {
      'questionText': 'Διάσημος Φινλανδός πιλότος της Φόρμουλα 1:',
      'answers': [
        {'text': 'Ζακ Βιλνέβ (Jacques Villeneuve)', 'score': 0},
        {'text': 'Κίμι Ραϊκόνεν (Kimi Räikkönen)', 'score': 10},
        {'text': 'Άιρτον Σένα (Ayrton Senna)', 'score': 0},
        {'text': 'Λιούις Χάμιλτον (Lewis Hamilton)', 'score': 0},
      ],
    },

//4.216
    {
      'questionText':
          'Ο όρος καγκελάριος, ως πολιτικό αξίωμα αντίστοιχο του πρωθυπουργού, ισχύει σε αυτό το κράτος μέλος της Ευρωπαϊκής Ένωσης:',
      'answers': [
        {'text': 'Ηνωμένο Βασίλειο', 'score': 0},
        {'text': 'Γαλλία', 'score': 0},
        {'text': 'Αυστρία', 'score': 10},
        {'text': 'Ιταλία', 'score': 0},
      ],
    },

//5.217
    {
      'questionText':
          'Προτεραιότητα της κυπριακής Προεδρίας στον τομέα της νεολαίας ήταν:',
      'answers': [
        {'text': 'Η συμμετοχή και κοινωνική ενσωμάτωση των νέων', 'score': 10},
        {'text': 'Ο εθελοντισμός', 'score': 0},
        {'text': 'Η καινοτομία', 'score': 0},
        {'text': 'Η εξασφάλιση περισσότερων θέσεων εργασίας', 'score': 0},
      ],
    },

//5.218
    {
      'questionText': 'Ποια ήταν η «Ευρωπαϊκή Πρωτεύουσα Νεολαίας» το 2019;',
      'answers': [
        {'text': 'Το Νόβι Σάντ', 'score': 10},
        {'text': 'Η Μπράγκα', 'score': 0},
        {'text': 'Η Θεσσαλονίκη', 'score': 0},
        {'text': 'Το Παλέρμο', 'score': 0},
      ],
    },

//5.219
    {
      'questionText': 'Το Ευρωπαϊκό κοινοβούλιο Νέων καθιερώθηκε:',
      'answers': [
        {'text': 'Το 1992', 'score': 0},
        {'text': 'Το 2000', 'score': 0},
        {'text': 'Το 1982', 'score': 0},
        {'text': 'Το 1987', 'score': 10},
      ],
    },

//5.220
    {
      'questionText':
          'Σε ποιες προσωπικότητες απονεμήθηκε, το 2016, το Βραβείο Ζαχάρωφ του Ευρωπαϊκού Κοινοβουλίου για την ελευθερίας της σκέψης;',
      'answers': [
        {
          'text':
              'Στη Μαλάλα Γιουσαφζάι (Malala Yousafzai) και την Αλίν Μουκόβι Νίιμα',
          'score': 0
        },
        {
          'text': 'Στον Στινγκ (Sting) και τον Τζάστιν Τρυντό (Justin Trudeau)',
          'score': 0
        },
        {
          'text':
              'Στη Νάντια Μουράντ Μπασί Ταχά (Nadia Murad Basee Taha) και την Λαμίγια Ατζί Μπασάρ',
          'score': 10
        },
        {
          'text':
              'Στον Χουάν Μανουέλ Σάντος (Juan Manuel Santos) και τον Μπομπ Ντύλαν (Bob Dylan)',
          'score': 0
        },
      ],
    },

//5.221
    {
      'questionText': 'Το βραβείο Lux καθιερώθηκε το 2007 και έχει στόχο:',
      'answers': [
        {
          'text': 'Το βραβείο Lux καθιερώθηκε το 2007 και έχει στόχο:',
          'score': 0
        },
        {
          'text':
              'Τη βράβευση μαθητών που ασχολούνται με ευρωπαϊκά προγράμματα',
          'score': 0
        },
        {
          'text':
              'Τη βράβευση δημοσιογράφων που ασχολούνται ενεργά με θέματα του Κοινοβουλίου',
          'score': 0
        },
        {
          'text':
              'Τη βράβευση ευρωπαϊκών ταινιών οι οποίες προωθούν τις ευρωπαϊκές αξίες',
          'score': 10
        },
      ],
    },

//5.222
    {
      'questionText': 'Στόχοι της πρωτοβουλίας «Νεολαία σε κίνηση» είναι:',
      'answers': [
        {'text': 'Η εκπαίδευση και απασχόληση των νέων', 'score': 10},
        {'text': 'Η υγιής ψυχαγωγία', 'score': 0},
        {'text': 'Η εθελοντική εργασία', 'score': 0},
        {'text': 'Η προάσπιση των δικαιωμάτων των νέων', 'score': 0},
      ],
    },

//5.223
    {
      'questionText':
          '«Διπλή καριέρα - Dualcareers» στον Αθλητισμό σημαίνει ότι οι αθλητές:',
      'answers': [
        {
          'text':
              'Υψηλών επιδόσεων έχουν τη δυνατότητα να σπουδάζουν παράλληλα με τις προπονήσεις τους',
          'score': 10
        },
        {'text': 'Ασχολούνται με δύο επαγγέλματα', 'score': 0},
        {
          'text':
              'Αποφασίζουν αν θα ασχοληθούν με δύο πανεπιστημιακές κατευθύνσεις',
          'score': 0
        },
        {'text': 'Δεν γνωρίζουν τί ακριβώς θα ακολουθήσουν', 'score': 0},
      ],
    },

//5.224
    {
      'questionText':
          'Οι δράσεις για την πρωτοβουλία «Νεολαία σε κίνηση» άρχισαν να τίθενται σε εφαρμογή:',
      'answers': [
        {'text': 'Το 2012', 'score': 0},
        {'text': 'Το 2010', 'score': 10},
        {'text': 'Το 2001', 'score': 0},
        {'text': 'Το 2000', 'score': 0},
      ],
    },

//5.225
    {
      'questionText':
          'Ως πολίτης της ΕΕ, έχετε το δικαίωμα να κάνετε πανεπιστημιακές σπουδές σε οποιαδήποτε χώρα της ΕΕ.',
      'answers': [
        {'text': 'Ναι', 'score': 10},
        {'text': 'Όχι', 'score': 0},
        {
          'text': 'Εναπόκειται στην πολιτική του κάθε κράτους μέλους',
          'score': 0
        },
        {'text': 'Ναι, αλλά θα καταβάλλετε υψηλότερα δίδακτρα', 'score': 0},
      ],
    },

//5.226
    {
      'questionText':
          'Υπάρχει αυτόματη αναγνώριση των τίτλων σπουδών σε όλη την Ευρώπη;',
      'answers': [
        {'text': 'Ναι', 'score': 0},
        {
          'text':
              'Κάθε χώρα εφαρμόζει τους δικούς της κανόνες για την αναγνώριση πτυχίων',
          'score': 10
        },
        {'text': 'Θα ισχύει η αυτόματη αναγνώριση από το 2020', 'score': 0},
        {
          'text': 'Μόνο εάν ο κάτοχος του πτυχίου εγκατασταθεί μόνιμα στη χώρα',
          'score': 0
        },
      ],
    },

//5.227
    {
      'questionText':
          'Πού στοχεύουν οι δράσεις της πρωτοβουλίας «Ευκαιρίες για τους Νέους»;',
      'answers': [
        {'text': 'Στην αύξηση της παραγωγικότητας', 'score': 0},
        {'text': 'Στην επιστημονική κατάρτιση', 'score': 0},
        {'text': 'Στη μείωση της ανεργίας των νέων', 'score': 10},
        {'text': 'Στη βελτίωση των συνθηκών διαβίωσης των νέων', 'score': 0},
      ],
    },

//5.228
    {
      'questionText':
          'Πώς ονομάζεται η πρωτοβουλία της Ε.Επιτροπής στο πλαίσιο της στρατηγικής «Ευρώπη 2020» για την εκπαίδευση και την απασχόληση των νέων της ΕΕ;',
      'answers': [
        {'text': 'Νεολαία σε Κίνηση', 'score': 10},
        {'text': 'Ευρωπαϊκή Ένωση για τη Νεολαία', 'score': 0},
        {'text': 'Νεολαία για το 2020', 'score': 0},
        {'text': 'Κινητικότητα για τους Νέους', 'score': 0},
      ],
    },

//5.229
    {
      'questionText':
          'Αν μεταβείτε σε άλλη χώρα της ΕΕ για πρακτική άσκηση ή επαγγελματική κατάρτιση, πρέπει να διαθέτετε πλήρη υγειονομική κάλυψη στη χώρα υποδοχής;',
      'answers': [
        {'text': 'Ναι', 'score': 10},
        {'text': 'Όχι', 'score': 0},
        {'text': 'Ανάλογα με την πολιτική κάθε χώρας', 'score': 0},
        {
          'text': 'Σας καλύπτει η ευρωπαϊκή κάρτα ασφάλισης ασθενείας',
          'score': 0
        },
      ],
    },

//5.230
    {
      'questionText':
          'Ο εθελοντισμός είναι ένας θαυμάσιος τρόπος για να βοηθήσει κανείς τοπικές κοινότητες στη χώρα του ή στο εξωτερικό. Αρμόδια Αρχή είναι:',
      'answers': [
        {'text': 'Ο Ευρωπαϊκός Οργανισμός Περιβάλλοντος', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Επιτροπή', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Εθελοντική Υπηρεσία', 'score': 10},
      ],
    },

//5.231
    {
      'questionText':
          'Ποιες χώρες της ΕΕ άσκησαν την Προεδρία της Ένωσης το 2017;',
      'answers': [
        {'text': 'Η Πολωνία και η Αυστρία', 'score': 0},
        {'text': 'Η Μάλτα και η Εσθονία', 'score': 10},
        {'text': 'Η Μάλτα και η Γερμανία', 'score': 0},
        {'text': 'Η Λετονία και η Λιθουανία', 'score': 0},
      ],
    },

//5.232
    {
      'questionText':
          'Τι ποσοστό παιδιών στην Ευρώπη πέφτουν θύματα κάποιας μορφής σεξουαλικής κακοποίησης;',
      'answers': [
        {'text': '10%-20%', 'score': 10},
        {'text': '5%', 'score': 0},
        {'text': '50%', 'score': 0},
        {'text': '2%', 'score': 0},
      ],
    },

//5.233
    {
      'questionText': 'Η Κύπρος άσκησε την εξάμηνη Προεδρία της ΕΕ το:',
      'answers': [
        {'text': '2011', 'score': 0},
        {'text': '2014', 'score': 0},
        {'text': '2012', 'score': 10},
        {'text': '2015', 'score': 0},
      ],
    },

//5.234
    {
      'questionText': 'H Ευρωπαϊκή κάρτα Νέων είναι:',
      'answers': [
        {'text': 'Εκπτωτική', 'score': 10},
        {'text': 'Φοιτητική', 'score': 0},
        {'text': 'Πιστωτική', 'score': 0},
        {'text': 'Ταξιδιωτική', 'score': 0},
      ],
    },

//5.235
    {
      'questionText':
          'Πόσο ήταν το ποσοστό της νεανικής ανεργίας στην ΕΕ τον Αύγουστο του 2019;',
      'answers': [
        {'text': '8,5%', 'score': 0},
        {'text': '15,3%', 'score': 0},
        {'text': '40,1%', 'score': 0},
        {'text': '14,2%', 'score': 10},
      ],
    },

//5.236
    {
      'questionText': 'Ποια ευρωπαϊκή χώρα είναι πρώτη στην ανεργία νέων;',
      'answers': [
        {'text': 'Ισπανία', 'score': 0},
        {'text': 'Ελλάδα', 'score': 10},
        {'text': 'Αυστρία', 'score': 0},
        {'text': 'Γερμανία', 'score': 0},
      ],
    },

//5.237
    {
      'questionText':
          'Τι ποσοστό των παιδιών στην ΕΕ αντιμετωπίζει τον κίνδυνο της φτώχειας (στοιχεία 2018);',
      'answers': [
        {'text': '50%', 'score': 0},
        {'text': '19%', 'score': 0},
        {'text': '4%', 'score': 0},
        {'text': '24%', 'score': 10},
      ],
    },

//5.238
    {
      'questionText': 'Το πρόγραμμα Νεολαία σε Δράση αποσκοπεί:',
      'answers': [
        {
          'text': 'Στην ενθάρρυνση της συμμετοχής των νέων στη δημόσια ζωή',
          'score': 10
        },
        {'text': 'Στην επαγγελματική κατάρτιση και εκπαίδευση', 'score': 0},
        {'text': 'Στη μείωση της ανεργίας', 'score': 0},
        {
          'text':
              'Στην ενημέρωση των πολιτών για τα δικαιώματα και τις υποχρεώσεις τους',
          'score': 0
        },
      ],
    },

//5.239
    {
      'questionText':
          'Ποιο πρόγραμμα δίνει την ευκαιρία σε μαθητές ηλικίας 16-18 ετών να επισκεφθούν το Στρασβούργο και να γίνουν ευρωβουλευτές για μία μέρα;',
      'answers': [
        {'text': 'Leonardo da Vinci', 'score': 0},
        {'text': 'Comenius', 'score': 0},
        {'text': 'Euroscola', 'score': 10},
        {'text': 'Erasmus', 'score': 0},
      ],
    },

//5.240
    {
      'questionText':
          'Το εκπαιδευτικό πρόγραμμα Euroscola προσφέρει τη δυνατότητα σε μαθητές λυκείου:',
      'answers': [
        {'text': 'Να αποκτήσουν γνώσεις για τις νέες τεχνολογίες', 'score': 0},
        {
          'text':
              'Να αναπτύσσουν τη φαντασία τους και να αποκτήσουν νέες καλλιτεχνικές δεξιότητες',
          'score': 0
        },
        {
          'text':
              'Να εκφράσουν τις προσδοκίες και τα σχέδιά τους για την ευρωπαϊκή οικοδόμηση',
          'score': 10
        },
        {
          'text': 'Να «μυηθούν» στις αξίες και τους κανόνες του Χριστιανισμού',
          'score': 0
        },
      ],
    },

//5.241
    {
      'questionText': 'Ποιο ήταν το θέμα της Ευρωπαϊκής Χρονιάς του 2018;',
      'answers': [
        {'text': 'Η Ευρωπαϊκή χρονιά του εθελοντισμού', 'score': 0},
        {
          'text': 'Η Ευρωπαϊκή χρονιά της πολιτισμικής κληρονομιάς',
          'score': 10
        },
        {'text': 'Η Ευρωπαϊκή χρονιά των γλωσσών', 'score': 0},
        {'text': 'Η Ευρωπαϊκή χρονιά των ανθρώπων με αναπηρίες', 'score': 0},
      ],
    },

//5.242
    {
      'questionText':
          'Ποιοι συμμετέχουν στις ημερίδες Euroscola που διοργανώνονται στο Στρασβούργο της Γαλλίας; ',
      'answers': [
        {'text': 'Παιδιά δημοτικής εκπαίδευσης', 'score': 0},
        {'text': 'Μαθητές λυκείου', 'score': 10},
        {'text': 'Νέοι επιχειρηματίες', 'score': 0},
        {'text': 'Εκπαιδευτικοί', 'score': 0},
      ],
    },

//5.243
    {
      'questionText':
          'Το ετήσιο Ευρωπαϊκό Βραβείο Καρλομάγνου για τη Νεολαία έχει στόχο:',
      'answers': [
        {
          'text':
              'Να ενθαρρύνει την ανάπτυξη της ευρωπαϊκής συνείδησης μεταξύ των νέων',
          'score': 10
        },
        {
          'text': 'Να προωθήσει καινοτόμα επιχειρηματικά προγράμματα',
          'score': 0
        },
        {
          'text':
              'Να ενθαρρύνει νέες πρωτοβουλίες στον χώρο της εκμάθησης και διδασκαλίας γλωσσών',
          'score': 0
        },
        {
          'text': 'Να εξαλείψει τις προκαταλήψεις εναντίον των «ξένων»',
          'score': 0
        },
      ],
    },

//5.244
    {
      'questionText':
          'Πότε η Κύπρος υπέβαλε αίτηση για ένταξη στην Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': '1990', 'score': 10},
        {'text': '1987', 'score': 0},
        {'text': '1992', 'score': 0},
        {'text': '1995', 'score': 0},
      ],
    },

//5.245
    {
      'questionText': 'Από ποιες χώρες της ΕΕ περνάει ο ποταμός Δούναβης;',
      'answers': [
        {
          'text':
              'Γερμανία, Αυστρία, Σλοβακία, Κροατία, Ουγγαρία, Ρουμανία και Βουλγαρία',
          'score': 10
        },
        {
          'text': 'Γερμανία, Αυστρία, Σερβία, Ουγγαρία, Ρουμανία και Βουλγαρία',
          'score': 0
        },
        {
          'text':
              'Γερμανία, Αυστρία, Σλοβακία, Ουγγαρία, Ρουμανία και Βουλγαρία',
          'score': 0
        },
        {
          'text':
              'Γερμανία, Αυστρία, Κροατία, Ουγγαρία, Ρουμανία και Βουλγαρία',
          'score': 0
        },
      ],
    },

//5.246
    {
      'questionText': 'Η Ευρωπαϊκή Συνομοσπονδία JADE έχει στόχο να:',
      'answers': [
        {'text': 'Υπερασπίζει τα δικαιώματα των εργαζομένων', 'score': 0},
        {
          'text': 'Προάγει την ιδέα της νεανικής επιχειρηματικότητας',
          'score': 10
        },
        {'text': 'Προωθεί την καινοτομία', 'score': 0},
        {'text': 'Στηρίζει τις ευάλωτες ομάδες πληθυσμού', 'score': 0},
      ],
    },

//5.247
    {
      'questionText':
          'Ο Τσέχος θεολόγος και φιλόσοφος Γιόχαν Άμος Κομένιους (1592-1670) ήταν ένας από τους πατέρες:',
      'answers': [
        {'text': 'Της σύγχρονης παιδείας', 'score': 10},
        {'text': 'Της αστρονομίας', 'score': 0},
        {'text': 'Της γλυπτικής', 'score': 0},
        {'text': 'Της ιατρικής', 'score': 0},
      ],
    },

//5.248
    {
      'questionText':
          'Σύμφωνα με έρευνα της Εurostat, το 46% των νέων 18-34 ετών της Ευρωπαϊκής Ένωσης ζουν με τους γονείς τους. Τα υψηλότερα ποσοστά καταγράφονται στη:',
      'answers': [
        {'text': 'Δανία', 'score': 0},
        {'text': 'Σουηδία', 'score': 0},
        {'text': 'Γερμανία', 'score': 0},
        {'text': 'Σλοβακία', 'score': 10},
      ],
    },

//5.249
    {
      'questionText':
          'Το ευρωπαϊκό πρόγραμμα «Νέοι της Ευρώπης. Ας φροντίσουμε τον Πλανήτη» αποτελεί συνέχιση του προγράμματος που εφαρμόστηκε αρχικά στη:',
      'answers': [
        {'text': 'Βραζιλία', 'score': 10},
        {'text': 'Αυστραλία', 'score': 0},
        {'text': 'Τουρκία', 'score': 0},
        {'text': 'Καναδά', 'score': 0},
      ],
    },

//5.250
    {
      'questionText':
          'Πανευρωπαϊκή έρευνα έδειξε πως οι νέοι παρουσιάζουν σημαντικό πρόβλημα εξάρτησης στο διαδίκτυο σε ποσοστό:',
      'answers': [
        {'text': '13,9%', 'score': 10},
        {'text': '2%', 'score': 0},
        {'text': '5,5%', 'score': 0},
        {'text': '7%', 'score': 0},
      ],
    },

//5.251
    {
      'questionText':
          'Μεγαλύτερο πρόβλημα εθισμού στο διαδίκτυο παρουσιάζουν οι νέοι:',
      'answers': [
        {'text': 'Στην Κύπρο', 'score': 0},
        {'text': 'Στη Ρουμανία', 'score': 10},
        {'text': 'Στην Ισλανδία', 'score': 0},
        {'text': 'Στην Ολλανδία', 'score': 0},
      ],
    },

//5.252
    {
      'questionText':
          'Ποιο είναι το κράτος μέλος με το μικρότερο ποσοστό που θεωρεί ότι η ανεργία είναι ένα από τα μεγαλύτερα προβλήματα που του κράτος; (Ευρωβαρόμετρο 91)',
      'answers': [
        {'text': 'Η Γερμανία', 'score': 0},
        {'text': 'Το Βέλγιο', 'score': 0},
        {'text': 'Η Σουηδία', 'score': 0},
        {'text': 'Η Μάλτα', 'score': 10},
      ],
    },

//6.253
    {
      'questionText':
          'Πότε αποφασίστηκε για πρώτη φορά στη διάσκεψη αρχηγών κρατών και κυβερνήσεων της Ευρώπης ότι ήταν αναγκαία μια κοινοτική πολιτική περιβάλλοντος;',
      'answers': [
        {'text': 'Το 1972', 'score': 10},
        {'text': 'Το 1952', 'score': 0},
        {'text': 'Το 1962', 'score': 0},
        {'text': 'Το 1982', 'score': 0},
      ],
    },

//6.254
    {
      'questionText':
          'Πόσες νομοθετικές αποφάσεις έχει εγκρίνει η κοινότητα για περιορισμό της ρύπανσης;',
      'answers': [
        {'text': '26', 'score': 0},
        {'text': '250', 'score': 10},
        {'text': '2.500', 'score': 0},
        {'text': '25.000', 'score': 0},
      ],
    },

//6.255
    {
      'questionText':
          'Η κοινοτική περιβαλλοντική πολιτική βασίζεται στις αρχές της προφύλαξης, της πρόληψης, της αποκατάστασης της ρύπανσης στην πηγή και:',
      'answers': [
        {'text': 'στην αρχή «ο ρυπαίνων πληρώνει»', 'score': 10},
        {'text': 'στην αρχή της ισότητας', 'score': 0},
        {'text': 'στην αρχή «ο ρυπαίνων φταίει»', 'score': 0},
        {'text': 'στην αρχή της αναλογικότητας', 'score': 0},
      ],
    },

//6.256
    {
      'questionText':
          'Ποια συνθήκη ενίσχυσε τη σημασία της περιβαλλοντικής πολιτικής της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Η Συνθήκη του Μάαστριχτ', 'score': 0},
        {'text': 'Η Συνθήκη του Άμστερνταμ', 'score': 10},
        {'text': 'Η Συνθήκη της Λισαβόνας', 'score': 0},
        {'text': 'Η Συνθήκη των Βρυξελλών', 'score': 0},
      ],
    },

//6.257
    {
      'questionText':
          'Πόση μείωση CO2 μπορεί να επιφέρει η ανακύκλωση 1 kg πλαστικού, σε σύγκριση με την κατασκευή νέων συσκευασιών;',
      'answers': [
        {'text': '150 kg', 'score': 0},
        {'text': '15 kg', 'score': 0},
        {'text': '500 kg', 'score': 0},
        {'text': '1,5 kg', 'score': 10},
      ],
    },

//6.258
    {
      'questionText':
          'Ποια χρονολογία όρισε η ΕΕ για απαγόρευση των πλαστικών μιας χρήσης;',
      'answers': [
        {'text': '2021', 'score': 10},
        {'text': '2023', 'score': 0},
        {'text': '2024', 'score': 0},
        {'text': '2026', 'score': 0},
      ],
    },

//6.259
    {
      'questionText':
          'Ποιο από τα παρακάτω δεν θεωρείται πλαστικό μιας χρήσης;',
      'answers': [
        {'text': 'Πλαστικά μαχαιροπήρουνα', 'score': 0},
        {'text': 'Πλαστικά καλαμάκια', 'score': 0},
        {'text': 'Επαναχρησιμοποιούμενα δοχεία φαγητού', 'score': 10},
        {'text': 'Μπατονέτες', 'score': 0},
      ],
    },

//6.260
    {
      'questionText': 'Ένα στα πόσα παιδιά στη ΕΕ πάσχουν από άσθμα;',
      'answers': [
        {'text': '7', 'score': 10},
        {'text': '17', 'score': 0},
        {'text': '27', 'score': 0},
        {'text': '37', 'score': 0},
      ],
    },

//6.261
    {
      'questionText':
          'Η στρατηγική της ΕΕ για την αειφόρο ανάπτυξη ζητεί η οικονομική, περιβαλλοντική και ποια άλλη πολιτική να συμπληρώνουν η μια την άλλη;',
      'answers': [
        {'text': 'Επιχειρηματική', 'score': 0},
        {'text': 'Ιατροφαρμακευτική', 'score': 0},
        {'text': 'Αγροτική', 'score': 0},
        {'text': 'Κοινωνική', 'score': 10},
      ],
    },

//6.262
    {
      'questionText':
          'Κατά ποιο ποσοστό δεσμεύτηκαν τα κράτη μέλη της ΕΕ, να μειώσουν τις εκπομπές αερίων του θερμοκηπίου το 2008-12, κάτω από τα επίπεδα του 1990;',
      'answers': [
        {'text': '0,8%', 'score': 0},
        {'text': '8%', 'score': 10},
        {'text': '18%', 'score': 0},
        {'text': '180%', 'score': 0},
      ],
    },

//6.263
    {
      'questionText':
          'Μέχρι πότε η ΕΕ συμφώνησε να μειώσει τις εκπομπές της και να αυξήσει το μερίδιό της όσον αφορά τη χρήση ανανεώσιμων πηγών ενέργειας κατά 20%;',
      'answers': [
        {'text': '2020', 'score': 10},
        {'text': '2015', 'score': 0},
        {'text': '2025', 'score': 0},
        {'text': '2030', 'score': 0},
      ],
    },

//6.264
    {
      'questionText':
          'Πώς ονομάζεται το ευρωπαϊκό δίκτυο που περιλαμβάνει 26.000 προστατευόμενες φυσικές περιοχές οι οποίες καλύπτουν σχεδόν το 20% του εδάφους της ΕΕ;',
      'answers': [
        {'text': 'Natura 1000', 'score': 0},
        {'text': 'Natura 2000', 'score': 10},
        {'text': 'Natura 3000', 'score': 0},
        {'text': 'Natura 4000', 'score': 0},
      ],
    },

//6.265
    {
      'questionText':
          'Ποια ευρωπαϊκή οδηγία ρυθμίζει την καταχώριση, την αξιολόγηση, την αδειοδότηση και τους περιορισμούς των χημικών προϊόντων;',
      'answers': [
        {'text': 'REACH', 'score': 0},
        {'text': 'STRETCH', 'score': 0},
        {'text': 'BREACH', 'score': 10},
        {'text': 'TEACH', 'score': 0},
      ],
    },

//6.266
    {
      'questionText':
          'Η προσχώρηση το 1995 της Σουηδίας, της Φινλανδίας και ποιας άλλης χώρας επέτρεψε στην ΕΕ να διπλασιάσει την έκταση των δασών της;',
      'answers': [
        {'text': 'Ελλάδας', 'score': 0},
        {'text': 'Ρουμανίας', 'score': 0},
        {'text': 'Βουλγαρίας', 'score': 0},
        {'text': 'Αυστρίας', 'score': 10},
      ],
    },

//6.267
    {
      'questionText':
          'Πότε ενέκρινε το Ε.Συμβούλιο κανονισμό για την ίδρυση του Ευρωπαϊκού οργανισμού Περιβάλλοντος και του ευρωπαϊκού δικτύου πληροφοριών περιβάλλοντος;',
      'answers': [
        {'text': '1930', 'score': 0},
        {'text': '1940', 'score': 0},
        {'text': '1990', 'score': 10},
        {'text': '1950', 'score': 0},
      ],
    },

//6.268
    {
      'questionText':
          'Η Υπηρεσία Ενέργειας, η οποία έχει τη γενική ευθύνη για τα ενεργειακά θέματα της Κύπρου, υπάγεται σε ποιο υπουργείο;',
      'answers': [
        {'text': 'Υπουργείο Συγκοινωνιών και Έργων', 'score': 0},
        {'text': 'Υπουργείο Οικονομικών', 'score': 0},
        {'text': 'Υπουργείο Άμυνας', 'score': 0},
        {'text': 'Υπουργείο Ενέργειας, Εμπορίου και Βιομηχανίας', 'score': 10},
      ],
    },

//6.269
    {
      'questionText':
          'Ποια από τις παρακάτω ΔΕΝ είναι ανανεώσιμη πηγή ενέργειας;',
      'answers': [
        {'text': 'Αιολική', 'score': 0},
        {'text': 'Παλιρροϊκή', 'score': 0},
        {'text': 'Σφαιρική', 'score': 10},
        {'text': 'Ηλιακή', 'score': 0},
      ],
    },

//6.270
    {
      'questionText': 'Το κοίτασμα «Αφροδίτη» στην κυπριακή ΑΟΖ περιέχει:',
      'answers': [
        {'text': 'Πετρέλαιο', 'score': 0},
        {'text': 'Φυσικό αέριο', 'score': 10},
        {'text': 'Μαζούτ', 'score': 0},
        {'text': 'Ουράνιο', 'score': 0},
      ],
    },

//6.271
    {
      'questionText':
          'Η ατμοσφαιρική ρύπανση οφείλεται σε τρεις βασικούς λόγους: μέσα μεταφοράς, εκπομπές από μόνιμες πηγές και:',
      'answers': [
        {'text': 'Eκπομπές από την παραγωγή ηλεκτρικής ενέργειας', 'score': 10},
        {'text': 'Kάπνισμα', 'score': 0},
        {'text': 'Iούς', 'score': 0},
        {'text': 'Aκαθαρσία', 'score': 0},
      ],
    },

//6.272
    {
      'questionText':
          'Σε περίπου πόσους τόνους ανέρχεται ετησίως η συνολική παραγωγή αποβλήτων στην ΕΕ (στοιχεία 2016);',
      'answers': [
        {'text': '1,8 χιλιάδες τόνους', 'score': 0},
        {'text': '1,8 εκατομμύρια τόνους', 'score': 0},
        {'text': '2,5 δισεκατομμύρια τόνους', 'score': 10},
        {'text': '1,8 τρισεκατομμύρια τόνους', 'score': 0},
      ],
    },

//6.273
    {
      'questionText':
          'Πόσο λιγότερη ενέργεια καταναλώνουν οι συμπαγείς λαμπτήρες φθορισμού από τους κλασικούς λαμπτήρες;',
      'answers': [
        {'text': '0,075%', 'score': 0},
        {'text': '0,75%', 'score': 0},
        {'text': '7,5%', 'score': 0},
        {'text': '75%', 'score': 10},
      ],
    },

//6.274
    {
      'questionText':
          'Ποιο από τα παρακάτω ΔΕΝ οδηγεί στην εξοικονόμηση ενέργειας;',
      'answers': [
        {'text': 'Η χρήση συμπαγών λαμπτήρων ενέργειας', 'score': 0},
        {'text': 'Η ανακύκλωση', 'score': 0},
        {'text': 'Η χρήση ηλεκτρικών θερμαστρών', 'score': 10},
        {'text': 'Η αποφυγή χρήσης προϊόντων αμιάντου', 'score': 0},
      ],
    },

//6.275
    {
      'questionText':
          'Η κύρια αιτία έκλυσης διοξινών από καιόμενα απορρίμματα είναι η παρουσία χλωρίου σε αυτά. Ποια είναι ίσως η σημαντικότερη πηγή χλωρίου;',
      'answers': [
        {'text': 'Τα πλαστικά PVC', 'score': 10},
        {'text': 'Τα σιδερικά PVC', 'score': 0},
        {'text': 'Τα άλατα PVC', 'score': 0},
        {'text': 'Τα ξύλινα PVC', 'score': 0},
      ],
    },

//6.276
    {
      'questionText':
          'Έχει αποδειχθεί ότι ένα ποσοστό των ειδών που αγοράζονται από τις υπεραγορές πηγαίνουν κατευθείαν στα σκουπίδια πριν καταναλωθούν. Ποιο είναι αυτό το ποσοστό;',
      'answers': [
        {'text': '1%-2%', 'score': 0},
        {'text': '10%-20%', 'score': 10},
        {'text': '30%-40%', 'score': 0},
        {'text': '50%-60%', 'score': 0},
      ],
    },

//6.277
    {
      'questionText':
          'Ποιες είναι οι περιβαλλοντικά πιο σωστές σακούλες για να χρησιμοποιείτε στα ψώνια σας;',
      'answers': [
        {'text': 'Πλαστικές', 'score': 0},
        {'text': 'Πάνινες', 'score': 10},
        {'text': 'Χάρτινες', 'score': 0},
        {'text': 'Νάιλον', 'score': 0},
      ],
    },

//6.278
    {
      'questionText':
          'Σε παλιές κατοικίες μπορούμε να μειώσουμε την κατανάλωση ενέργειας μέχρι και 60%. Με σωστό σχεδιασμό, πόσο μειώνεται η κατανάλωση σε νέες κατοικίες;',
      'answers': [
        {'text': '10%', 'score': 0},
        {'text': '30%', 'score': 0},
        {'text': '50%', 'score': 0},
        {'text': '90%', 'score': 10},
      ],
    },

//6.279
    {
      'questionText':
          'Ποιο από τα παρακάτω βοηθά να δροσίζεται το σπίτι και να μην χρησιμοποιούμε κλιματιστικά το καλοκαίρι;',
      'answers': [
        {'text': 'Εγκατάσταση ανεμιστήρων οροφής', 'score': 0},
        {
          'text': 'Φύτεμα φυλλοβόλων δέντρων σε ακάλυπτους εξωτερικούς χώρους',
          'score': 0
        },
        {
          'text': 'Χρήση ανοιχτόχρωμων χρωμάτων για το βάψιμο εξωτερικών χώρων',
          'score': 0
        },
        {'text': 'Όλα τα παραπάνω', 'score': 10},
      ],
    },

//6.280
    {
      'questionText':
          'Πόση είναι η μείωση στον λογαριασμό του ηλεκτρικού ρεύματος με την εγκατάσταση ηλιακού θερμοσίφωνα;',
      'answers': [
        {'text': 'Μέχρι και 40%', 'score': 10},
        {'text': 'Μέχρι και 4%', 'score': 0},
        {'text': 'Μέχρι και 0,4%', 'score': 0},
        {'text': 'Μέχρι και 400%', 'score': 0},
      ],
    },

//6.281
    {
      'questionText':
          'Κάθε φορά που κάνετε ένα ντους με ζεστό νερό από τον ήλιο, αποφεύγεται η έκλυση πόσων κιλών διοξειδίου του άνθρακα στην ατμόσφαιρα;',
      'answers': [
        {'text': '0,3 κιλών', 'score': 0},
        {'text': '3 κιλών ', 'score': 10},
        {'text': '30 κιλών', 'score': 0},
        {'text': '300 κιλών', 'score': 0},
      ],
    },

//6.282
    {
      'questionText':
          'Ποια είναι η σωστή ονομασία της γνωστής περιβαλλοντικής οργάνωσης;',
      'answers': [
        {'text': 'Greenpeace', 'score': 10},
        {'text': 'Redpeace', 'score': 0},
        {'text': 'Bluepeace', 'score': 0},
        {'text': 'Yellowpeace', 'score': 0},
      ],
    },

//6.283
    {
      'questionText':
          'Η παραγωγή ενός τόνου ανακυκλωμένου χαρτιού συνεπάγεται:',
      'answers': [
        {'text': '74% λιγότερη ατμοσφαιρική ρύπανση', 'score': 0},
        {'text': '35% λιγότερη ρύπανση των νερών', 'score': 0},
        {'text': 'λιγότερα στερεά απόβλητα', 'score': 0},
        {'text': 'όλα τα παραπάνω', 'score': 10},
      ],
    },

//6.284
    {
      'questionText':
          'Η παρουσία του στρατοσφαιρικού όζοντος στην ατμόσφαιρα είναι σημαντική γιατί:',
      'answers': [
        {
          'text':
              'Απορροφά το υπεριώδες τμήμα του φάσματος της ηλιακής ακτινοβολίας',
          'score': 0
        },
        {
          'text': 'Απορροφά μεγάλο ποσοστό της ηλιακής ακτινοβολίας',
          'score': 0
        },
        {
          'text': 'Σε μεγάλες συγκεντρώσεις είναι επικίνδυνο για τον άνθρωπο',
          'score': 0
        },
        {'text': 'Όλα τα παραπάνω', 'score': 10},
      ],
    },

//6.285
    {
      'questionText': 'Ποιο από τα παρακάτω ΔΕΝ είναι είδος κλίματος;',
      'answers': [
        {'text': 'Σκληρό', 'score': 10},
        {'text': 'Ξηρό', 'score': 0},
        {'text': 'Τροπικό', 'score': 0},
        {'text': 'Ηπειρωτικό', 'score': 0},
      ],
    },

//6.286
    {
      'questionText': 'Ποιος είναι ο φυσικός δορυφόρος της Γης;',
      'answers': [
        {'text': 'Ο Ήλιος', 'score': 0},
        {'text': 'Η Σελήνη', 'score': 10},
        {'text': 'Ο Άρης', 'score': 0},
        {'text': 'Τα αστέρια', 'score': 0},
      ],
    },

//6.287
    {
      'questionText': 'Η πολιτική της ΕΕ για το νερό στοχεύει στο:',
      'answers': [
        {
          'text':
              'Να έχουν όλοι οι Ευρωπαίοι πρόσβαση σε νερό καλής ποιότητας και σε επαρκείς ποσότητες',
          'score': 0
        },
        {
          'text':
              'Να πληρούν όλα τα υδατικά συστήματα στην Ευρώπη ελάχιστα ποιοτικά πρότυπα',
          'score': 0
        },
        {
          'text': 'Να προστατεύονται τα ευπαθή υδάτινα περιβάλλοντα',
          'score': 0
        },
        {'text': 'Όλα τα παραπάνω', 'score': 10},
      ],
    },

//6.288
    {
      'questionText':
          'Μέσω ποιου προγράμματος κυρίως στηρίζει η ΕΕ σχέδια για το περιβάλλον και την προστασία της φύσης;',
      'answers': [
        {'text': 'BREATHE', 'score': 0},
        {'text': 'DEATH', 'score': 0},
        {'text': 'LIFE', 'score': 10},
        {'text': 'EXHALE', 'score': 0},
      ],
    },

//7.289
    {
      'questionText':
          'Πόσα από τα κράτη μέλη της ΕΕ έχουν ως νόμισμά τους το ευρώ;',
      'answers': [
        {'text': '14', 'score': 0},
        {'text': '18', 'score': 0},
        {'text': '12', 'score': 0},
        {'text': '19', 'score': 10},
      ],
    },

//7.290
    {
      'questionText':
          'Ποια Αρχή είναι υπεύθυνη για τη διαχείριση των νομισματικών ζητημάτων στην ΕΕ;',
      'answers': [
        {'text': 'Η Ευρωπαϊκή Κεντρική Τράπεζα', 'score': 10},
        {'text': 'Η Κομισιόν', 'score': 0},
        {'text': 'Η Τρόικα', 'score': 0},
        {'text': 'Το Διεθνές Νομισματικό Ταμείο', 'score': 0},
      ],
    },

//7.291
    {
      'questionText':
          'Σε ποια πόλη λήφθηκε η απόφαση για τη δημιουργία μιας οικονομικής και νομισματικής ένωσης;',
      'answers': [
        {'text': 'Βερολίνο', 'score': 0},
        {'text': 'Μάαστριχτ', 'score': 10},
        {'text': 'Παρίσι', 'score': 0},
        {'text': 'Κοπεγχάγη', 'score': 0},
      ],
    },

//7.292
    {
      'questionText':
          'Για ποιο από τα πιο κάτω ποσά δεν υπάρχει χαρτονόμισμα του ευρώ;',
      'answers': [
        {'text': '20 ευρώ', 'score': 0},
        {'text': '100 ευρώ', 'score': 0},
        {'text': '250 ευρώ', 'score': 10},
        {'text': '500 ευρώ', 'score': 0},
      ],
    },

//7.293
    {
      'questionText':
          'Σε ποιο κυπριακό κέρμα του ευρώ απεικονίζεται το καράβι της Κερύνειας;',
      'answers': [
        {'text': 'Των 2 σεντ', 'score': 0},
        {'text': 'Των 5 σεντ', 'score': 0},
        {'text': 'Των 10 σεντ', 'score': 10},
        {'text': 'Των 2 ευρώ', 'score': 0},
      ],
    },

//7.294
    {
      'questionText':
          'Σε πόσα σεντ υποδιαιρείτο η κυπριακή λίρα που αντικαταστάθηκε από το ευρώ;',
      'answers': [
        {'text': '1000', 'score': 0},
        {'text': '100', 'score': 10},
        {'text': '200', 'score': 0},
        {'text': '500', 'score': 0},
      ],
    },

//7.295
    {
      'questionText': 'Το χαρτονόμισμα της μίας κυπριακής λίρας ήταν χρώματος:',
      'answers': [
        {'text': 'Γαλάζιου', 'score': 0},
        {'text': 'Πράσινου', 'score': 0},
        {'text': 'Μπορντό', 'score': 0},
        {'text': 'Καφέ', 'score': 10},
      ],
    },

//7.296
    {
      'questionText':
          'Πότε κυκλοφόρησαν τα χαρτονομίσματα και τα κέρματα του ευρώ;',
      'answers': [
        {'text': '1999', 'score': 0},
        {'text': '2000', 'score': 0},
        {'text': '2002', 'score': 10},
        {'text': '2004', 'score': 0},
      ],
    },

//7.297
    {
      'questionText':
          'Ποια ήταν η τελευταία χώρα που εντάχθηκε στη ζώνη του ευρώ;',
      'answers': [
        {'text': 'Κύπρος', 'score': 0},
        {'text': 'Σλοβακία', 'score': 0},
        {'text': 'Σλοβενία', 'score': 0},
        {'text': 'Λιθουανία', 'score': 10},
      ],
    },

//7.298
    {
      'questionText': 'Ποιο ήταν το νόμισμα της Γερμανίας πριν από το ευρώ;',
      'answers': [
        {'text': 'Μάρκο', 'score': 10},
        {'text': 'Λίρα', 'score': 0},
        {'text': 'Φράγκο', 'score': 0},
        {'text': 'Κορόνα', 'score': 0},
      ],
    },

//7.299
    {
      'questionText':
          'Ποια από τις πιο κάτω χώρες, ενώ μπορεί να πληροί τις προϋποθέσεις, επέλεξε να μην υιοθετήσει ως νόμισμά της το ευρώ;',
      'answers': [
        {'text': 'Πολωνία', 'score': 0},
        {'text': 'Δανία', 'score': 10},
        {'text': 'Λιθουανία', 'score': 0},
        {'text': 'Λετονία', 'score': 0},
      ],
    },

//7.300
    {
      'questionText':
          'Πόσα περίπου εκατομμύρια είναι οι πολίτες των χωρών μελών της ζώνης του ευρώ;',
      'answers': [
        {'text': '280', 'score': 0},
        {'text': '400', 'score': 0},
        {'text': '360', 'score': 0},
        {'text': '341', 'score': 10},
      ],
    },

//7.301
    {
      'questionText':
          'Πότε έγινε στη Μαδρίτη η συνεδρία του Ευρωπαϊκού Συμβουλίου κατά την οποία υιοθετήθηκε η ονομασία «ευρώ»;',
      'answers': [
        {'text': '1992', 'score': 0},
        {'text': '1995', 'score': 10},
        {'text': '1998', 'score': 0},
        {'text': '1999', 'score': 0},
      ],
    },

//7.302
    {
      'questionText':
          'Ποια χώρα υιοθέτησε το ευρώ ταυτόχρονα με την Κύπρο την 1η Ιανουαρίου 2008;',
      'answers': [
        {'text': 'Μάλτα', 'score': 10},
        {'text': 'Ισπανία', 'score': 0},
        {'text': 'Ελλάδα', 'score': 0},
        {'text': 'Ιταλία', 'score': 0},
      ],
    },

//7.303
    {
      'questionText': 'Ποιο ήταν το νόμισμα της Γαλλίας πριν από το ευρώ;',
      'answers': [
        {'text': 'Λίρα', 'score': 0},
        {'text': 'Μάρκο', 'score': 0},
        {'text': 'Φράγκο', 'score': 10},
        {'text': 'Πεσέτα', 'score': 0},
      ],
    },

//7.304
    {
      'questionText':
          'Μέχρι ποια ημερομηνία η κεντρική Τράπεζα της Κύπρου αντάλλαζε χωρίς χρέωση χαρτονομίσματα της λίρας;',
      'answers': [
        {'text': 'Τέλος 2013', 'score': 0},
        {'text': 'Τέλος 2017', 'score': 10},
        {'text': 'Τέλος 2015', 'score': 0},
        {'text': 'Τέλος 2011', 'score': 0},
      ],
    },

//7.305
    {
      'questionText':
          'Πώς λέγεται η νέα σειρά χαρτονομισμάτων του ευρώ, η κυκλοφορία της οποίας άρχισε το 2013 και αναμένεται να ολοκληρωθεί σε αρκετά χρόνια;',
      'answers': [
        {'text': 'Ιστορία και αρχιτεκτονική', 'score': 0},
        {'text': 'Ευρώπη', 'score': 10},
        {'text': 'Ενοποίηση', 'score': 0},
        {'text': 'Εποχές και ρυθμοί', 'score': 0},
      ],
    },

//7.306
    {
      'questionText':
          'Πόσες χώρες αντικατέστησαν τα εθνικά τους νομίσματα με το ευρώ, την 1η Ιανουαρίου 2002;',
      'answers': [
        {'text': '8', 'score': 0},
        {'text': '12', 'score': 10},
        {'text': '14', 'score': 0},
        {'text': '15', 'score': 0},
      ],
    },

//7.307
    {
      'questionText':
          'Πως αποκαλείται η ομάδα των χωρών που έχουν υιοθετήσει το ευρώ;',
      'answers': [
        {'text': 'Ευρωζώνη', 'score': 10},
        {'text': 'Ενιαία Οικονομική Κοινότητα', 'score': 0},
        {'text': 'Ενιαία Οικονομική Ζώνη', 'score': 0},
        {'text': 'Νομισματική Ένωση Κρατών', 'score': 0},
      ],
    },

//7.308
    {
      'questionText':
          'Ποιο από τα πιο κάτω πριγκιπάτα / κρατίδια, απέκτησε δικά του κέρματα ευρώ τον Ιούνιο του 2013;',
      'answers': [
        {'text': 'Βατικανό', 'score': 0},
        {'text': 'Άγιος Μαρίνος', 'score': 0},
        {'text': 'Μονακό', 'score': 0},
        {'text': 'Ανδόρα', 'score': 10},
      ],
    },

//7.309
    {
      'questionText':
          'Σε ποια ισοτιμία «κλείδωσε» η αντικατάσταση της κυπριακής λίρας;',
      'answers': [
        {'text': '0,622425 λίρες ανά ευρώ', 'score': 0},
        {'text': '0,687452 λίρες ανά ευρώ', 'score': 0},
        {'text': '0,585274 λίρες ανά ευρώ', 'score': 10},
        {'text': '1,710347 λίρες ανά ευρώ', 'score': 0},
      ],
    },

//7.310
    {
      'questionText':
          'Πότε έγινε η υποδιαίρεση της κυπριακής λίρας σε 100 σεντ από 1.000 μιλς που ήταν προηγουμένως;',
      'answers': [
        {'text': '1983', 'score': 10},
        {'text': '1986', 'score': 0},
        {'text': '1978', 'score': 0},
        {'text': '1988', 'score': 0},
      ],
    },

//7.311
    {
      'questionText':
          'Ποια είναι αθροιστικά η αξία μιας σειράς κερμάτων του ευρώ;',
      'answers': [
        {'text': '3,00', 'score': 0},
        {'text': '3,62', 'score': 0},
        {'text': '3,88', 'score': 10},
        {'text': '4,20', 'score': 0},
      ],
    },

//7.312
    {
      'questionText':
          'Ποια υπηρεσία έχει αναλάβει τον συντονισμό της προστασίας του ευρώ από φαινόμενα παραχάραξης;',
      'answers': [
        {'text': 'Η Ευρωπαϊκή Κεντρική Τράπεζα', 'score': 0},
        {'text': 'Η Οικονομική και Νομισματική Ένωση', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Αστυνομική Υπηρεσία (Europol)', 'score': 10},
        {
          'text': 'Ο Διεθνής Οργανισμός Εγκληματολογικής Αστυνομίας (Interpol)',
          'score': 0
        },
      ],
    },

//7.313
    {
      'questionText':
          'Ποιας άλλης χώρας, πέραν της Γαλλίας, το εθνικό νόμισμα πριν από το ευρώ ήταν το φράγκο;',
      'answers': [
        {'text': 'Αυστρίας', 'score': 0},
        {'text': 'Βελγίου', 'score': 10},
        {'text': 'Ιταλίας', 'score': 0},
        {'text': 'Ισπανίας', 'score': 0},
      ],
    },

//7.314
    {
      'questionText': 'Που εδρεύει η Ευρωπαϊκή κεντρική Τράπεζα;',
      'answers': [
        {'text': 'Βερολίνο', 'score': 0},
        {'text': 'Φρανκφούρτη', 'score': 10},
        {'text': 'Παρίσι', 'score': 0},
        {'text': 'Βρυξέλλες', 'score': 0},
      ],
    },

//7.315
    {
      'questionText':
          'Ποια από τις πιο κάτω χώρες χρησιμοποιεί το ευρώ, χωρίς επί σημη συμφωνία και χωρίς να αποτελεί μέρος της ευρωζώνης;',
      'answers': [
        {'text': 'Ουγγαρία', 'score': 0},
        {'text': 'Πολωνία', 'score': 0},
        {'text': 'Σερβία', 'score': 0},
        {'text': 'Μαυροβούνιο', 'score': 10},
      ],
    },

//7.316
    {
      'questionText':
          'Τι είδος χαρτιού επιλέχθηκε για την έκδοση των χαρτονομισμάτων του ευρώ;',
      'answers': [
        {'text': 'Από ίνες βαμβακιού', 'score': 10},
        {'text': 'Ανακυκλωμένο', 'score': 0},
        {'text': 'Από ίνες μεταξιού', 'score': 0},
        {'text': 'Από ίνες λιναριού', 'score': 0},
      ],
    },

//7.317
    {
      'questionText':
          'Από ποιο χαρτονόμισμα του ευρώ άρχισε η έκδοση της νέας σειράς χαρτονομισμάτων, η οποία ονομάζεται «Ευρώπη»;',
      'answers': [
        {'text': '5', 'score': 10},
        {'text': '20', 'score': 0},
        {'text': '100', 'score': 0},
        {'text': '500', 'score': 0},
      ],
    },

//7.318
    {
      'questionText':
          'Τι από τα πιο κάτω δεν ισχύει για τα χαρτονομίσματα του ευρώ;',
      'answers': [
        {
          'text':
              'Τα χαρτονομίσματα με διαδοχικές αξίες έχουν χρώματα με ισχυρές αντιθέσεις',
          'score': 0
        },
        {
          'text': 'Η αξία αναγράφεται με μεγάλους αριθμούς και έντονα στοιχεία',
          'score': 0
        },
        {
          'text': 'Τα χαρτονομίσματα διαφόρων αξιών έχουν το ίδιο μέγεθος',
          'score': 10
        },
        {
          'text':
              'Έχουν ανάγλυφη εκτύπωση η οποία είναι εύκολα αισθητή στην αφή',
          'score': 0
        },
      ],
    },

//7.319
    {
      'questionText':
          'Ποιος είναι από την 1 Νοεμβρίου 2019 πρόεδρος της Ευρωπαϊκής κεντρικής Τράπεζας;',
      'answers': [
        {'text': 'Ζοζέ Μανουέλ Μπαρόζο (José Manuel Barroso)', 'score': 0},
        {'text': 'Κριστίν Λαγκάρντ (Christine Lagarde)', 'score': 10},
        {'text': 'Μάριο Μόντι (Mario Monti)', 'score': 0},
        {'text': 'Μάρτιν Σουλτς (Martin Schulz)', 'score': 0},
      ],
    },

//7.320
    {
      'questionText':
          'Η μια πλευρά των κερμάτων του ευρώ είναι ίδια σε όλες τις χώρες. Τι απεικονίζεται στην άλλη πλευρά;',
      'answers': [
        {'text': 'Τα 12 αστέρια της Ευρωπαϊκής Ένωσης', 'score': 0},
        {'text': 'Ο χάρτης της Ευρώπης', 'score': 0},
        {'text': 'Το κτίριο Μπερλεμόντ στις Βρυξέλλες', 'score': 0},
        {
          'text': 'Σχέδια που αντιπροσωπεύουν κάθε συγκεκριμένη χώρα',
          'score': 10
        },
      ],
    },

//7.321
    {
      'questionText':
          'Ποια είναι η μεγαλύτερη ανησυχία κυβερνήσεων και κεντρικών τραπεζών τις πρώτες μέρες εισαγωγής του ευρώ σε μια χώρα;',
      'answers': [
        {
          'text': 'Οι στρογγυλοποιήσεις των τιμών των προϊόντων προς τα πάνω',
          'score': 10
        },
        {
          'text': 'Η πιθανότητα έλλειψης χαρτονομισμάτων και κερμάτων',
          'score': 0
        },
        {'text': 'Η παραχάραξη των χαρτονομισμάτων', 'score': 0},
        {
          'text':
              'Η ισοτιμία στην οποία θα κλειδώσει το ευρώ με το εθνικό νόμισμα',
          'score': 0
        },
      ],
    },

//7.322
    {
      'questionText':
          'Ποια είναι αθροιστικά η αξία μιας σειράς χαρτονομισμάτων του ευρώ;',
      'answers': [
        {'text': '855', 'score': 0},
        {'text': '865', 'score': 0},
        {'text': '885', 'score': 0},
        {'text': '915', 'score': 10},
      ],
    },

//7.323
    {
      'questionText':
          'Πώς λεγόταν η ευρωπαϊκή νομισματική μονάδα, πριν ονομαστεί ευρώ;',
      'answers': [
        {'text': 'ENI', 'score': 0},
        {'text': 'ECU', 'score': 10},
        {'text': 'ONE', 'score': 0},
        {'text': 'ECB', 'score': 0},
      ],
    },

//7.324
    {
      'questionText':
          'Τι από τα πάρα κάτω δεν ισχύει σε σχέση με το σύμβολο του ευρώ;',
      'answers': [
        {
          'text': 'Είναι το ελληνικό γράμμα έψιλον με δύο εγκάρσιες γραμμές',
          'score': 0
        },
        {'text': 'Παραπέμπει στο πρώτο γράμμα της λέξης Ευρώπη', 'score': 0},
        {
          'text': 'Οι δυο γραμμές συμβολίζουν τη σταθερότητα του ευρώ',
          'score': 0
        },
        {
          'text': 'Συνήθως εμφανίζεται σε μπλε χρώμα πάνω σε κίτρινο φόντο',
          'score': 10
        },
      ],
    },

//8.325
    {
      'questionText':
          'Σύμφωνα με τη συνθήκη του Μάαστριχτ, κάθε πολίτης της ΕΕ, ανεξαρτήτως εθνικότητας, έχει το δικαίωμα:',
      'answers': [
        {
          'text':
              'Να ψηφίζει και να είναι υποψήφιος στη χώρα της ΕΕ στην οποία ζει',
          'score': 10
        },
        {'text': 'Προστασίας των προσωπικών του δεδομένων', 'score': 0},
        {'text': 'Δίκαιης δίκης, πολιτικής ή ποινικής', 'score': 0},
        {'text': 'Ελευθερίας της έκφρασης', 'score': 0},
      ],
    },

//8.326
    {
      'questionText': 'Τα δικαιώματα των πολιτών της ΕΕ προστατεύονται από:',
      'answers': [
        {'text': 'Την αρμόδια αρχή κάθε χώρας', 'score': 0},
        {'text': 'Τον Χάρτη των Θεμελιωδών Δικαιωμάτων', 'score': 10},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
        {'text': 'Τον Ευρωπαίο Επίτροπο', 'score': 0},
      ],
    },

//8.327
    {
      'questionText':
          'Ο Χάρτης των Θεμελιωδών Δικαιωμάτων της Ευρωπαϊκής Ένωσης διακηρύχθηκε:',
      'answers': [
        {'text': 'Το 2000', 'score': 10},
        {'text': 'Το 2007', 'score': 0},
        {'text': 'Το 2004', 'score': 0},
        {'text': 'Το 1998', 'score': 0},
      ],
    },

//8.328
    {
      'questionText':
          'Ο Χάρτης κατέστη νομικά δεσμευτικός στο σύνολο της ΕΕ με την έναρξη ισχύος της συνθήκης:',
      'answers': [
        {'text': 'Του Άμστερνταμ', 'score': 0},
        {'text': 'Της Νίκαιας', 'score': 0},
        {'text': 'Για τη θέσπιση Συντάγματος της Ευρώπης', 'score': 0},
        {'text': 'Της Λισαβόνας', 'score': 10},
      ],
    },

//8.329
    {
      'questionText':
          'Ο σεβασμός της ανθρώπινης αξιοπρέπειας και των δικαιωμάτων του ανθρώπου, η ελευθερία, η δημοκρατία, η ισότητα και το κράτος δικαίου αποτελούν:',
      'answers': [
        {
          'text': 'Αξίες που εφαρμόζονται μόνο σε μερικά κράτη μέλη',
          'score': 0
        },
        {'text': 'Κοινές αξίες της ΕΕ', 'score': 10},
        {'text': 'Ακατοχύρωτες αξίες', 'score': 0},
        {'text': 'Αξίες που παραβιάζονται', 'score': 0},
      ],
    },

//8.330
    {
      'questionText':
          'Το Ευρωπαϊκό Δικαστήριο Δικαιωμάτων του Ανθρώπου εδρεύει:',
      'answers': [
        {'text': 'Στις Βρυξέλλες', 'score': 0},
        {'text': 'Στο Λουξεμβούργο', 'score': 0},
        {'text': 'Στη Φρανκφούρτη', 'score': 0},
        {'text': 'Στο Στρασβούργο', 'score': 10},
      ],
    },

//8.331
    {
      'questionText': 'Το Ευρωπαϊκό Δικαστήριο:',
      'answers': [
        {
          'text':
              'Μεσολαβεί εκ μέρους σας ενώπιον της αρχής κατά της οποίας υποβάλλετε παράπονο',
          'score': 0
        },
        {
          'text':
              'Σας βοηθά στην ανεύρεση ή πληρωμή δικηγόρου για τη σύνταξη της προσφυγής',
          'score': 0
        },
        {
          'text': 'Δεν λειτουργεί ως εφετείο ως προς τα εθνικά δικαστήρια',
          'score': 10
        },
        {
          'text': 'Είναι αρμόδιο για την εκτέλεση των αποφάσεών του',
          'score': 0
        },
      ],
    },

//8.332
    {
      'questionText':
          'Οι πολίτες μπορούν να υποβάλουν αναφορά για να καταγγείλουν κάθε παραβίαση του κοινοτικού δικαίου:',
      'answers': [
        {'text': 'Στην Ισλαμική Διάσκεψη', 'score': 0},
        {'text': 'Στο Ευρωπαϊκό Κοινοβούλιο', 'score': 10},
        {'text': 'Στο Συμβούλιο Ασφαλείας του ΟΗΕ', 'score': 0},
        {'text': 'Στη Βασίλισσα της Αγγλίας', 'score': 0},
      ],
    },

//8.333
    {
      'questionText':
          'Η θέση του Ευρωπαίου Διαμεσολαβητή δημιουργήθηκε με τη συνθήκη για την Ευρωπαϊκή Ένωση:',
      'answers': [
        {'text': 'Το 1986', 'score': 0},
        {'text': 'Το 1992', 'score': 10},
        {'text': 'Το 2004', 'score': 0},
        {'text': 'Το 2001', 'score': 0},
      ],
    },

//8.334
    {
      'questionText':
          'Διαμεσολαβητής εκλέγεται από το Ευρωπαϊκό κοινοβούλιο και η θητεία του είναι:',
      'answers': [
        {'text': 'Πενταετής', 'score': 10},
        {'text': 'Δεκαετής', 'score': 0},
        {'text': 'Ετήσια', 'score': 0},
        {'text': 'Εξαμηνιαία', 'score': 0},
      ],
    },

//8.335
    {
      'questionText': 'Ο Διαμεσολαβητής διενεργεί έρευνες:',
      'answers': [
        {'text': 'Μόνο μετά από καταγγελία πολιτών', 'score': 0},
        {'text': 'Πάντα με δική του πρωτοβουλία', 'score': 0},
        {'text': 'Μετά από υπόδειξη του Ευρωπαϊκού Κοινοβουλίου', 'score': 0},
        {
          'text': 'Είτε μετά από καταγγελία είτε με δική του πρωτοβουλία',
          'score': 10
        },
      ],
    },

//8.336
    {
      'questionText':
          'Τα τέλη διεθνούς περιαγωγής εντός της ΕΕ, δίνει τη δυνατότητα στους Κύπριους πολίτες, να δέχονται και να διενεργούν κλήσεις από το κινητό τους:',
      'answers': [
        {'text': 'Με μειωμένα τέλη', 'score': 0},
        {
          'text':
              'Με τα ίδια τέλη που ισχύουν και στην Κύπρο (Roam like at home)',
          'score': 10
        },
        {'text': 'Στη μισή τιμή', 'score': 0},
        {'text': 'Χωρίς χρέωση', 'score': 0},
      ],
    },

//8.337
    {
      'questionText':
          'Η Άμεση Ευρώπη είναι μια υπηρεσία που σας βοηθά να λύσετε τα ερωτήματά σας για την ΕΕ. Ποιον αριθμό πρέπει να καλέσετε για να θέσετε το ερώτημά σας;',
      'answers': [
        {'text': '0080067891011', 'score': 10},
        {'text': '112', 'score': 0},
        {'text': '0800800112', 'score': 0},
        {'text': '999', 'score': 0},
      ],
    },

//8.338
    {
      'questionText':
          'Οι πολίτες της ΕΕ έχουν δικαίωμα να διαμένουν ελεύθερα οπουδήποτε στην ΕΕ.',
      'answers': [
        {'text': ' Ναι', 'score': 10},
        {'text': ' Όχι', 'score': 0},
        {'text': ' Κάτω από προϋποθέσεις ', 'score': 0},
        {'text': ' Μόνο σε μερικές ευρωπαϊκές χώρες', 'score': 0},
      ],
    },

//8.339
    {
      'questionText':
          'Τι μπορούν να κάνουν οι πολίτες, όπως προβλέπει η πρωτοβουλία 1.000.000 πολιτών;',
      'answers': [
        {
          'text':
              'Να ζητήσουν μεγαλύτερη εκπροσώπηση της χώρας τους στο Ευρωκοινοβούλιο',
          'score': 0
        },
        {
          'text':
              'Να καλέσουν την Ε.Επιτροπή να προωθήσει μια νομοθετική πρόταση πάνω σε ένα ζήτημα',
          'score': 10
        },
        {
          'text': 'Να ζητήσουν την αλλαγή ενός η περισσότερων επιτρόπων',
          'score': 0
        },
        {
          'text':
              'Να καλέσουν τον πρόεδρο του Ευρωπαϊκού Συμβουλίου να επισκεφθεί τη χώρα τους',
          'score': 0
        },
      ],
    },

//8.340
    {
      'questionText':
          'Με ποιά συνθήκη θεσπίστηκε η Πρωτοβουλία των Ευρωπαίων Πολιτών;',
      'answers': [
        {'text': 'Συνθήκη της Λισαβόνας', 'score': 10},
        {'text': 'Συνθήκη του Άμστερνταμ', 'score': 0},
        {'text': 'Συνθήκη της Νίκαιας', 'score': 0},
        {'text': 'Συνθήκη για τη θέσπιση Συντάγματος της Ευρώπης', 'score': 0},
      ],
    },

//8.341
    {
      'questionText':
          'Το «Βραβείο του Ευρωπαίου Πολίτη» (Citizen’s Prize) θεσπίστηκε από το Ευρωπαϊκό Κοινοβούλιο ως επιβράβευση για:',
      'answers': [
        {
          'text':
              'Τα επιτεύγματα πολιτών, ομάδων, σωματείων ή οργανώσεων που προωθούν την ενίσχυση της ΕΕ',
          'score': 10
        },
        {
          'text': 'Την εφαρμογή προγραμμάτων προστασίας του περιβάλλοντος',
          'score': 0
        },
        {'text': 'Τη συμμετοχή στα κοινά', 'score': 0},
        {
          'text': 'Την εφαρμογή καινοτόμων ιδεών στον τομέα της τεχνολογίας',
          'score': 0
        },
      ],
    },

//8.342
    {
      'questionText':
          'Οι Κύπριοι Πέτρος Σουππουρής και Χουσεΐν Ακανσόυ κέρδισαν το «Βραβείο του Ευρωπαίου Πολίτη» το 2012. Ποιο μήνυμα δίνει το έργο τους;',
      'answers': [
        {
          'text': 'Αμοιβαία κατανόηση μεταξύ των πολιτών της Κύπρου',
          'score': 10
        },
        {'text': 'Περιβαλλοντική συνείδηση', 'score': 0},
        {'text': 'Αλληλεγγύη για την πάταξη της φτώχειας', 'score': 0},
        {'text': 'Ενάντια στην ξενοφοβία', 'score': 0},
      ],
    },

//8.343
    {
      'questionText': 'Η ευρωπαϊκή κάρτα ασφάλισης ασθένειας εκδίδεται:',
      'answers': [
        {'text': 'Από έναν κεντρικό ευρωπαϊκό φορέα', 'score': 0},
        {'text': 'Από τη την οποίαν επισκέπτεται ο πολίτης', 'score': 0},
        {
          'text': 'Από τις αρμόδιες αρχές της κάθε ευρωπαϊκής χώρας',
          'score': 10
        },
        {'text': 'Από ιδιωτικές ασφαλιστικές εταιρείες', 'score': 0},
      ],
    },

//8.344
    {
      'questionText':
          'Οι κάτοχοι ευρωπαϊκής κάρτας ασθένειας δικαιούνται κάλυψη των ιατρικών τους εξόδων εάν:',
      'answers': [
        {'text': 'Μεταβούν για προγραμματισμένη θεραπεία ', 'score': 0},
        {
          'text':
              'Υποβληθούν σε εξετάσεις ρουτίνας σε οποιοδήποτε ευρωπαϊκό ιατρικό κέντρο',
          'score': 0
        },
        {'text': 'Συμμετέχουν σε πειραματικές θεραπείες', 'score': 0},
        {
          'text': 'Αρρωστήσουν ενόσω ταξιδεύουν σε κάποια άλλη ευρωπαϊκή χώρα',
          'score': 10
        },
      ],
    },

//8.345
    {
      'questionText':
          'Οι Ευρωπαίοι ταξιδιώτες έχουν το δικαίωμα διεκδίκησης αποζημίωσης για απώλεια ή ζημία:',
      'answers': [
        {'text': 'Σε περίπτωση ατυχήματος', 'score': 10},
        {'text': 'Όταν χάσουν την πτήση', 'score': 0},
        {
          'text':
              'Σε περίπτωση μηχανικής βλάβης του μέσου με το οποίο ταξιδεύουν',
          'score': 0
        },
        {
          'text': 'Σε περίπτωση καθυστερημένης άφιξης κατά 10 λεπτά',
          'score': 0
        },
      ],
    },

//8.346
    {
      'questionText':
          'Οι ταξιδιώτες εντός της ΕΕ μπορούν να κάνουν απεριόριστες αγορές στη χώρα που επισκέπτονται και να φέρνουν τα αγαθά στη χώρα τους:',
      'answers': [
        {'text': 'Με μειωμένους δασμούς', 'score': 0},
        {'text': 'Χωρίς δασμούς', 'score': 10},
        {'text': 'Καταβάλλοντας δασμό μόνο για ορισμένα αγαθά', 'score': 0},
        {'text': 'Με δασμό 10%', 'score': 0},
      ],
    },

//8.347
    {
      'questionText':
          'Οι πολίτες των κρατών μελών δικαιούνται για τα ενδοευρωπαϊκά ταξίδια τους:',
      'answers': [
        {'text': 'Απεριόριστο συνάλλαγμα', 'score': 10},
        {'text': 'Συνάλλαγμα μέχρι 1000 ευρώ', 'score': 0},
        {
          'text':
              'Το ύψος του συναλλάγματος εξαρτάται από τις μέρες διαμονής τους σε μια χώρα',
          'score': 0
        },
        {
          'text': 'Κάθε κράτος μέλος έχει τους δικούς του κανονισμούς',
          'score': 0
        },
      ],
    },

//8.348
    {
      'questionText':
          'Ο ευρωπαϊκός αριθμός δωρεάν κλήσης έκτακτης ανάγκης από σταθερά και κινητά τηλέφωνα σε όλη την Ευρωπαϊκή Ένωση είναι:',
      'answers': [
        {'text': '111', 'score': 0},
        {'text': '112', 'score': 10},
        {'text': '113', 'score': 0},
        {'text': '222', 'score': 0},
      ],
    },

//8.349
    {
      'questionText':
          'Η εποπτεία της αγοράς για τον έλ������������γχο της εφαρ��������������ογής των κανόνων σχετικά με την ασφάλεια των προϊόντων και υπηρεσιών εντός της ΕΕ είναι αρμοδιότητα:',
      'answers': [
        {'text': 'Του Ευρωπαϊκού Κοινοβουλίου', 'score': 0},
        {
          'text': 'Των κρατών μελών και συντονίζεται σε ευρωπαϊκό επίπεδο',
          'score': 10
        },
        {'text': 'Του Ευρωπαίου Επιτρόπου', 'score': 0},
        {'text': 'Του Συνήγορου του Πολίτη', 'score': 0},
      ],
    },

//8.350
    {
      'questionText':
          'Όταν παραγγέλλετε προϊόντα από απόσταση η παράδοση πρέπει να πραγματοποιηθεί το αργότερο εντός:',
      'answers': [
        {'text': '30 ημερών', 'score': 10},
        {'text': '10 ημερών', 'score': 0},
        {'text': 'Δύο μηνών', 'score': 0},
        {'text': 'Μίας εβδομάδας', 'score': 0},
      ],
    },

//8.351
    {
      'questionText':
          'Αν το προϊόν που παραγγείλατε διά αλληλογραφίας ή μέσω διαδικτύου σας παραδοθεί μετά την παρέλευση της προθεσμίας μπορείτε:',
      'answers': [
        {
          'text':
              'Να αρνηθείτε την παραλαβή και να σας επιστραφούν τυχόν ποσά που έχετε ήδη καταβάλει',
          'score': 10
        },
        {
          'text': 'Να λάβετε πίσω μόνο ένα μικρό μέρος της προκαταβολής',
          'score': 0
        },
        {
          'text': 'Να το παραλάβετε αλλά να διεκδικήσετε αποζημίωση',
          'score': 0
        },
        {
          'text': 'Να διαμαρτυρηθείτε χωρίς όμως να λάβετε πίσω τα χρήματά σας',
          'score': 0
        },
      ],
    },

//8.352
    {
      'questionText':
          'Η τιμή πώλησης πρέπει να αναγράφεται σε όλα τα προϊόντα που προσφέρονται από τους εμπόρους στους καταναλωτές με τρόπο σαφή και ευανάγνωστο.',
      'answers': [
        {'text': 'Ναι', 'score': 10},
        {'text': 'Όχι', 'score': 0},
        {'text': 'Μόνο σε όσα η τιμή τους είναι πέραν των €10', 'score': 0},
        {'text': 'Μόνο στα τρόφιμα', 'score': 0},
      ],
    },

//8.353
    {
      'questionText': 'Το σήμα CE διασφαλίζει ότι το παιγνίδι που το φέρει:',
      'answers': [
        {'text': 'Είναι καινοτόμο', 'score': 0},
        {
          'text': 'Πληροί τις βασικές απαιτήσεις περί της ασφάλειας',
          'score': 10
        },
        {'text': 'Περιέχει μικρά αντικείμενα', 'score': 0},
        {'text': 'Είναι κατάλληλο για όλες τις ηλικίες', 'score': 0},
      ],
    },

//8.354
    {
      'questionText':
          'Για να εξακριβωθεί ότι ένα προϊόν είναι ασφαλές ή όχι πρέπει να ληφθούν υπόψη τα εξής:',
      'answers': [
        {'text': 'Η ποικιλία των χρωμάτων', 'score': 0},
        {'text': 'Το αγοραστικό κοινό στο οποίο απευθύνεται', 'score': 0},
        {
          'text':
              'Τα χαρακτηριστικά του (σύνθεση, συσκευασία, συνθήκες συναρμολόγησης & συντήρησης κλπ)',
          'score': 10
        },
        {'text': 'Το κουτί συσκευασίας', 'score': 0},
      ],
    },

//8.355
    {
      'questionText':
          'Η παρουσίαση του προϊόντος (ετικέτες, οδηγίες σχετικά με τη χρήση και την απόρριψή του) λαμβάνεται υπόψη για την ασφάλειά του.',
      'answers': [
        {'text': 'Ναι', 'score': 10},
        {'text': 'Εξαρτάται', 'score': 0},
        {'text': 'Όχι', 'score': 0},
        {'text': 'Σε ορισμένες περιπτώσεις', 'score': 0},
      ],
    },

//8.356
    {
      'questionText':
          'Αν εντοπιστεί ένα επικίνδυνο προϊόν σε μία χώρα, οι πληροφορίες για το προϊόν κοινοποιούνται στις άλλες χώρες της ΕΕ μέσω του συστήματος:',
      'answers': [
        {'text': 'PROTECT', 'score': 0},
        {'text': 'RAPEX', 'score': 10},
        {'text': 'SAFE USE', 'score': 0},
        {'text': 'DEFECTIVE', 'score': 0},
      ],
    },

//8.357
    {
      'questionText':
          'Για τα τρόφιμα και τις ζωοτροφές λειτουργεί ένα παρόμοιο σύστημα το:',
      'answers': [
        {'text': 'RASFF', 'score': 10},
        {'text': 'FOOD INSPECTION', 'score': 0},
        {'text': 'HEALTH', 'score': 0},
        {'text': 'SAFETY', 'score': 0},
      ],
    },

//8.358
    {
      'questionText':
          'Ποια υπηρεσία είναι, στην Κύπρο, υπεύθυνη για την προστασία της υγείας και της ασφάλειας των καταναλωτών;',
      'answers': [
        {'text': 'Η Υπηρεσία για την Ασφάλεια των Πολιτών', 'score': 0},
        {'text': 'Η Υπηρεσία Ελέγχου Προϊόντων', 'score': 0},
        {'text': 'Η Υπηρεσία Υγιούς Ανταγωνισμού', 'score': 0},
        {'text': 'Η Υπηρεσία Προστασίας Καταναλωτή', 'score': 10},
      ],
    },

//8.359
    {
      'questionText': 'Το τηλέφωνο της Γραμμής Καταναλωτή στην Κύπρο είναι:',
      'answers': [
        {'text': '1429', 'score': 10},
        {'text': '1000', 'score': 0},
        {'text': '1234', 'score': 0},
        {'text': '1888', 'score': 0},
      ],
    },

//8.360
    {
      'questionText':
          'Στα κράτη μέλη της Ευρωπαϊκής Ένωσης λειτουργεί το Δίκτυο Ευρωπαϊκών Κέντρων Καταναλωτή. Σκοπός της ύπαρξης και της λειτουργίας του Δικτύου είναι:',
      'answers': [
        {'text': 'Η ενημέρωση των καταναλωτών για φθηνά προϊόντα', 'score': 0},
        {'text': 'Η προστασία του ανταγωνισμού', 'score': 0},
        {
          'text':
              'Η παροχή πληροφοριών και συμβουλών σε καταναλωτές που κάνουν αγορές εντός της ΕΕ',
          'score': 10
        },
        {'text': 'Η διενέργεια δειγματοληπτικών ελέγχων', 'score': 0},
      ],
    },

//8.361
    {
      'questionText':
          'Στην τιμή ενός προϊόντος που αγοράζετε μέσω διαδικτύου συνυπολογίζεται ο ΦΠΑ του κράτους όπου έχει την έδρα του ο προμηθευτής.',
      'answers': [
        {'text': 'Ναι', 'score': 10},
        {'text': 'Όχι', 'score': 0},
        {'text': 'Καταβάλλεται μόνο 5%', 'score': 0},
        {'text': 'Δεν πληρώνετε ΦΠΑ', 'score': 0},
      ],
    },

//8.362
    {
      'questionText': 'Η 22η Σεπτεμβρίου έχει καθιερωθεί ως:',
      'answers': [
        {'text': 'Ευρωπαϊκή μέρα καταναλωτών', 'score': 0},
        {'text': 'Ευρωπαϊκή μέρα χωρίς αυτοκίνητο', 'score': 10},
        {'text': 'Ευρωπαϊκή μέρα καταπολέμησης της φτώχειας', 'score': 0},
        {'text': 'Ευρωπαϊκή μέρα προστασίας του παιδιού', 'score': 0},
      ],
    },

//8.363
    {
      'questionText':
          'Σκοπός της πύλης EURES είναι η παροχή πληροφοριών, συμβουλών και υπηρεσιών για:',
      'answers': [
        {'text': 'Eύρεση κατάλληλων θέσεων εργασίας', 'score': 10},
        {'text': 'Το λιανικό εμπόριο', 'score': 0},
        {'text': 'Τη γυναικεία επιχειρηματικότητα', 'score': 0},
        {'text': 'Τα εκπαιδευτικά προγράμματα', 'score': 0},
      ],
    },

//8.364
    {
      'questionText':
          'Ως υπήκοος της ΕΕ έχετε το δικαίωμα να σπουδάσετε σε άλλη χώρα της ΕΕ. Αν μείνετε εκεί για λιγότερο από 3 μήνες, χρειάζεστε μόνο:',
      'answers': [
        {
          'text':
              'Απόδειξη της εγγραφής σας σε εγκεκριμένο εκπαιδευτικό ίδρυμα',
          'score': 0
        },
        {'text': 'Απόδειξη πλήρους υγειονομικής ασφάλισης', 'score': 0},
        {'text': 'Ισχύον δελτίο ταυτότητας ή διαβατήριο', 'score': 10},
        {
          'text': 'Δήλωση ότι διαθέτετε επαρκείς πόρους για να ζήσετε',
          'score': 0
        },
      ],
    },

//8.365
    {
      'questionText':
          'Αν επισκεφθείτε άλλη χώρα της ΕΕ ως τουρίστας, πρέπει να προβείτε σε κάποιες διατυπώσεις;',
      'answers': [
        {
          'text': 'Όχι αν παραμείνετε στη χώρα λιγότερο από τρεις μήνες',
          'score': 10
        },
        {
          'text': 'Χρειάζεστε ειδική άδεια εισόδου και παραμονής στη χώρα',
          'score': 0
        },
        {
          'text':
              'Πρέπει να προσκομίσετε βεβαίωση από την πρεσβεία της χώρας σας ότι είστε προσωρινός επισκέπτης',
          'score': 0
        },
        {
          'text': 'Συμπληρώνετε σχετικό έντυπο κατά την είσοδό σας στη χώρα',
          'score': 0
        },
      ],
    },

//8.366
    {
      'questionText':
          'Τι ποσοστό των πολιτών της ευρωζώνης δηλώνουν ότι το ευρώ είναι θετικό για την ΕΕ στο σύνολό της σύμφωνα με έρευνα του Ευρωβαρόμετρου τον Νοέμβριο 2018;',
      'answers': [
        {'text': '74%', 'score': 10},
        {'text': '37%', 'score': 0},
        {'text': '55%', 'score': 0},
        {'text': '27%', 'score': 0},
      ],
    },

//8.367
    {
      'questionText':
          'Ως υπήκοος χώρας της ΕΕ έχετε το δικαίωμα να εργάζεστε σε οποιαδήποτε χώρα της ΕΕ χωρίς να χρειάζεστε άδεια εργασίας.',
      'answers': [
        {'text': 'Όχι', 'score': 0},
        {'text': 'Σε μερικές μόνο χώρες', 'score': 0},
        {'text': 'Ναι', 'score': 10},
        {
          'text': 'Σε όσες χώρες έχουν συνάψει συμφωνία με την Κύπρο',
          'score': 0
        },
      ],
    },

//8.368
    {
      'questionText':
          'Οι Κύπριοι πολίτες έχουν τα ίδια δικαιώματα κοινωνικής ασφάλισης με τους πολίτες του κράτους μέλους της ΕΕ στο οποίο διαμένουν ή εργάζονται.',
      'answers': [
        {'text': 'Όχι', 'score': 0},
        {'text': 'Σε ορισμένες χώρες της ΕΕ', 'score': 0},
        {'text': 'Μόνο όταν συμπληρώσουν δέκα χρόνια εργασίας', 'score': 0},
        {'text': 'Ναι', 'score': 10},
      ],
    },

//8.369
    {
      'questionText':
          'Αν έχετε ζήσει νόμιμα σε άλλη χώρα της ΕΕ για 5 χρόνια χωρίς διακοπή αποκτάτε αυτόματα το δικαίωμα:',
      'answers': [
        {'text': 'Προσωρινής διαμονής', 'score': 0},
        {'text': 'Μόνιμης διαμονής', 'score': 10},
        {'text': 'Άδειας παραμονής', 'score': 0},
        {'text': 'Συμμετοχής σε προγράμματα συνεχούς επιμόρφωσης', 'score': 0},
      ],
    },

//8.370
    {
      'questionText':
          'Η αρχή της ελεύθερης διακίνησης εργαζομένων εφαρμόζεται στην Κύπρο από:',
      'answers': [
        {'text': 'Τον Δεκέμβριο του 2002', 'score': 0},
        {'text': 'Τον Μάιο του 2004', 'score': 10},
        {'text': 'Τον Ιανουάριο του 2008', 'score': 0},
        {'text': 'Τον Απρίλιο του 2003', 'score': 0},
      ],
    },

//9.371
    {
      'questionText':
          'Τις βάσεις για μια κοινή Εξωτερική Πολιτική και Πολιτική Ασφάλειας (KEΠΠA) της ΕΕ έθεσε η Συνθήκη:',
      'answers': [
        {'text': 'Της Ρώμης', 'score': 0},
        {'text': 'Ζυρίχης-Λονδίνου', 'score': 0},
        {'text': 'Της Λωζάνης', 'score': 0},
        {'text': 'Του Μάαστριχτ', 'score': 10},
      ],
    },

//9.372
    {
      'questionText':
          'Ποιου σώματος χρειάζεται η συγκατάθεση για τον διορισμό του Ύπατου Εκπροσώπου της ΕΕ για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας;',
      'answers': [
        {'text': 'Συμβουλίου της Ευρώπης', 'score': 0},
        {'text': 'Επιτροπής των Περιφερειών', 'score': 0},
        {'text': 'Ευρωκοινοβουλίου', 'score': 10},
        {'text': 'SEDE', 'score': 0},
      ],
    },

//9.373
    {
      'questionText':
          'Οι πιο σημαντικοί τομείς της Κοινής Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας (ΚΕΠΠΑ) είναι:',
      'answers': [
        {
          'text': 'Διατήρηση της ειρήνης και ενίσχυση της διεθνούς ασφάλειας',
          'score': 10
        },
        {'text': 'Ανταγωνισμός και Αλιεία', 'score': 0},
        {'text': 'Προσωπικά δεδομένα', 'score': 0},
        {'text': 'Αθλητισμός', 'score': 0},
      ],
    },

//9.374
    {
      'questionText':
          'Τι χρηματικό ποσό θα διαθέσει η Ευρωπαϊκή Επιτροπή ως αναπτυξιακή βοήθεια στις χώρες Αφρικής, Καραϊβικής και Ειρηνικού τα έτη 2014-2020;',
      'answers': [
        {'text': '30,5 δις ευρώ', 'score': 10},
        {'text': '500 δις ευρώ', 'score': 0},
        {'text': '1 δις ευρώ', 'score': 0},
        {'text': '800 εκ. ευρώ', 'score': 0},
      ],
    },

//9.375
    {
      'questionText':
          'Πόσο τοις εκατό της παγκόσμιας αναπτυξιακής βοήθειας χορηγεί η ΕΕ (στοιχεία 2017);',
      'answers': [
        {'text': '50%', 'score': 0},
        {'text': '60%', 'score': 10},
        {'text': '80%', 'score': 0},
        {'text': '10%', 'score': 0},
      ],
    },

//9.376
    {
      'questionText':
          'Μεγαλύτερη αδυναμία της εξωτερικής πολιτικής της ΕΕ θεωρείται:',
      'answers': [
        {'text': 'Ο ενιαίος πολιτικός λόγος που εκφράζει', 'score': 0},
        {'text': 'Η έλλειψη ενιαίου πολιτικού λόγου', 'score': 10},
        {'text': 'Η έλλειψη κοινής γεωγραφίας', 'score': 0},
        {'text': 'Δεν έχει αδυναμίες', 'score': 0},
      ],
    },

//9.377
    {
      'questionText':
          'Ποια συμφωνία διαμορφώνει το πλαίσιο συνεργασίας ΕΕ-ΝΑΤΟ σε θέματα ασφάλειας; ',
      'answers': [
        {'text': 'Της Φρανκφούρτης', 'score': 0},
        {'text': 'Της Αθήνας', 'score': 0},
        {'text': 'Της Νίκαιας', 'score': 0},
        {'text': 'Berlin Plus', 'score': 10},
      ],
    },

//9.378
    {
      'questionText':
          'Οι πρώτες στρατιωτικές αποστολές της ΕΕ πραγματοποιήθηκαν:',
      'answers': [
        {'text': 'Στην Κύπρο', 'score': 0},
        {'text': 'Σε Βαλκάνια και Κόνγκο', 'score': 10},
        {'text': 'Στην Κίνα', 'score': 0},
        {'text': 'Στη Βραζιλία', 'score': 0},
      ],
    },

//9.379
    {
      'questionText': 'Οι στρατιωτικές ομάδες μάχης της ΕΕ είναι: ',
      'answers': [
        {'text': 'Γερμανικής εθνικότητας', 'score': 0},
        {'text': 'Βρετανικής εθνικότητας', 'score': 0},
        {'text': 'Γαλλικής εθνικότητας', 'score': 0},
        {'text': 'Πολυεθνικές', 'score': 10},
      ],
    },

//9.380
    {
      'questionText': 'Από ποιες χώρες εισάγει φυσικό αέριο η ΕΕ;',
      'answers': [
        {'text': 'Ρωσία, Νορβηγία, Αλγερία', 'score': 10},
        {'text': 'Ελβετία, Πακιστάν, ΗΠΑ', 'score': 0},
        {'text': 'Καζακστάν, Αίγυπτο, Ισραήλ', 'score': 0},
        {'text': 'Αργεντινή, Ελβετία, Νησιά Φαρόε', 'score': 0},
      ],
    },

//9.381
    {
      'questionText':
          'Από τις πιο κάτω χώρες, υποψήφιες για ένταξη στην ΕΕ είναι:',
      'answers': [
        {'text': 'Ρωσία, Καζακστάν', 'score': 0},
        {'text': 'Τουρκία, Βόρεια Μακεδονία', 'score': 10},
        {'text': 'Νότιος Αφρική, Σομαλία', 'score': 0},
        {'text': 'Ινδονησία, Φιλιππίνες', 'score': 0},
      ],
    },

//9.382
    {
      'questionText':
          'Ποιες από τις πιο κάτω χώρες αποτελούν τους σημαντικότερους εμπορικούς εταίρους της ΕΕ;',
      'answers': [
        {'text': 'ΗΠΑ, Κίνα, Ρωσία', 'score': 10},
        {'text': 'Κούβα, Μπαχάμες, Τζαμάικα', 'score': 0},
        {'text': 'Καναδάς, Ιαπωνία, Αυστραλία', 'score': 0},
        {'text': 'Κόνγκο, Μαρόκο, Αίγυπτος', 'score': 0},
      ],
    },

//9.383
    {
      'questionText':
          'Σε ποιο ποσό ανήλθαν το 2018 οι εμπορικές ροές μεταξύ ΕΕ και ΗΠΑ;',
      'answers': [
        {'text': '100 δις ευρώ', 'score': 0},
        {'text': '60 δις ευρώ', 'score': 0},
        {'text': '670 δις ευρώ', 'score': 10},
        {'text': '800 δις ευρώ', 'score': 0},
      ],
    },

//9.384
    {
      'questionText':
          'Ποια συνθήκη δημιούργησε τη θέση του Ύπατου Εκπροσώπου της Ένωσης για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφαλείας;',
      'answers': [
        {'text': 'Του Άμστερνταμ', 'score': 0},
        {'text': 'Της Λισαβόνας', 'score': 10},
        {'text': 'Του Βουκουρεστίου', 'score': 0},
        {'text': 'Της Σόφιας', 'score': 0},
      ],
    },

//9.385
    {
      'questionText': 'Ποια πολιτική διαδέχθηκε η ΚΕΠΠΑ;',
      'answers': [
        {'text': 'Το δόγμα Τρούμαν', 'score': 0},
        {'text': 'Την Ευρωπαϊκή Πολιτική Συνεργασία', 'score': 10},
        {'text': 'Του διαίρει και βασίλευε', 'score': 0},
        {'text': 'Το σχέδιο Μάρσαλ', 'score': 0},
      ],
    },

//9.386
    {
      'questionText':
          'Ρήτρα που περιλαμβάνει η συνθήκη της Λισαβόνας, όταν μια χώρα μέλος της ΕΕ γίνεται στόχος τρομοκρατικής επίθεσης ονομάζεται:',
      'answers': [
        {'text': 'Ρήτρα Συνεννόησης', 'score': 0},
        {'text': 'Ρήτρα Συνεργασίας', 'score': 0},
        {'text': 'Ρήτρα Διαβούλευσης', 'score': 0},
        {'text': 'Ρήτρα Αλληλεγγύης', 'score': 10},
      ],
    },

//9.387
    {
      'questionText':
          'Η πιο πάνω ρήτρα δεν επηρεάζει τις δεσμεύσεις που έχουν αναληφθεί στο πλαίσιο της οργάνωσης της Συνθήκης του Βορείου Ατλαντικού (ΝΑΤΟ).',
      'answers': [
        {'text': 'Λάθος', 'score': 0},
        {'text': 'Σωστό', 'score': 10},
        {'text': 'Σε κάποιο βαθμό', 'score': 0},
        {'text': 'Τις ακυρώνει', 'score': 0},
      ],
    },

//9.388
    {
      'questionText':
          'Η  πολιτική ασφάλειας και άμυνας ορισμένων κρατών μελών, κυρίως αυτών που είναι παραδοσιακά ουδέτερα, επηρεάζεται από την προαναφερθείσα ρήτρα.',
      'answers': [
        {'text': 'Nαι', 'score': 0},
        {'text': 'Kάποιες φορές', 'score': 0},
        {'text': 'Όχι', 'score': 10},
        {'text': 'Σε κάποιο βαθμό', 'score': 0},
      ],
    },

//9.389
    {
      'questionText': 'Πόσες αντιπροσωπείες στον κόσμο διαθέτει η ΕΕ;',
      'answers': [
        {'text': '140', 'score': 10},
        {'text': '30', 'score': 0},
        {'text': '50', 'score': 0},
        {'text': '100', 'score': 0},
      ],
    },

//9.390
    {
      'questionText':
          'Η Γενική Διεύθυνση Development Cooperation (DEVCO) της ΕΕ είναι υπεύθυνη για:',
      'answers': [
        {
          'text':
              'Τη χάραξη των ευρωπαϊκών αναπτυξιακών πολιτικών και τη χορήγηση βοήθειας σε τρίτες χώρες',
          'score': 10
        },
        {'text': 'Θέματα υγείας ', 'score': 0},
        {'text': 'Θέματα αθλητισμού ', 'score': 0},
        {'text': 'Θέματα κτηνοτροφίας ', 'score': 0},
      ],
    },

//9.391
    {
      'questionText':
          'Σε ποιες από τις πιο κάτω χώρες έχουν διεξαχθεί αποστολές της ΚΕΠΠΑ;',
      'answers': [
        {
          'text':
              'Βόρεια Μακεδονία, Βοσνία-Ερζεγοβίνη, Σουδάν, Αφγανιστάν, Ιράκ',
          'score': 10
        },
        {'text': 'Χιλή', 'score': 0},
        {'text': 'Ινδία', 'score': 0},
        {'text': 'Ιράν', 'score': 0},
      ],
    },

//9.392
    {
      'questionText': 'Οι αποστολές αυτές αποσκοπούν:',
      'answers': [
        {
          'text':
              'Στον τερματισμό των εχθροπραξιών και στην παροχή βοήθειας για μεταρρυθμίσεις',
          'score': 10
        },
        {'text': 'Στην κατοχή του εδάφους από την ΕΕ', 'score': 0},
        {'text': 'Στον διωγμό των ντόπιων κατοίκων', 'score': 0},
        {'text': 'Δεν έχουν συγκεκριμένο σκοπό', 'score': 0},
      ],
    },

//9.393
    {
      'questionText':
          'Το ακρωνύμιο της Επιτροπής του Ευρωκοινοβουλίου που ασχολείται με θέματα εξωτερικής πολιτικής:',
      'answers': [
        {'text': 'EURE', 'score': 0},
        {'text': 'PREL', 'score': 0},
        {'text': 'EPSO', 'score': 0},
        {'text': 'AFET', 'score': 10},
      ],
    },

//9.394
    {
      'questionText':
          'Ποιό από τα πιο κάτω όργανα της ΕΕ συμβουλεύεται ο Ύπατος Εκπρόσωπος της Ένωσης για θέματα ΚΕΠΠΑ;',
      'answers': [
        {'text': 'Το Ευρωπαϊκό Συμβούλιο', 'score': 0},
        {'text': 'Το Ευρωκοινοβούλιο', 'score': 10},
        {'text': 'Την Ευρωπαϊκή Επιτροπή', 'score': 0},
        {'text': 'Το Συμβούλιο της Ευρωπαϊκής Ένωσης', 'score': 0},
      ],
    },

//9.395
    {
      'questionText':
          'Ποιο θεσμικό όργανο επικουρεί τον Ύπατο Εκπρόσωπο της Ένωσης για θέματα ΚΕΠΠΑ;',
      'answers': [
        {'text': 'EEAS', 'score': 10},
        {'text': 'ΒCDE', 'score': 0},
        {'text': 'BENG', 'score': 0},
        {'text': 'EPSO', 'score': 0},
      ],
    },

//9.396
    {
      'questionText':
          'Πρόεδρος της Επιτροπής Εξωτερικών Υποθέσεων του Ευρωκοινοβουλίου είναι ο:',
      'answers': [
        {'text': 'Ντέιβιντ ΜακΑλλιστερ (David MacAllister)', 'score': 10},
        {'text': 'Πίνο Αρλάτσι (Pino Arlacchi)', 'score': 0},
        {'text': 'Τούννε Κέλλαμ (Tunne Kelam)', 'score': 0},
        {'text': 'Εβγκένι Κιρίλοφ (Evgeni Kirilov)', 'score': 0},
      ],
    },

//9.397
    {
      'questionText':
          'Το 2017, πόσο τοις εκατό του προϋπολογισμού της ΕΕ διατέθηκε σε εξωτερικές δράσεις;',
      'answers': [
        {'text': '10%', 'score': 0},
        {'text': '20%', 'score': 0},
        {'text': '50%', 'score': 0},
        {'text': '6%', 'score': 10},
      ],
    },

//9.398
    {
      'questionText':
          'Τι ποσοστό των πολιτών της Ευρωζώνης, σύμφωνα με το Ευρωβαρόμετρο της Άνοιξης 2019, δηλώνουν ότι η οικονομία της Ένωσης είναι πολύ καλή;',
      'answers': [
        {'text': '2%', 'score': 0},
        {'text': '6%', 'score': 0},
        {'text': '3%', 'score': 10},
        {'text': '9%', 'score': 0},
      ],
    },

//9.399
    {
      'questionText':
          'Ποια δύο θεσμικά όργανα συναποφασίζουν για το ποσό για τις εξωτερικές δράσεις και την κατανομή του;',
      'answers': [
        {'text': 'Ευρωκοινοβούλιο και Ευρωπαϊκό Συμβούλιο', 'score': 10},
        {'text': 'Κομισιόν και Ευρωκοινοβούλιο', 'score': 0},
        {
          'text': 'Συμβούλιο των Υπουργών και Ευρωπαϊκή Κεντρική Τράπεζα',
          'score': 0
        },
        {'text': 'Κανένα από αυτά', 'score': 0},
      ],
    },

//9.400
    {
      'questionText':
          'Σε ποιο σώμα του Ευρωκοινοβουλίου πρέπει να δίνει αναφορά η Ύπατη Αρμοστής δύο φορές το χρόνο;',
      'answers': [
        {'text': 'AFET', 'score': 0},
        {'text': 'Ολομέλεια', 'score': 10},
        {'text': 'Επιτροπή Περιβάλλοντος', 'score': 0},
        {'text': 'Επιτροπή Εμπορίου', 'score': 0},
      ],
    },

//9.401
    {
      'questionText':
          'Που βρίσκεται η μεγαλύτερη μη στρατιωτική επιχείρηση (Civilian mission) της ΚΠΑΑ (Κοινή Πολιτική Ασφάλειας και Άμυνας) που αριθμεί πάνω από 3.000 άνδρες και γυναίκες;',
      'answers': [
        {'text': 'Ταϊλάνδη', 'score': 0},
        {'text': 'Πεκίνο', 'score': 0},
        {'text': 'Κοσσυφοπέδιο', 'score': 10},
        {'text': 'Ναϊρόμπι', 'score': 0},
      ],
    },

//9.402
    {
      'questionText':
          'Οι δαπάνες που έχουν στρατιωτικές συνέπειες ή αφορούν στον τομέα της άμυνας χρηματοδοτούνται από:',
      'answers': [
        {'text': 'Το ΝΑΤΟ', 'score': 0},
        {'text': 'Το SEDE', 'score': 0},
        {'text': 'Τα κράτη μέλη', 'score': 10},
        {'text': 'Το Διεθνές Νομισματικό Ταμείο', 'score': 0},
      ],
    },

//9.403
    {
      'questionText': 'Ποιο στόχο έχει η ναυτική επιχείρηση ΚΠΑΑ ATALANTA;',
      'answers': [
        {
          'text':
              'Την αποτροπή & αντιμετώπιση της πειρατείας στα νερά της Σομαλίας & τον Ινδικό Ωκεανό',
          'score': 10
        },
        {'text': 'Την ενίσχυση του εμπορίου στον Ατλαντικό', 'score': 0},
        {'text': 'Την προώθηση του ανταγωνισμού', 'score': 0},
        {'text': 'Την εξόρυξη φυσικού αερίου', 'score': 0},
      ],
    },

//9.404
    {
      'questionText':
          'Τι είδους προσωπικό αποστέλλει η ΕΕ στις μη στρατιωτικές επιχειρήσεις της;',
      'answers': [
        {'text': 'Αθλητές', 'score': 0},
        {'text': 'Δημοσιογράφους', 'score': 0},
        {'text': 'Υδραυλικούς', 'score': 0},
        {'text': 'Αστυνομικούς, δικαστές, τελωνειακούς', 'score': 10},
      ],
    },

//9.405
    {
      'questionText': 'Ποιος ήταν ο Αντρέι Ζαχάρωφ;',
      'answers': [
        {
          'text':
              'Ρώσος φυσικός που τιμήθηκε με το βραβείο Νόμπελ Ειρήνης το 1975',
          'score': 10
        },
        {'text': 'Ιάπωνας πυρηνικός φυσικός', 'score': 0},
        {'text': 'Έλληνας μαθηματικός', 'score': 0},
        {'text': 'Άγγλος, εκ των ιδρυτών της ΕΕ', 'score': 0},
      ],
    },

//9.406
    {
      'questionText':
          'Ποια συνθήκη επέκτεινε τις αρμοδιότητες του Ευρωπαϊκού οργανισμού Άμυνας;',
      'answers': [
        {'text': 'Της Νίκαιας', 'score': 0},
        {'text': 'Της Λισαβόνας', 'score': 10},
        {'text': 'Της Λευκωσίας', 'score': 0},
        {'text': 'Της Τεχεράνης', 'score': 0},
      ],
    },

//9.407
    {
      'questionText':
          'Ποιος είναι ο κύριος στόχος του Ευρωπαϊκού οργανισμού Άμυνας;',
      'answers': [
        {
          'text': 'Η βελτίωση των στρατιωτικών δυνατοτήτων των κρατών μελών',
          'score': 10
        },
        {'text': 'Μια Ευρώπη χωρίς στρατούς', 'score': 0},
        {'text': 'Η επέκταση της εδαφικής κυριαρχίας της Ευρώπης', 'score': 0},
        {'text': 'Η έναρξη του Γ’ Παγκοσμίου Πολέμου', 'score': 0},
      ],
    },

//9.408
    {
      'questionText': 'Οι κύριες ευρωπαϊκές στρατιωτικές δυνάμεις είναι:',
      'answers': [
        {'text': 'ΕΦ, ΕΛΔΥΚ', 'score': 0},
        {'text': 'ΓΕΕΘΑ, ΓΕΣ', 'score': 0},
        {'text': 'EU Battlegroups, Eurocorps, Euromarfor', 'score': 10},
        {'text': 'Euronews, Euribor', 'score': 0},
      ],
    },

//9.409
    {
      'questionText':
          'Πόσα στελέχη έχει, συνήθως, κάθε πολυεθνική στρατιωτική μονάδα των EU Battlegroups;',
      'answers': [
        {'text': '100', 'score': 0},
        {'text': '150', 'score': 0},
        {'text': '2500', 'score': 0},
        {'text': '1500', 'score': 10},
      ],
    },

//SOS
//9.410
    {
      'questionText': 'Η Eurocorps συγκεντρώνει:',
      'answers': [
        {
          'text':
              'Χερσαίες δυνάμεις των: Γερμανίας, Βελγίου, Ισπανίας, Γαλλίας και Λουξεμβούργου',
          'score': 10
        },
        {'text': 'Χερσαίες δυνάμεις της Βραζιλίας', 'score': 0},
        {'text': 'Χερσαίες δυνάμεις της Τουρκίας', 'score': 0},
        {'text': 'Τίποτα από όλα αυτά', 'score': 0},
      ],
    },

//9.411
    {
      'questionText': 'Η Euromarfor συγκεντρώνει:',
      'answers': [
        {'text': 'Ναυτικές δυνάμεις της Κύπρου', 'score': 0},
        {
          'text':
              'Ναυτικές δυνάμεις της Ισπανίας, της Γαλλίας, της Ιταλίας και της Πορτογαλίας',
          'score': 10
        },
        {'text': 'Αεροπορικές δυνάμεις του Ιράν', 'score': 0},
        {'text': 'Χερσαίες δυνάμεις του Ιράκ', 'score': 0},
      ],
    },

//ΣΟΣ
//9.412
    {
      'questionText': 'H Ευρωπαϊκή ομάδα Αεροπορίας συγκεντρώνει:',
      'answers': [
        {
          'text':
              'Αεροπορικές δυνάμεις των: Ιταλίας, Βελγίου, Ισπανίας, Γαλλίας, Γερμανίας, Ολλανδίας, Η.Βασιλείου',
          'score': 10
        },
        {'text': 'Αεροπορικές δυνάμεις της Μάλτας και της Κύπρου', 'score': 0},
        {'text': 'Αεροπορικές δυνάμεις της Ελβετίας', 'score': 0},
        {'text': 'Τίποτα από τα προηγούμενα', 'score': 0},
      ],
    },

//9.413
    {
      'questionText':
          'Σε ποιους από τους πιο κάτω τομείς συνεργάζονται ΕΕ-Ρωσία;',
      'answers': [
        {'text': 'Τουρισμό', 'score': 0},
        {'text': 'Εκπαίδευση', 'score': 0},
        {
          'text': 'Ενεργειακός εφοδιασμός, επενδύσεις και καινοτομία',
          'score': 10
        },
        {'text': 'Δεν συνεργάζονται', 'score': 0},
      ],
    },

//9.414
    {
      'questionText':
          'Το φόρουμ «Ένωση για τη Μεσόγειο» επιδιώκει τη δημιουργία στενότερων δεσμών με:',
      'answers': [
        {'text': 'Την Κίνα', 'score': 0},
        {'text': 'Τις Σκανδιναβικές χώρες', 'score': 0},
        {'text': 'Τις Βαλτικές χώρες', 'score': 0},
        {
          'text': 'Τις χώρες της Μέσης Ανατολής και της Βόρειας Αφρικής',
          'score': 10
        },
      ],
    },

//9.415
    {
      'questionText':
          'Πέρα από τα 28 κράτη μέλη της ΕΕ, πόσες άλλες χώρες συμμετέχουν στο φόρουμ «Ένωση για τη Μεσόγειο»;',
      'answers': [
        {'text': '3', 'score': 0},
        {'text': '5', 'score': 0},
        {'text': '15', 'score': 10},
        {'text': '33', 'score': 0},
      ],
    },

//9.416
    {
      'questionText':
          'Στα έργα που θα αναληφθούν μέσω αυτού του φόρουμ, για την αναζωογόνηση της Μεσογείου, περιλαμβάνονται:',
      'answers': [
        {
          'text':
              'Καθαρισμός της Μεσογείου, βελτίωση της ναυτιλίας, αξιοποίηση ηλιακής ενέργειας',
          'score': 10
        },
        {'text': 'Συνδιοργάνωση Ολυμπιακών Αγώνων', 'score': 0},
        {'text': 'Ανάπτυξη ξενοδοχείων στις χώρες της Μεσογείου', 'score': 0},
        {'text': 'Κανένα από αυτά', 'score': 0},
      ],
    },

//10.417
    {
      'questionText': 'Τι πληθυσμό έχει η Ευρώπη των 28 (στοιχεία 2018);',
      'answers': [
        {'text': 'Περίπου 300 εκατομμύρια', 'score': 0},
        {'text': 'Περίπου 1 δισεκατομμύριο', 'score': 0},
        {'text': 'Περίπου 500 εκατομμύρια', 'score': 10},
        {'text': 'Περίπου 800 εκατομμύρια', 'score': 0},
      ],
    },

//10.418
    {
      'questionText': 'Ποια χώρα της ΕΕ έχει τη μεγαλύτερη έκταση;',
      'answers': [
        {'text': 'Η Κροατία', 'score': 0},
        {'text': 'Η Γαλλία', 'score': 10},
        {'text': 'Η Ισπανία', 'score': 0},
        {'text': 'Η Γερμανία', 'score': 0},
      ],
    },

//10.419
    {
      'questionText':
          'Σύμφωνα με το Ευρωβαρόμετρο της Άνοιξης 2019, τι ποσοστό των Ευρωπαίων πολιτών απάντησε ότι η ζωή τους θα είναι καλύτερη σε ένα χρόνο;',
      'answers': [
        {'text': '26%', 'score': 0},
        {'text': '32%', 'score': 10},
        {'text': '43%', 'score': 0},
        {'text': '49%', 'score': 0},
      ],
    },

//10.420
    {
      'questionText': 'Τι δεν ισχύει για τα χαρτονομίσματα του ευρώ;',
      'answers': [
        {'text': 'Είναι σε κάθε χώρα διαφορετικά', 'score': 10},
        {'text': 'Είναι ίδια σε όλες τις χώρες', 'score': 0},
        {
          'text': 'Απεικονίζουν γέφυρες που συμβολίζουν την επικοινωνία',
          'score': 0
        },
        {
          'text':
              'Απεικονίζουν παράθυρα και πύλες που συμβολίζουν την ευρύτητα',
          'score': 0
        },
      ],
    },

//10.421
    {
      'questionText':
          'Η Γερμανία, με πληθυσμό πάνω από 81 εκατομμύρια, τι ποσοστό του ευρωπαϊκού πληθυσμού έχει;',
      'answers': [
        {'text': 'Σχεδόν το μισό', 'score': 0},
        {'text': 'Το ένα τέταρτο', 'score': 0},
        {'text': 'Γύρω στο 16%', 'score': 10},
        {'text': 'Ένα 10%', 'score': 0},
      ],
    },

//10.422
    {
      'questionText':
          'Οι τρεις μεγαλύτερες σε έκταση χώρες της ΕΕ είναι με τη σειρά:',
      'answers': [
        {'text': 'Γαλλία, Ισπανία, Γερμανία', 'score': 0},
        {'text': 'Γαλλία, Ισπανία, Ηνωμένο Βασίλειο', 'score': 0},
        {'text': 'Γαλλία, Ισπανία, Σουηδία', 'score': 10},
        {'text': 'Γαλλία, Ισπανία, Πολωνία', 'score': 0},
      ],
    },

//10.423
    {
      'questionText':
          'Η Γαλλία, που είναι η μεγαλύτερη χώρα της ΕΕ των 28, τι ποσοστό του συνολικού εδάφους έχει;',
      'answers': [
        {'text': '14,8%', 'score': 10},
        {'text': '25,3%', 'score': 0},
        {'text': '8%', 'score': 0},
        {'text': '9,5%', 'score': 0},
      ],
    },

//10.424
    {
      'questionText':
          'Σύμφωνα με την απογραφή του 2011, τι ποσοστό του πληθυσμού της Κύπρου είναι άνω των 65 ετών;',
      'answers': [
        {'text': '10%', 'score': 0},
        {'text': '13%', 'score': 10},
        {'text': '20%', 'score': 0},
        {'text': '22%', 'score': 0},
      ],
    },

//10.425
    {
      'questionText': 'Χώρες με πληθυσμό γύρω στα 10 εκατομμύρια είναι:',
      'answers': [
        {
          'text': 'Η Πορτογαλία, η Ουγγαρία, η Τσεχία και το Βέλγιο',
          'score': 10
        },
        {
          'text': 'Η Μάλτα, το Λουξεμβούργο, η Λιθουανία και η Λετονία',
          'score': 0
        },
        {
          'text': 'Η Πορτογαλία, η Γαλλία, το Ηνωμένο Βασίλειο και η Πολωνία',
          'score': 0
        },
        {'text': 'Η Βουλγαρία, η Ρουμανία, η Ελλάδα και η Κύπρος', 'score': 0},
      ],
    },

//10.426
    {
      'questionText':
          'Το νόμισμα της Ελλάδας πριν αντικατασταθεί από το ευρώ ήταν:',
      'answers': [
        {'text': 'Η μνα', 'score': 0},
        {'text': 'Η δραχμή', 'score': 10},
        {'text': 'Ο παράς', 'score': 0},
        {'text': 'Η ελληνική λίρα', 'score': 0},
      ],
    },

//10.427
    {
      'questionText':
          'Σε ποια πόλη της Ευρώπης οι κάτοικοι που δεν είναι Ευρωπαίοι πολίτες ξεπερνούν το 25%;',
      'answers': [
        {'text': 'Στη Λεμεσό', 'score': 0},
        {'text': 'Στην Αθήνα', 'score': 0},
        {'text': 'Στο Ταλίν', 'score': 10},
        {'text': 'Στο Παρίσι', 'score': 0},
      ],
    },

//10.428
    {
      'questionText':
          'Σύμφωνα με το Ευρωβαρόμετρο της Άνοιξης 2019, ποια είναι τα 2 πιο σημαντικά έματα για τους κύπριους;',
      'answers': [
        {'text': 'Μεταναστευτικό και Ανεργία', 'score': 0},
        {'text': 'Εκπαίδευση και Ανεργία', 'score': 0},
        {'text': 'Υγεία και Ανεργία', 'score': 0},
        {'text': 'Οικονομία και Ανεργία', 'score': 10},
      ],
    },

//10.429
    {
      'questionText':
          'Στη Μάλτα, που είναι η πιο πυκνοκατοικημένη χώρα της ΕΕ, σε κάθε τετραγωνικό χιλιόμετρο ζουν:',
      'answers': [
        {'text': 'Πάνω από 300 κάτοικοι', 'score': 0},
        {'text': 'Πάνω από 800 κάτοικοι', 'score': 0},
        {'text': 'Πάνω από 1000 κάτοικοι', 'score': 0},
        {'text': 'Πάνω από 1200 κάτοικοι', 'score': 10},
      ],
    },

//10.430
    {
      'questionText':
          'Σε αυτές τις χώρες οι πολίτες δείχνουν μεγάλη εμπιστοσύνη στα πολιτικά κόμματα:',
      'answers': [
        {'text': 'Ελλάδα και Κύπρος', 'score': 0},
        {'text': 'Γερμανία και Αυστρία', 'score': 0},
        {'text': 'Δανία και Φινλανδία', 'score': 10},
        {'text': 'Ηνωμένο Βασίλειο και Ιρλανδία', 'score': 0},
      ],
    },

//10.431
    {
      'questionText':
          'Στη Φινλανδία, που είναι η πιο αραιοκατοικημένη χώρα της ΕΕ, σε κάθε τετραγωνικό χιλιόμετρο ζουν λιγότεροι από:',
      'answers': [
        {'text': 'Δέκα κάτοικοι', 'score': 0},
        {'text': 'Είκοσι κάτοικοι', 'score': 10},
        {'text': 'Πενήντα κάτοικοι', 'score': 0},
        {'text': 'Εκατό κάτοικοι', 'score': 0},
      ],
    },

//10.432
    {
      'questionText': 'Η ψηλότερη κορυφή της Ευρώπης, με 4.810 μέτρα, είναι:',
      'answers': [
        {'text': 'Στον Όλυμπο', 'score': 0},
        {'text': 'Στο Τρόοδος', 'score': 0},
        {'text': 'Στα Πυρηναία', 'score': 0},
        {'text': 'Στο Λευκό Όρος', 'score': 10},
      ],
    },

//10.433
    {
      'questionText': 'Πυκνοκατοικημένες χώρες είναι:',
      'answers': [
        {'text': 'Η Μάλτα, η Γερμανία και η Σουηδία', 'score': 0},
        {'text': 'Η Κύπρος, η Μάλτα και η Γαλλία', 'score': 0},
        {'text': 'Το Βέλγιο, η Ολλανδία και το Ηνωμένο Βασίλειο', 'score': 10},
        {'text': 'Η Ιρλανδία, η Εσθονία και η Βουλγαρία', 'score': 0},
      ],
    },

//10.434
    {
      'questionText': 'Οι περισσότεροι γάμοι σε αναλογία πληθυσμού γίνονται:',
      'answers': [
        {'text': 'Στην Κύπρο', 'score': 10},
        {'text': 'Στην Ελλάδα', 'score': 0},
        {'text': 'Στη Μάλτα', 'score': 0},
        {'text': 'Στη Βουλγαρία', 'score': 0},
      ],
    },

//10.435
    {
      'questionText': 'Νησιωτικά κράτη είναι:',
      'answers': [
        {'text': 'Η Κύπρος, η Κρήτη και η Μάλτα', 'score': 0},
        {'text': 'Η Κύπρος, η Ελλάδα και το Ηνωμένο Βασίλειο', 'score': 0},
        {'text': 'Η Φιλανδία, η Σουηδία και η Δανία ', 'score': 0},
        {'text': 'Η Ιρλανδία, το Ηνωμένο Βασίλειο και η Κύπρος', 'score': 10},
      ],
    },

//10.436
    {
      'questionText': 'Ποιων χωρών οι άντρες ζουν περισσότερο (στοιχεία 2017);',
      'answers': [
        {'text': 'Της Ουγγαρίας και της Πολωνίας', 'score': 0},
        {'text': 'Της Σουηδίας και της Ιταλίας', 'score': 10},
        {'text': 'Της Ελλάδας και της Κύπρου', 'score': 0},
        {'text': 'Του Ηνωμένου Βασιλείου και της Ιρλανδίας', 'score': 0},
      ],
    },

//10.437
    {
      'questionText': 'Οι μικρότερες σε πληθυσμό χώρες της ΕΕ των 28 είναι:',
      'answers': [
        {'text': 'Η Λετονία, η Λιθουανία και η Ολλανδία', 'score': 0},
        {'text': 'Η Μάλτα, το Λουξεμβούργο και η Κύπρος', 'score': 10},
        {'text': 'Η Σλοβενία, η Σλοβακία και η Σουηδία', 'score': 0},
        {'text': 'Η Κύπρος, η Ελλάδα και η Μάλτα', 'score': 0},
      ],
    },

//10.438
    {
      'questionText':
          'Σύμφωνα με τον οργανισμό «Διεθνής Διαφάνεια» αυτές οι χώρες έχουν αντιμετωπίσει αποτελεσματικά τη διαφθορά:',
      'answers': [
        {'text': 'Γαλλία και Γερμανία', 'score': 0},
        {'text': 'Ελλάδα και Ιταλία', 'score': 0},
        {'text': 'Κύπρος και Ηνωμένο Βασίλειο', 'score': 0},
        {'text': 'Δανία και Φινλανδία', 'score': 10},
      ],
    },

//10.439
    {
      'questionText':
          'Ο μέσος όρος του ποσοστού απασχόλησης στις γυναίκες στην ΕΕ των 28 είναι 58,8%. Η χώρα με το υψηλότερο ποσοστό είναι:',
      'answers': [
        {'text': 'Η Γερμανία', 'score': 0},
        {'text': 'Η Γαλλία', 'score': 0},
        {'text': 'Η Σουηδία', 'score': 10},
        {'text': 'Η Βουλγαρία', 'score': 0},
      ],
    },

//10.440
    {
      'questionText':
          'Πόσα χρόνια ζουν περισσότερο οι κύπριες από τους κύπριους;',
      'answers': [
        {'text': 'Τρία χρόνια', 'score': 0},
        {'text': 'Τέσσερα χρόνια', 'score': 10},
        {'text': 'Επτά χρόνια', 'score': 0},
        {'text': 'Εννέα χρόνια', 'score': 0},
      ],
    },

//10.441
    {
      'questionText': 'Η μεγαλύτερη ευρωπαϊκή πόλη είναι:',
      'answers': [
        {'text': 'Η Ρώμη', 'score': 0},
        {'text': 'Η Αθήνα', 'score': 0},
        {'text': 'Το Παρίσι', 'score': 0},
        {'text': 'Το Βερολίνο', 'score': 10},
      ],
    },

//10.442
    {
      'questionText': 'Το μεγαλύτερο εμπορικό λιμάνι της ΕΕ είναι:',
      'answers': [
        {'text': 'Το Άμστερνταμ', 'score': 0},
        {'text': 'Το Ρότερνταμ', 'score': 10},
        {'text': 'Ο Πειραιάς', 'score': 0},
        {'text': 'Η Μασσαλία', 'score': 0},
      ],
    },

//10.443
    {
      'questionText':
          'Τον Ιανουάριο του 2019, οι προβλεπόμενες από το νόμο ακαθάριστες μηνιαίες κατώτατες αποδοχές κυμαίνονταν:',
      'answers': [
        {'text': 'Από τα 280 έως τα 2000 ευρώ', 'score': 10},
        {'text': 'Από τα 200 έως τα 1.000 ευρώ', 'score': 0},
        {'text': 'Από τα 300 έως τα 2.000 ευρώ', 'score': 0},
        {'text': 'Από τα 50 έως τα 1.500 ευρώ', 'score': 0},
      ],
    },

//10.444
    {
      'questionText': 'Το νοτιότερο σημείο της ΕΕ των 28 είναι:',
      'answers': [
        {'text': 'Η ιταλική Σικελία', 'score': 0},
        {'text': 'Η ιταλική Σαρδηνία', 'score': 0},
        {'text': 'Η ελληνική Γαύδος', 'score': 10},
        {'text': 'Η γαλλική Ριβιέρα', 'score': 0},
      ],
    },

//10.445
    {
      'questionText':
          'Σε αυτή χώρα της ΕΕ των 28 ένας στους δύο δασκάλους είναι άνω των 50 ετών:',
      'answers': [
        {'text': 'Στην Ιταλία', 'score': 10},
        {'text': 'Στην Ελλάδα', 'score': 0},
        {'text': 'Στην Κύπρο', 'score': 0},
        {'text': 'Στο Λουξεμβούργο', 'score': 0},
      ],
    },

//10.446
    {
      'questionText':
          'Τον Ιανουάριο του 2019 η χώρα με τις κατώτατες ακαθάριστες μηνιαίες αποδοχές (280 ευρώ) ήταν:',
      'answers': [
        {'text': 'Η Ελλάδα', 'score': 0},
        {'text': 'Η Κύπρος', 'score': 0},
        {'text': 'Η Βουλγαρία', 'score': 10},
        {'text': 'Η Πορτογαλία', 'score': 0},
      ],
    },

//10.447
    {
      'questionText':
          'Χώρες στις οποίες οι πολίτες δεν εμπιστεύονται καθόλου τα πολιτικά τους κόμματα είναι:',
      'answers': [
        {'text': 'Η Ελλάδα και η Λετονία', 'score': 10},
        {'text': 'Η Ουγγαρία και η Πολωνία', 'score': 0},
        {'text': 'Το Βέλγιο και η Γαλλία', 'score': 0},
        {'text': 'Η Σουηδία και η Ολλανδία', 'score': 0},
      ],
    },

//10.448
    {
      'questionText':
          'Πόσα από τα δέκα μεγαλύτερα γήπεδα ποδοσφαίρου του κόσμου βρίσκονται στην ΕΕ των 28;',
      'answers': [
        {'text': 'Κανένα', 'score': 0},
        {'text': 'Ένα', 'score': 0},
        {'text': 'Δύο', 'score': 10},
        {'text': 'Πέντε', 'score': 0},
      ],
    },

//10.449
    {
      'questionText':
          'Το 2019 η χώρα με τις ανώτατες ακαθάριστες μηνιαίες αποδοχές (4.916 ευρώ) ήταν:',
      'answers': [
        {'text': 'Η Γερμανία', 'score': 0},
        {'text': 'Το Λουξεμβούργο', 'score': 10},
        {'text': 'Το Βέλγιο', 'score': 0},
        {'text': 'Η Γαλλία', 'score': 0},
      ],
    },

//10.450
    {
      'questionText': 'Οι λιγότεροι γάμοι γίνονται:',
      'answers': [
        {'text': 'Σε Βέλγιο και Γαλλία', 'score': 0},
        {'text': 'Σε Αυστρία και Γερμανία', 'score': 0},
        {'text': 'Σε Βουλγαρία και Σλοβενία', 'score': 10},
        {'text': 'Σε Κύπρο και Ελλάδα', 'score': 0},
      ],
    },

//10.451
    {
      'questionText':
          'Σε ποια χώρα οι κάτοικοι έχουν τη μεγαλύτερη αγοραστική δύναμη;',
      'answers': [
        {'text': 'Στο Λουξεμβούργο', 'score': 10},
        {'text': 'Στη Γερμανία', 'score': 0},
        {'text': 'Στην Κύπρο', 'score': 0},
        {'text': 'Στη Σουηδία', 'score': 0},
      ],
    },

//10.452
    {
      'questionText': 'Ποιες είναι οι μακροβιότερες Ευρωπαίες;',
      'answers': [
        {'text': 'Οι Ισπανίδες και οι Γαλλίδες', 'score': 10},
        {'text': 'Οι Κύπριες και οι Ελληνίδες', 'score': 0},
        {'text': 'Οι Λιθουανές και οι Λετονές', 'score': 0},
        {'text': 'Οι Γερμανίδες και οι Ολλανδές', 'score': 0},
      ],
    },

//10.453
    {
      'questionText':
          'Στην Ευρώπη των 28 οι γυναίκες που απασχολούνται στη δημοτική εκπαίδευση αποτελούν:',
      'answers': [
        {'text': 'Το 50% των δασκάλων', 'score': 0},
        {'text': 'Το 60% των δασκάλων', 'score': 0},
        {'text': 'Το 70% των δασκάλων', 'score': 0},
        {'text': 'Πάνω από το 80% των δασκάλων', 'score': 10},
      ],
    },

//10.454
    {
      'questionText':
          'Σε ποια χώρα οι κάτοικοι έχουν τη μικρότερη αγοραστική δύναμη;',
      'answers': [
        {'text': 'Στην Κύπρο', 'score': 0},
        {'text': 'Στην Ελλάδα', 'score': 0},
        {'text': 'Στην Ισπανία', 'score': 0},
        {'text': 'Στη Βουλγαρία', 'score': 10},
      ],
    },

//10.455
    {
      'questionText':
          'Πιο δυσαρεστημένοι από τη δημόσια διοίκηση στη χώρα τους δηλώνουν:',
      'answers': [
        {'text': 'Γερμανοί, Σουηδοί και Εσθονοί', 'score': 0},
        {'text': 'Έλληνες, Ιταλοί και Ισπανοί', 'score': 10},
        {'text': 'Κύπριοι, Σλοβάκοι και Βούλγαροι', 'score': 0},
        {'text': 'Γάλλοι, Ρουμάνοι και Ούγγροι', 'score': 0},
      ],
    },

//10.456
    {
      'questionText':
          'Σε ποια χώρα παρατηρείται η μεγαλύτερη διαφορά στη διάρκεια της ζωής αντρών και γυναικών;',
      'answers': [
        {'text': 'Στη Γαλλία', 'score': 0},
        {'text': 'Στη Λιθουανία', 'score': 10},
        {'text': 'Στην Ελλάδα', 'score': 0},
        {'text': 'Στην Ολλανδία', 'score': 0},
      ],
    },

//10.457
    {
      'questionText':
          'Ποιες χώρες έχουν το μεγαλύτερο ποσοστό δασκάλων κάτω από 30 ετών;',
      'answers': [
        {'text': 'Η Ιταλία και η Ισπανία', 'score': 0},
        {'text': 'Η Κύπρος και η Μάλτα', 'score': 10},
        {'text': 'Η Βουλγαρία και η Ρουμανία', 'score': 0},
        {'text': 'Η Γερμανία και το Λουξεμβούργο', 'score': 0},
      ],
    },

//10.458
    {
      'questionText':
          'Πιο ευχαριστημένοι από τη δημόσια διοίκηση στη χώρα τους δηλώνουν:',
      'answers': [
        {'text': 'Λουξεμβουργιανοί, Γερμανοί και Σουηδοί', 'score': 10},
        {'text': 'Έλληνες, Κύπριοι και Πολωνοί', 'score': 0},
        {'text': 'Γερμανοί, Γάλλοι και Βέλγοι', 'score': 0},
        {'text': 'Ρουμάνοι, Βούλγαροι και Πορτογάλοι', 'score': 0},
      ],
    },

//10.459
    {
      'questionText':
          'Σύμφωνα με τον οργανισμό «Διεθνής Διαφάνεια» αυτές οι χώρες απέτυχαν να αντιμετωπίσουν αποτελεσματικά τη διαφθορά:',
      'answers': [
        {'text': 'Ρουμανία και Βουλγαρία', 'score': 10},
        {'text': 'Βέλγιο και Λουξεμβούργο', 'score': 0},
        {'text': 'Γαλλία και Γερμανία', 'score': 0},
        {'text': 'Αυστρία και Ολλανδία', 'score': 0},
      ],
    },

//10.460
    {
      'questionText': 'Πόση είναι η μεγαλύτερη διαφορά ώρας στην ΕΕ των 28;',
      'answers': [
        {'text': 'Όλες οι χώρες έχουν την ίδια ώρα', 'score': 0},
        {'text': 'Μία ώρα', 'score': 0},
        {'text': 'Δύο ώρες', 'score': 10},
        {'text': 'Τρεις ώρες', 'score': 0},
      ],
    },

//10.461
    {
      'questionText':
          'Οι χώρες όπου οι εκπαιδευτικοί στη δημοτική εκπαίδευση είναι σχεδόν αποκλειστικά γυναίκες είναι:',
      'answers': [
        {'text': 'Η Ιρλανδία και η Λετονία', 'score': 10},
        {'text': 'Η Σουηδία και η Ολλανδία', 'score': 0},
        {'text': 'Η Μάλτα και η Γερμανία', 'score': 0},
        {'text': 'Η Τσεχία και η Σλοβενία', 'score': 0},
      ],
    },

//10.462
    {
      'questionText':
          'Ο μέσος όρος του ποσοστού απασχόλησης στις γυναίκες στην ΕΕ των 28 είναι 58,8%. Η χώρα με το χαμηλότερο ποσοστό είναι:',
      'answers': [
        {'text': 'Η Μάλτα', 'score': 10},
        {'text': 'Η Ολλανδία', 'score': 0},
        {'text': 'Η Ιταλία', 'score': 0},
        {'text': 'Η Ελλάδα', 'score': 0},
      ],
    },

//10.463
    {
      'questionText':
          'Στην ΕΕ των 28, 89 στα 100 νοικοκυριά έχουν σύνδεση με το διαδίκτυο (στοιχεία 2018). Η χώρα με το υψηλότερο ποσοστό είναι:',
      'answers': [
        {'text': 'Η Σουηδία', 'score': 0},
        {'text': 'Η Ισπανία', 'score': 0},
        {'text': 'Η Κύπρος', 'score': 0},
        {'text': 'Η Ολλανδία', 'score': 10},
      ],
    },

//10.464
    {
      'questionText':
          'Ποια είναι η προσδοκώμενη διάρκεια ζωής των αντρών στην ΕΕ των 28 (στοιχεία του 2017);',
      'answers': [
        {'text': '80,1 έτη', 'score': 0},
        {'text': '78,3 έτη', 'score': 10},
        {'text': '83,3 έτη', 'score': 0},
        {'text': '74,8 έτη', 'score': 0},
      ],
    },

//10.465
    {
      'questionText':
          'Γαμηλιότητα ονομάζεται το ποσοστό των γάμων ανά 1.000 κατοίκους. Το ποσοστό αυτό για την Ευρώπη των 28 είναι:',
      'answers': [
        {'text': '10%', 'score': 0},
        {'text': '20%', 'score': 0},
        {'text': 'Κάτω από 5%', 'score': 10},
        {'text': 'Κάτω από 2%', 'score': 0},
      ],
    },

//10.466
    {
      'questionText':
          'Στην ΕΕ των 28, 89 στα 100 νοικοκυριά έχουν σύνδεση με το διαδίκτυο. οι χώρες με τα χαμηλότερα ποσοστά είναι:',
      'answers': [
        {'text': 'Γαλλία, Αυστρία, Βέλγιο', 'score': 0},
        {'text': 'Βουλγαρία, Ρουμανία, Ελλάδα', 'score': 10},
        {'text': 'Πολωνία, Λετονία, Εσθονία', 'score': 0},
        {'text': 'Ισπανία, Ιταλία, Κύπρος', 'score': 0},
      ],
    },

//10.467
    {
      'questionText':
          'Σε όλες τις χώρες της ΕΕ των 28 οι δασκάλες είναι περισσότερες από τους δασκάλους. Σε ποια χώρα οι δάσκαλοι είναι πάνω από 30%;',
      'answers': [
        {'text': 'Στην Ιρλανδία', 'score': 0},
        {'text': 'Στη Σουηδία', 'score': 0},
        {'text': 'Στη Δανία', 'score': 10},
        {'text': 'Στην Κύπρο', 'score': 0},
      ],
    },

//10.468
    {
      'questionText':
          'Στην ΕΕ των 28 σε ποιο ποσοστό οι πολίτες διαβάζουν εφημερίδες από τον υπολογιστή τους (στοιχεία 2016);',
      'answers': [
        {'text': 'Σε ποσοστό 40%', 'score': 0},
        {'text': 'Σε ποσοστό 50%', 'score': 0},
        {'text': 'Σε ποσοστό 60%', 'score': 0},
        {'text': 'Σε ποσοστό 70%', 'score': 10},
      ],
    },

//10.469
    {
      'questionText': 'Το ανατολικότερο κράτος της ΕΕ των 28 είναι:',
      'answers': [
        {'text': 'Η Κύπρος', 'score': 10},
        {'text': 'Η Πορτογαλία', 'score': 0},
        {'text': 'Η Βουλγαρία', 'score': 0},
        {'text': 'Η Ελλάδα', 'score': 0},
      ],
    },

//10.470
    {
      'questionText':
          'Ποιας χώρας οι πολίτες ανησυχούν περισσότερο για την οικονομική κατάσταση;',
      'answers': [
        {'text': 'Της Κύ��ρο��', 'score': 0},
        {'text': 'Της Γ��ρμ��νί��ς', 'score': 0},
        {'text': 'Της Ελλάδας', 'score': 10},
        {'text': 'Της Πολωνίας', 'score': 0},
      ],
    },

//10.471
    {
      'questionText':
          'Οι πολίτες ποιων χωρών διαβάζουν σε μεγαλύτερο ποσοστό εφημερίδες ηλεκτρονικά;',
      'answers': [
        {'text': 'Λιθουανίας και Εσθονίας', 'score': 10},
        {'text': 'Ελλάδας και Ισπανίας', 'score': 0},
        {'text': 'Κύπρου και Μάλτας', 'score': 0},
        {'text': 'Γερμανίας και Πορτογαλίας', 'score': 0},
      ],
    },

//10.472
    {
      'questionText':
          'Σε ποια χώρα οι πολίτες δεν ανησυχούν ιδιαίτερα για την τιμή της ενέργειας;',
      'answers': [
        {'text': 'Στη Γερμανία', 'score': 0},
        {'text': 'Στο Βέλγιο', 'score': 0},
        {'text': 'Στην Εσθονία', 'score': 10},
        {'text': 'Στην Ελλάδα', 'score': 0},
      ],
    },

//10.473
    {
      'questionText':
          'Ποιων χωρών οι γυναίκες έχουν πιο σύντομη ζωή (σύμφωνα με στοιχεία του 2017);',
      'answers': [
        {'text': 'Της Γαλλίας και της Ιταλίας', 'score': 0},
        {'text': 'Της Βουλγαρίας και της Ρουμανίας', 'score': 10},
        {'text': 'Της Ελλάδας και του Βελγίου', 'score': 0},
        {'text': 'Της Γερμανίας και της Αυστρίας', 'score': 0},
      ],
    },

//10.474
    {
      'questionText':
          'Σε ποια χώρα οι εργαζόμενοι έχουν τη «μικρότερη» εβδομάδα εργασίας;',
      'answers': [
        {'text': 'Στη Δανία', 'score': 10},
        {'text': 'Στην Ελλάδα', 'score': 0},
        {'text': 'Στο Λουξεμβούργο', 'score': 0},
        {'text': 'Στην Ιρλανδία', 'score': 0},
      ],
    },

//10.475
    {
      'questionText':
          'Οι πολίτες ποιων χωρών χρησιμοποιούν περισσότερο τα online κοινωνικά δίκτυα (στοιχεία 2018);',
      'answers': [
        {'text': 'Ουγγαρίας και Ρουμανίας', 'score': 10},
        {'text': 'Γαλλίας και Ιρλανδίας', 'score': 0},
        {'text': 'Ελλάδας και Μάλτας', 'score': 0},
        {'text': 'Γερμανίας και Αυστρίας', 'score': 0},
      ],
    },

//10.476
    {
      'questionText':
          'Οι δύο χώρες με το χαμηλότερο ποσοστό αυτοκτονιών είναι:',
      'answers': [
        {'text': 'Η Αυστρία και η Ολλανδία', 'score': 0},
        {'text': 'Η Κύπρος και η Ελλάδα', 'score': 10},
        {'text': 'Η Γαλλία και η Ρουμανία', 'score': 0},
        {'text': 'Η Γερμανία και το Βέλγιο', 'score': 0},
      ],
    },

//10.477
    {
      'questionText': 'Οι Ευρωπαίοι πολίτες εμπιστεύονται τα πολιτικά κόμματα:',
      'answers': [
        {'text': 'Πάρα πολύ', 'score': 0},
        {'text': 'Σε ποσοστό 50%', 'score': 0},
        {'text': 'Σε ποσοστό 19%', 'score': 10},
        {'text': 'Σε ποσοστό μικρότερο του 10%', 'score': 0},
      ],
    },

//10.478
    {
      'questionText':
          'Τι ποσοστό των Ευρωπαίων πολιτών συμφωνούν στη δημιουργία μιας ενιαίας ευρωπαϊκής πολιτικής στο θέμα της μετανάστευσης (στοιχεία 2019);',
      'answers': [
        {'text': '67%', 'score': 10},
        {'text': '26%', 'score': 0},
        {'text': '59%', 'score': 0},
        {'text': '87%', 'score': 0},
      ],
    },

//10.479
    {
      'questionText':
          'Στατιστικά οι πολίτες αυτών των χωρών παραμένουν υγιέστεροι περισσότερο χρόνο της ζωής τους:',
      'answers': [
        {'text': 'Της Γερμανίας και της Ολλανδίας', 'score': 0},
        {'text': 'Της Σουηδίας και της Μάλτας', 'score': 10},
        {'text': 'Της Κύπρου και της Γαλλίας', 'score': 0},
        {'text': 'Της Πολωνίας και της Ρουμανίας', 'score': 0},
      ],
    },

//10.480
    {
      'questionText':
          'Οι Ευρωπαίοι πολίτες εμπιστεύονται κατά μέσο όρο την τηλεόραση σε ποσοστό:',
      'answers': [
        {'text': '70%', 'score': 0},
        {'text': '60%', 'score': 0},
        {'text': '50%', 'score': 10},
        {'text': '40%', 'score': 0},
      ],
    },

//10.481
    {
      'questionText':
          'Τι ποσοστό των Ευρωπαίων πολιτών είναι υπέρ της κοινής εμπορικής πολιτικής της Ένωσης (στοιχεία 2019):',
      'answers': [
        {'text': 'Ποσοστό 52%', 'score': 0},
        {'text': 'Ποσοστό 40%', 'score': 0},
        {'text': 'Ποσοστό 64%', 'score': 0},
        {'text': 'Ποσοστό 71%', 'score': 10},
      ],
    },

//10.482
    {
      'questionText': 'Τα υψηλότερα ποσοστά θανάτων από καρκίνο καταγράφονται:',
      'answers': [
        {'text': 'Στην Πολωνία', 'score': 0},
        {'text': 'Στη Γερμανία', 'score': 0},
        {'text': 'Στην Αυστρία', 'score': 10},
        {'text': 'Στην Κύπρο', 'score': 0},
      ],
    },

//10.483
    {
      'questionText': 'Οι χώρες με τα υψηλότερα ποσοστά ανεργίας είναι:',
      'answers': [
        {'text': 'Η Κύπρος και η Γερμανία', 'score': 0},
        {'text': 'Η Ισπανία και η Ελλάδα', 'score': 10},
        {'text': 'Το Λουξεμβούργο και η Μάλτα', 'score': 0},
        {'text': 'Η Βουλγαρία και η Πολωνία', 'score': 0},
      ],
    },

//10.484
    {
      'questionText':
          'Ποιας χώρας οι πολίτες εμφανίζουν νωρίτερα προβλήματα υγείας;',
      'answers': [
        {'text': 'Της Σλοβακίας', 'score': 10},
        {'text': 'Της Ισπανίας', 'score': 0},
        {'text': 'Της Κύπρου', 'score': 0},
        {'text': 'Του Λουξεμβούργου', 'score': 0},
      ],
    },

//10.485
    {
      'questionText':
          'Ο μέσος όρος των ωρών εργασίας την εβδομάδα στην ΕΕ των 28, το 2016, ήταν:',
      'answers': [
        {'text': '35,8', 'score': 0},
        {'text': '38,1', 'score': 0},
        {'text': '40,3', 'score': 10},
        {'text': '42,3', 'score': 0},
      ],
    },

//10.486
    {
      'questionText':
          'Πόσοι Ευρωπαίοι δηλώνουν ικανοποιημένοι από το σύστημα υγείας της χώρας τους;',
      'answers': [
        {'text': 'Τρεις στους δέκα', 'score': 0},
        {'text': 'Οι μισοί', 'score': 0},
        {'text': 'Εφτά στους δέκα', 'score': 10},
        {'text': 'Οκτώ στους δέκα', 'score': 0},
      ],
    },

//10.487
    {
      'questionText':
          'Τι ποσοστό των Ευρωπαίων πολιτών χρησιμοποιεί το διαδίκτυο καθημερινά ή σχεδόν καθημερινά (στοιχεία 2018);',
      'answers': [
        {'text': '90%', 'score': 0},
        {'text': '86%', 'score': 0},
        {'text': '55%', 'score': 0},
        {'text': '76%', 'score': 10},
      ],
    },

//10.488
    {
      'questionText': 'Τα λιγότερα κατά κεφαλή σκουπίδια παράγουν οι πολίτες:',
      'answers': [
        {'text': 'Της Φινλανδίας', 'score': 0},
        {'text': 'Της Αυστρίας', 'score': 0},
        {'text': 'Της Τσεχίας', 'score': 10},
        {'text': 'Της Σουηδίας', 'score': 0},
      ],
    },

//10.489
    {
      'questionText':
          'Πόσα κιλά σκουπίδια παρήγαγε το 2016 ο κάθε κύπριος πολίτης:',
      'answers': [
        {'text': '2.892', 'score': 10},
        {'text': '3.515', 'score': 0},
        {'text': '225', 'score': 0},
        {'text': '1.500', 'score': 0},
      ],
    },

//10.490
    {
      'questionText':
          'Ποιες δύο χώρες έχουν τους λιγότερους καθηγητές άνω των 50 ετών;',
      'answers': [
        {'text': 'Το Βέλγιο και η Γαλλία', 'score': 0},
        {'text': 'Η Μάλτα και η Κύπρος', 'score': 0},
        {'text': 'Η Ιταλία και η Πορτογαλία', 'score': 0},
        {'text': 'Η Ολλανδία και η Ιρλανδία', 'score': 10},
      ],
    },

//10.491
    {
      'questionText':
          'Ποιας χώρας οι πολίτες είναι οι πιο δυσαρεστημένοι από τις συντάξεις τους;',
      'answers': [
        {'text': 'Της Κύπρου', 'score': 0},
        {'text': 'Της Ελλάδας', 'score': 10},
        {'text': 'Της Γερμανίας', 'score': 0},
        {'text': 'Της Ιταλίας', 'score': 0},
      ],
    },

//10.492
    {
      'questionText':
          'Ποια είναι η χώρα με το μεγαλύτερο ποσοστό μερικής απασχόλησης;',
      'answers': [
        {'text': 'Η Ελλάδα', 'score': 0},
        {'text': 'Η Τσεχία', 'score': 0},
        {'text': 'Η Ολλανδία', 'score': 10},
        {'text': 'Η Ιταλία', 'score': 0},
      ],
    },

//10.493
    {
      'questionText':
          'Σε ποια χώρα καταγράφηκαν το 2015 τα λιγότερα, σε απόλυτους αριθμούς, περιστατικά θανάτου από καρκίνο;',
      'answers': [
        {'text': 'Στην Κροατία', 'score': 0},
        {'text': 'Στη Σουηδία', 'score': 0},
        {'text': 'Στην Κύπρο', 'score': 10},
        {'text': 'Στη Λιθουανία', 'score': 0},
      ],
    },

//10.494
    {
      'questionText':
          'Σε ποια χώρα σημειώθηκαν το 2015 οι περισσότεροι, σε απόλυτους αριθμούς, θάνατοι από ατυχήματα;',
      'answers': [
        {'text': 'Στην Ιρλανδία', 'score': 0},
        {'text': 'Στη Λιθουανία', 'score': 0},
        {'text': 'Στη Γερμανία', 'score': 10},
        {'text': 'Στην Τσεχία', 'score': 0},
      ],
    },

//10.495
    {
      'questionText': 'Στην ΕΕ των 28 ποσοστό των αυτοκτονιών το 2015 ήταν:',
      'answers': [
        {'text': '1.1%', 'score': 10},
        {'text': '5%', 'score': 0},
        {'text': '2%', 'score': 0},
        {'text': '3%', 'score': 0},
      ],
    },

//10.496
    {
      'questionText':
          'Το 2016, πόσα κιλά σκουπιδιών παρήγαγε, κατά μέσο όρο, κάθε Ευρωπαίος πολίτης;',
      'answers': [
        {'text': '4968', 'score': 10},
        {'text': '2550', 'score': 0},
        {'text': '9800', 'score': 0},
        {'text': '7620', 'score': 0},
      ],
    },

//10.497
    {
      'questionText':
          'Πιο ικανοποιημένοι από την καταπολέμηση των διακρίσεων στη χώρα τους δηλώνουν:',
      'answers': [
        {'text': 'Οι Βέλγοι', 'score': 10},
        {'text': 'Οι Γερμανοί', 'score': 0},
        {'text': 'Οι Κύπριοι', 'score': 0},
        {'text': 'Οι Πολωνοί', 'score': 0},
      ],
    },

//10.498
    {
      'questionText':
          'Ποιας χώρας οι πολίτες εκτιμούν περισσότερο την τηλεόραση;',
      'answers': [
        {'text': 'Της Φινλανδίας', 'score': 10},
        {'text': 'Του Βελγίου', 'score': 0},
        {'text': 'Της Κύπρου', 'score': 0},
        {'text': 'Της Γερμανίας', 'score': 0},
      ],
    },

//10.499
    {
      'questionText':
          'Σύμφωνα με το Ευρωβαρόμετρο της Άνοιξης 2019, τι ποσοστό κυπρίων θεωρεί τα περιβαλλοντικά θέματα πολύ σημαντικά;',
      'answers': [
        {'text': '3%', 'score': 0},
        {'text': '7%', 'score': 10},
        {'text': '9%', 'score': 0},
        {'text': '10%', 'score': 0},
      ],
    },

//10.500
    {
      'questionText':
          'Σύμφωνα με το Ευρωβαρόμετρο της Άνοιξης 2019, ποιο ποσοστό κυπρίων δηλώνουν ότι νιώθουν Ευρωπαίοι πολίτες;',
      'answers': [
        {'text': '46%', 'score': 0},
        {'text': '49%', 'score': 0},
        {'text': '73%', 'score': 10},
        {'text': '81%', 'score': 0},
      ],
    },
  ];

  var _qnum = 0;
  var _countnum = 1;
  var _totalScore = 0;
  int seconds = 10;
  bool isCorrect = false;
  int randnum;
  String currentAnswerSelect;

  @override
  void initState() {
    randnum = Random().nextInt(questions.length);
    super.initState();
  }

  void _answerQuestion(dynamic answer) {
    int score = answer['score'];
    _totalScore = _totalScore + score;

    setState(() {
      currentAnswerSelect = answer['text'];
    });

    Timer(Duration(seconds: 1), () {
      if (this.mounted)
        setState(() {
          _countnum = _countnum + 1;
          _qnum = _qnum + 1;
          randnum = Random().nextInt(questions.length);
          currentAnswerSelect = null;
        });
    });

//    print(_qnum);  //test

//    if (_qnum < 10) {  //test
//      print("we have more questions");
//    } else {
//      print('No more questions');
//    }
  }

  String get resultPhrase {
    String resultText;
    if (_totalScore <= 40) {
      resultText = 'You need more practice!';
    } else if (_totalScore <= 70) {
      resultText = 'Good job!';
    } else {
      resultText = 'Congratulations!!!';
    }
    return resultText;
  }

  @override
  Widget build(BuildContext context) {
    SystemChrome.setPreferredOrientations(
        [DeviceOrientation.portraitDown, DeviceOrientation.portraitUp]);
    return MaterialApp(
      home: _qnum < 10
          ? Scaffold(
              appBar: AppBar(
                backgroundColor: Colors.indigoAccent[700],
                title: SafeArea(
                  child: Row(
                    mainAxisAlignment: MainAxisAlignment.spaceBetween,
                    children: <Widget>[
                      Container(
                        child: Text(
                          '$_countnum/10',
                          style: TextStyle(
                            fontSize: 28,
                          ),
                        ),
                      ),
//                      Container(   //for future updates - ADD TIMER
//                        child: Text(
//                          '        $seconds',
//                          style: TextStyle(
//                            fontSize: 28,
//                          ),
//                        ),
//                      ),
                      Container(
                        child: Text(
                          'Score: $_totalScore',
                          style: TextStyle(
                            fontSize: 28,
                          ),
                        ),
                      ),
                    ],
                  ),
                ),
              ),
              body: Column(
                mainAxisAlignment: MainAxisAlignment.spaceBetween,
                children: [
                  SizedBox(),
                  Column(
                    children: <Widget>[
                      Row(
                        mainAxisAlignment: MainAxisAlignment.center,
                        children: <Widget>[
                          new Flexible(
//                          margin: EdgeInsets.fromLTRB(0, 5, 0, 0),
                            child: Container(
                              margin: EdgeInsets.fromLTRB(10, 5, 10, 0),
                              //padding: EdgeInsets.fromLTRB(30, 0, 30, 0),
                              child: Column(
                                crossAxisAlignment: CrossAxisAlignment.center,
                                children: <Widget>[
                                  new Text(
                                    questions[randnum]['questionText'],
                                    style: new TextStyle(
                                      color: Colors.black,
                                      fontSize: getRelativeSize(context, 5.5),
                                      fontWeight: FontWeight.bold,
                                    ),
                                    textAlign: TextAlign.center,
                                  ),
                                ],
                              ),
                            ),
                          ),
                        ],
                      ),
                    ],
                  ),
                  Padding(
                    padding: const EdgeInsets.all(10.0),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.stretch,
                      children: [
                        ...(questions[randnum]['answers']
                                as List<Map<String, Object>>)
                            .map((answer) {
                          return Answer(
                            currentAnswerSelect == null
                                ? () => _answerQuestion(answer)
                                : null,
                            answer['text'],
                            color: currentAnswerSelect == null
                                ? null
                                : answer['text'] == currentAnswerSelect
                                    ? (answer['score'] as int) > 0
                                        ? Colors.greenAccent[400]
                                        : Colors.redAccent[100]
                                    : (answer['score'] as int) > 0
                                        ? Colors.greenAccent[400]
                                        : Colors.amberAccent[100],
                          );
                        }).toList()
                      ],
                    ),
                  ),
                ],
              ),
            )
          : Scaffold(
              backgroundColor: Colors.indigoAccent[700],
              body: Column(
                mainAxisAlignment: MainAxisAlignment.center,
                children: <Widget>[
                  Text(
                    '$resultPhrase',
                    style: TextStyle(
                      color: Colors.white,
                      fontSize: getRelativeSize(context, 12.5),
                      fontWeight: FontWeight.bold,
                    ),
                    textAlign: TextAlign.center,
                  ),
                  Text(
                    'Total score: $_totalScore/100',
                    style: TextStyle(
                      color: Colors.white,
                      fontSize: getRelativeSize(context, 11.5),
                      fontWeight: FontWeight.bold,
                    ),
                    textAlign: TextAlign.center,
                  ),
                  Column(
                    crossAxisAlignment: CrossAxisAlignment.stretch,
                    children: <Widget>[
                      Container(
                        height: 100.0,
                        margin: EdgeInsets.fromLTRB(20, 30, 20, 0),
                        child: ClipRRect(
                          borderRadius: BorderRadius.circular(20.0),
                          child: RaisedButton(
                            onPressed: () {
                              Navigator.pushReplacement(
                                context,
                                MaterialPageRoute(
                                    builder: (context) => questionpage()),
                              );
                            },
                            child: Text(
                              'Play again',
                              style: new TextStyle(
                                  color: Colors.black,
                                  fontSize: getRelativeSize(context, 12),
                                  fontWeight: FontWeight.bold),
                            ),
                            color: Colors.amberAccent,
                          ),
                        ),
                      ),
                    ],
                  ),
                  Column(
                    crossAxisAlignment: CrossAxisAlignment.stretch,
                    children: <Widget>[
                      Container(
                        height: 100.0,
                        margin: EdgeInsets.fromLTRB(20, 20, 20, 0),
                        child: ClipRRect(
                          borderRadius: BorderRadius.circular(20.0),
                          child: RaisedButton(
                            onPressed: () {
                              Navigator.pushReplacement(
                                context,
                                MaterialPageRoute(
                                    builder: (context) => startpage()),
                              );
                            },
                            child: Text(
                              'Main menu',
                              style: new TextStyle(
                                  color: Colors.black,
                                  fontSize: getRelativeSize(context, 12),
                                  fontWeight: FontWeight.bold),
                            ),
                            color: Colors.amberAccent,
                          ),
                        ),
                      ),
                    ],
                  ),
                ],
              ),
            ),
    );
  }
}

//BACKUP ONLY 100 QUESTIONS
//import 'package:flutter/cupertino.dart';
//import 'package:flutter/material.dart';
//import 'package:flutter/services.dart';
//import './answer.dart';
//import './start.dart';
//import 'dart:math';
//
//class questionpage extends StatefulWidget {
//  @override
//  _questionpageState createState() => _questionpageState();
//}
//
//class _questionpageState extends State<questionpage> {
//  final questions = const [
////1.1
//    {
//      'questionText': 'Γιατί δημιουργήθηκε η Ευρωπαϊκή Ένωση;',
//      'answers': [
//        {'text':'Για να τεθεί τέλος στους συχνούς πολέμους που κατέληξαν στον Β’ Παγκόσμιο Πόλεμο', 'score': 10},
//        {'text':'Για να αντισταθούν οι Ευρωπαίοι στην οικονομική ανάπτυξη των Ηνωμένων Πολιτειών της Αμερικής', 'score': 0},
//        {'text':'Για να ενωθούν οι δυτικές χώρες της Ευρώπης έναντι των χωρών του Συμφώνου της Βαρσοβίας', 'score': 0},
//        {'text': 'Για να καταργηθούν τα σύνορα μεταξύ των χωρών της Ευρώπης', 'score': 0},
//      ],
//    },
//
////1.2
//    {
//      'questionText':
//      'Ποιος ήταν ο πρόδρομος της δημιουργίας της Ευρωπαϊκής Ένωσης;',
//      'answers': [
//        {'text': 'Η Κοινωνία των Εθνών', 'score': 0},
//        {'text': 'Η Ευρωπαϊκή Κοινότητα Άνθρακα και Χάλυβα', 'score': 10},
//        {'text': 'Το Κίνημα των Αδεσμεύτων', 'score': 0},
//        {'text': 'Η Κοινοπολιτεία των Εθνών', 'score': 0},
//      ],
//    },
//
////1.3
//    {
//      'questionText':
//      'Πότε δημιουργήθηκε η Εοκ (Ευρωπαϊκή οικονομική κοινότητα);',
//      'answers': [
//        {'text': '9 Μαΐου 1950', 'score': 0},
//        {'text': '18 Απριλίου 1951', 'score': 0},
//        {'text': '30 Αυγούστου 1954', 'score': 0},
//        {'text': '25 Μαρτίου 1957', 'score': 10},
//      ],
//    },
//
////1.4
//    {
//      'questionText':
//      'Πότε υπέβαλαν η Ελλάδα και η Τουρκία αίτηση σύνδεσης με την Εοκ;',
//      'answers': [
//        {'text': '2004', 'score': 0},
//        {'text': '1999', 'score': 0},
//        {'text': '2012', 'score': 0},
//        {'text': '1959', 'score': 10},
//      ],
//    },
//
////1.5
//    {
//      'questionText':
//      'Ποιος από τους πιο κάτω δεν περιλαμβάνεται στους ιδρυτές της ΕΕ;',
//      'answers': [
//        {'text': 'Μιχαήλ Γκορμπατσώφ (Mikhail Gorbachev)', 'score': 10},
//        {'text': 'Ουίνστον Τσόρτσιλ (Winston Churchill) ', 'score': 0},
//        {'text': 'Ρομπέρ Σουμάν (Robert Schuman)', 'score': 0},
//        {'text': 'Αλτιέρο Σπινέλι (Altiero Spinelli)', 'score': 0},
//      ],
//    },
////1.6
//    {
//      'questionText':
//      'Ο Oυίνστον Tσόρτσιλ, ένας εκ των 11 ανθρώπων που θεωρούνται οι ιδρυτές της ΕΕ, διετέλεσε:',
//      'answers': [
//        {'text': 'Πρωθυπουργός του Ηνωμένου Βασιλείου', 'score': 10},
//        {'text': 'Κυβερνήτης της Κύπρου', 'score': 0},
//        {'text': 'Πρωθυπουργός της Πολωνίας', 'score': 0},
//        {'text': 'Πρόεδρος των ΗΠΑ', 'score': 0},
//      ],
//    },
//
////1.7
//    {
//      'questionText':
//      'Τι καταργήθηκε την 1η Ιουλίου 1968 μεταξύ των έξι, τότε, κρατών μελών της ΕΕ;',
//      'answers': [
//        {'text': 'Η ελεύθερη διασυνοριακή διακίνηση ανθρώπων', 'score': 0},
//        {'text': 'Η απαγόρευση στη μεταφορά κατοικίδιων ζώων', 'score': 0},
//        {'text': 'Οι τελωνειακοί δασμοί', 'score': 10},
//        {'text': 'Η απαγόρευση πώλησης γαλλικής σαμπάνιας εκτός Γαλλίας','score': 0},
//      ],
//    },
//
////1.8
//    {
//      'questionText':
//      'Ποια από τις πιο κάτω δεν περιλαμβάνεται στις «τέσσερις ελευθερίες» μεταξύ των κρατών μελών της ΕΕ που καθιερώθηκαν με την ολοκλήρωση της Ενιαίας Αγοράς το 1993;',
//      'answers': [
//        {'text': 'Ελεύθερη κυκλοφορία εφευρέσεων', 'score': 10},
//        {'text': 'Ελεύθερη κυκλοφορία αγαθών', 'score': 0},
//        {'text': 'Ελεύθερη κυκλοφορία προσώπων', 'score': 0},
//        {'text': 'Ελεύθερη κυκλοφορία υπηρεσιών', 'score': 0},
//      ],
//    },
//
////1.9
//    {
//      'questionText':
//      'Με ποια συνθήκη η «Ευρωπαϊκή κοινότητα» μετονομάστηκε, στις 7 Φεβρουαρίου 1992, επίσημα, σε «Ευρωπαϊκή Ένωση»;',
//      'answers': [
//        {'text': 'Συνθήκη της Λευκωσίας', 'score': 0},
//        {'text': 'Συνθήκη των Ευρωπαίων', 'score': 0},
//        {'text': 'Συνθήκη του Μάαστριχτ', 'score': 10},
//        {'text': 'Συνθήκη των Σεβρών', 'score': 0},
//      ],
//    },
//
////1.10
//    {
//      'questionText':
//      'Η συμφωνία του Σένγκεν, που τέθηκε σε εφαρμογή στις 26 Μαρτίου 1995, σε επτά χώρες προνοούσε ότι οι υπήκοοί τους μπορούσαν: ',
//      'answers': [
//        {'text': 'Να αγωνίζονται σε ποδοσφαιρικές ομάδες όποιας χώρας ήθελαν','score': 0},
//        {'text': 'Να επιλέξουν την υπηκοότητα που προτιμούσαν', 'score': 0},
//        {'text': 'Να διακινούνται χωρίς έλεγχο διαβατηρίων στα σύνορα','score': 10},
//        {'text':'Να επιλέγουν τη χώρα στην οποία θα πληρώνουν φόρο εισοδήματος','score': 0},
//      ],
//    },
//
//
////2.1
//    {
//      'questionText': 'Ποιο από τα πιο κάτω δεν περιλαμβάνεται στα τέσσερα βασικά θεσμικά όργανα της ΕΕ;',
//      'answers': [
//        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
//        {'text': 'Η Ευρωπαϊκή Επιτροπή', 'score': 0},
//        {'text': 'Η UNESCO', 'score': 10},
//        {'text': 'Το Συμβούλιο της Ευρωπαϊκής Ένωσης', 'score': 0},
//      ],
//    },
//
////2.2
//    {
//      'questionText': 'Το Ευρωπαϊκό Συμβούλιο, ένα από τέσσερα βασικά θεσμικά όργανα της ΕΕ, όπου συνεδριάζουν οι ηγέτες σε εθνικό και ευρωπαϊκό επίπεδο, θέτει:',
//      'answers': [
//        {'text': 'Τις γενικές προτεραιότητες της ΕΕ', 'score': 10},
//        {'text': 'Τους κανόνες δεοντολογίας της ΕΕ', 'score': 0},
//        {'text': 'Όρους για τις εξαγωγές προϊόντων των χωρών μελών στην Ασία', 'score': 0},
//        {'text': 'Όρια στις ελευθερίες των πολιτών της ΕΕ', 'score': 0},
//      ],
//    },
//
////2.3
//    {
//      'questionText': 'Στο Ευρωπαϊκό κοινοβούλιο οι άμεσα εκλεγμένοι ευρωβουλευτές εκπροσωπούν:',
//      'answers': [
//        {'text': 'Τους Ευρωπαίους πολίτες', 'score': 10},
//        {'text': 'Τα κόμματά τους', 'score': 0},
//        {'text': 'Τις κυβερνήσεις των χωρών τους', 'score': 0},
//        {'text': 'Τους εαυτούς τους', 'score': 0},
//      ],
//    },
//
////2.4
//    {
//      'questionText': 'Η Ευρωπαϊκή Επιτροπή, της οποίας τα μέλη διορίζονται από τις εθνικές κυβερνήσεις, προωθεί:',
//      'answers': [
//        {'text': 'Τα συμφέροντα κάθε κράτους μέλους', 'score': 0},
//        {'text': 'Τα συμφέροντα του κράτους μέλους που προεδρεύει κάθε φορά', 'score': 0},
//        {'text': 'Τις θέσεις των πέντε πλουσιότερων χωρών της ΕΕ', 'score': 0},
//        {'text': 'Τα συμφέροντα της ΕΕ ως συνόλου', 'score': 10},
//      ],
//    },
//
////2.5
//    {
//      'questionText': 'Στο Συμβούλιο της Ευρωπαϊκής Ένωσης οι κυβερνήσεις:',
//      'answers': [
//        {'text': 'Ψηφίζουν τους βουλευτές για το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
//        {'text': 'Προασπίζουν τα εθνικά συμφέροντα των χωρών τους', 'score': 10},
//        {'text': 'Δίνουν συμβουλές στις άλλες χώρες για διάφορους τομείς', 'score': 0},
//        {'text': 'Ρυθμίζουν τις εισαγωγές προϊόντων από τρίτες χώρες', 'score': 0},
//      ],
//    },
//
////2.6
//    {
//      'questionText': 'Το Ευρωπαϊκό Συμβούλιο έχει:',
//      'answers': [
//        {'text': 'Δικαστική εξουσία', 'score': 0},
//        {'text': 'Νομοθετική εξουσία', 'score': 0},
//        {'text': 'Εκτελεστική εξουσία', 'score': 0},
//        {'text': 'Την εξουσία να καθορίσει τις γενικές πολιτικές κατευθύνσεις της ΕΕ', 'score': 10},
//      ],
//    },
//
////2.7
//    {
//      'questionText': 'Το Ευρωπαϊκό Συμβούλιο, με επικεφαλής τον πρόεδρό του και αποτελούμενο από τους αρχηγούς των κρατών μελών και τον πρόεδρο της Επιτροπής, συνεδριάζει:',
//      'answers': [
//        {'text': 'Κάθε εβδομάδα', 'score': 0},
//        {'text': 'Στη Νέα Υόρκη', 'score': 0},
//        {'text': 'Τουλάχιστον κάθε 6 μήνες', 'score': 10},
//        {'text': 'Κάθε 5 χρόνια', 'score': 0},
//      ],
//    },
//
////2.8
//    {
//      'questionText': 'Οι συσκέψεις του Ευρωπαϊκού Συμβουλίου είναι στην ουσία:',
//      'answers': [
//        {'text': 'Σύνοδοι κορυφής', 'score': 10},
//        {'text': 'Σύντομες', 'score': 0},
//        {'text': 'Ανεπίσημες', 'score': 0},
//        {'text': 'Ασήμαντες', 'score': 0},
//      ],
//    },
//
////2.9
//    {
//      'questionText': 'Στο Ευρωπαϊκό Συμβούλιο μετέχει επίσης η/ο:',
//      'answers': [
//        {'text': 'Πρέσβης των Ηνωμένων Πολιτειών Aμερικής στην ΕΕ', 'score': 0},
//        {'text': 'Εκπρόσωπος της Ένωσης για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας', 'score': 10},
//        {'text': 'Εκπρόσωπος του Oργανισμού Bορειοατλαντικού Συμφώνου (ΝΑΤΟ)', 'score': 0},
//        {'text': 'Γενικός Γραμματέας του Oργανισμού Hνωμένων Eθνών (ΟΗΕ)', 'score': 0},
//      ],
//    },
//
////2.10
//    {
//      'questionText': 'Οι σύνοδοι του Ευρωπαϊκού Συμβουλίου πραγματοποιούνται συνήθως:',
//      'answers': [
//        {'text': 'Σε χώρα εκτός της ΕΕ', 'score': 0},
//        {'text': 'Πρωί', 'score': 0},
//        {'text': 'Στις Βρυξέλλες', 'score': 10},
//        {'text': 'Σαββατοκύριακο', 'score': 0},
//      ],
//    },
//
//
////3.1
//    {
//      'questionText': 'Πότε θα πραγματοποιηθούν οι επόμενες ευρωεκλογές;',
//      'answers': [
//        {'text': '2022', 'score': 0},
//        {'text': '2024', 'score': 10},
//        {'text': '2020', 'score': 0},
//        {'text': '2021', 'score': 0},
//      ],
//    },
//
////3.2
//    {
//      'questionText': ' Με πόσους βουλευτές εκπροσωπείται η Κύπρος στο Ευρωπαϊκό κοινοβούλιο;',
//      'answers': [
//        {'text': 'Δύο', 'score': 0},
//        {'text': 'Έξι', 'score': 10},
//        {'text': 'Οκτώ', 'score': 0},
//        {'text': 'Δεκαέξι', 'score': 0},
//      ],
//    },
//
////3.3
//    {
//      'questionText': 'Πρόεδρος του Ευρωπαϊκού κοινοβουλίου είναι ο/η:',
//      'answers': [
//        {'text': 'Ζαν-Κλοντ Γιούνκερ (Jean-Claude Juncker)', 'score': 0},
//        {'text': 'Φεντερίκα Μογκερίνι (Federica Mogherini)', 'score': 0},
//        {'text': 'Νταβίντ - Μαρία Σασσόλι (David - Maria Sassoli)', 'score': 10},
//        {'text': 'Ντόναλντ Τουσκ (Donald Tusk)', 'score': 0},
//      ],
//    },
//
////3.4
//    {
//      'questionText': 'Ποια από τις πιο κάτω πόλεις δεν αποτελεί έδρα εργασιών του Ευρωπαϊκού κοινοβουλίου;',
//      'answers': [
//        {'text': 'Λουξεμβούργο', 'score': 0},
//        {'text': 'Βρυξέλλες', 'score': 0},
//        {'text': 'Βρυξέλλες', 'score': 0},
//        {'text': 'Αμβούργο', 'score': 10},
//      ],
//    },
//
////3.5
//    {
//      'questionText': 'Πόσους βουλευτές διαθέτει το Ευρωπαϊκό κοινοβούλιο;',
//      'answers': [
//        {'text': 'Κάτω από 500', 'score': 0},
//        {'text': 'Λιγότερους από 600', 'score': 0},
//        {'text': 'Περισσότερους από 700', 'score': 10},
//        {'text': 'Περισσότερους από 1000', 'score': 0},
//      ],
//    },
//
////3.6
//    {
//      'questionText': ' Τον Ευρωπαϊκό Προϋπολογισμό εγκρίνει:',
//      'answers': [
//        {'text': 'Η Ευρωπαϊκή Επιτροπή και το Συμβούλιο της ΕΕ', 'score': 0},
//        {'text': 'Το Ευρωπαϊκό Συμβούλιο', 'score': 0},
//        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο και η Ευρωπαϊκή Επιτροπή', 'score': 0},
//        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο και το Συμβούλιο της ΕΕ', 'score': 10},
//      ],
//    },
//
////3.7
//    {
//      'questionText': 'Οι πρώτες εκλογές για την άμεση ανάδειξη των μελών του Ευρωπαϊκού κοινοβουλίου έγιναν το:',
//      'answers': [
//        {'text': '1950', 'score': 0},
//        {'text': '1967', 'score': 0},
//        {'text': '1979', 'score': 10},
//        {'text': '1980', 'score': 0},
//      ],
//    },
//
////3.8
//    {
//      'questionText': 'Το Ευρωπαϊκό κοινοβούλιο (Εκ) διορίζει τον:',
//      'answers': [
//        {'text': 'Ευρωπαίο Διαμεσολαβητή', 'score': 10},
//        {'text': 'Πρόεδρο της Γαλλίας', 'score': 0},
//        {'text': 'Πρόεδρο του Συμβουλίου της ΕΕ', 'score': 0},
//        {'text': 'Ύπατο Εκπρόσωπο για την Εξωτερική Πολιτική και Πολιτικής Ασφαλείας', 'score': 0},
//      ],
//    },
//
////3.9
//    {
//      'questionText': 'Ποιο από τα πιο κάτω δεν αποτελεί αρμοδιότητα του Εκ;',
//      'answers': [
//        {'text': 'Ψήφιση νόμων', 'score': 0},
//        {'text': 'Έγκριση του προϋπολογισμού της ΕΕ', 'score': 0},
//        {'text': 'Εκδίκαση ποινικών υποθέσεων που καθυστερούν στα κράτη μέλη', 'score': 10},
//        {'text': 'Άσκηση ελέγχου πάνω στη δράση της Ευρωπαϊκής Επιτροπής  και του Ευρωπαϊκού Συμβουλίου', 'score': 0},
//      ],
//    },
//
////3.10
//    {
//      'questionText': 'Τα έγγραφα του κοινοβουλίου δημοσιεύονται:',
//      'answers': [
//        {'text': 'Μόνο στα αγγλικά', 'score': 0},
//        {'text': 'Στα αγγλικά και τα γαλλικά', 'score': 0},
//        {'text': 'Στα αγγλικά, τα γαλλικά και τα γερμανικά', 'score': 0},
//        {'text': 'Σε όλες τις επίσημες γλώσσες της ΕΕ', 'score': 10},
//      ],
//    },
//
//
////4.1
//    {
//      'questionText': 'Την 1η Οκτωβρίου 2019, από πόσα κράτη μέλη αποτελείτο η Ευρωπαϊκή Ένωση;',
//      'answers': [
//        {'text': '15', 'score': 0},
//        {'text': '25', 'score': 0},
//        {'text': '28', 'score': 10},
//        {'text': '30', 'score': 0},
//      ],
//    },
//
////4.2
//    {
//      'questionText': 'Πως λέγεται το χρηματοδοτικό πρόγραμμα της Ευρωπαϊκής Ένωσης που στηρίζει τον πολιτισμό;',
//      'answers': [
//        {'text': 'Δημιουργική Ευρώπη', 'score': 10},
//        {'text': 'Πολιτιστική Ευρώπη', 'score': 0},
//        {'text': 'Διασυνοριακή Ευρώπη', 'score': 0},
//        {'text': 'Ευρώπη της κουλτούρας', 'score': 0},
//      ],
//    },
//
////4.3
//    {
//      'questionText': 'Ποια από τις πιο κάτω δεν είναι υποψήφια προς ένταξη στην Ευρωπαϊκή Ένωση χώρα;',
//      'answers': [
//        {'text': 'Ιρλανδία', 'score': 10},
//        {'text': 'Μαυροβούνιο', 'score': 0},
//        {'text': 'Σερβία', 'score': 0},
//        {'text': 'Τουρκία', 'score': 0},
//      ],
//    },
//
////4.4
//    {
//      'questionText': 'Ποιο από τα πιο κάτω κράτη της ευρωπαϊκής ηπείρου δεν ανήκει στην Ευρωπαϊκή Ένωση;',
//      'answers': [
//        {'text': 'Εσθονία', 'score': 0},
//        {'text': 'Λετονία', 'score': 0},
//        {'text': 'Ελβετία', 'score': 10},
//        {'text': 'Ουγγαρία', 'score': 0},
//      ],
//    },
//
////4.5
//    {
//      'questionText': 'Ποια από τις πιο κάτω είναι εν δυνάμει υποψήφια προς ένταξη στην Ευρωπαϊκή Ένωση χώρα;',
//      'answers': [
//        {'text': 'Λιθουανία', 'score': 0},
//        {'text': 'Βοσνία - Ερζεγοβίνη', 'score': 10},
//        {'text': 'Λετονία', 'score': 0},
//        {'text': 'Κροατία', 'score': 0},
//      ],
//    },
//
////4.6
//    {
//      'questionText': 'Ποιο κράτος προσχώρησε στην Ευρωπαϊκή Ένωση την 1η Ιουλίου 2013;',
//      'answers': [
//        {'text': 'Ρουμανία', 'score': 0},
//        {'text': 'Κροατία', 'score': 10},
//        {'text': 'Νορβηγία', 'score': 0},
//        {'text': 'Δανία', 'score': 0},
//      ],
//    },
//
////4.7
//    {
//      'questionText': 'Με πόσα ακόμη κράτη της ευρωπαϊκής ηπείρου συνορεύει η Ευρωπαϊκή Ένωση;',
//      'answers': [
//        {'text': '6', 'score': 0},
//        {'text': '10', 'score': 0},
//        {'text': '12', 'score': 0},
//        {'text': '18', 'score': 10},
//      ],
//    },
//
////4.8
//    {
//      'questionText': 'Ποιο είναι το μικρότερο πληθυσμιακά κράτος μέλος της Ευρωπαϊκής Ένωσης;',
//      'answers': [
//        {'text': 'Κύπρος', 'score': 0},
//        {'text': 'Μάλτα', 'score': 10},
//        {'text': 'Πολωνία', 'score': 0},
//        {'text': 'Λουξεμβούργο', 'score': 0},
//      ],
//    },
//
////4.9
//    {
//      'questionText': 'Ποια κριτήρια πρέπει να πληροί ένα κράτος για να προσχωρήσει στην Ευρωπαϊκή Ένωση;',
//      'answers': [
//        {'text': 'Μάαστριχτ', 'score': 0},
//        {'text': 'Σένγκεν', 'score': 0},
//        {'text': 'Λισαβόνας', 'score': 0},
//        {'text': 'Κοπεγχάγης', 'score': 10},
//      ],
//    },
//
////4.10
//    {
//      'questionText': 'Δεν είναι ιδρυτικό μέλος της Ευρωπαϊκής Ένωσης:',
//      'answers': [
//        {'text': 'Το Βέλγιο', 'score': 0},
//        {'text': 'Το Λουξεμβούργο', 'score': 0},
//        {'text': 'Η Ισπανία', 'score': 10},
//        {'text': 'Οι Κάτω Χώρες', 'score': 0},
//      ],
//    },
//
//
////5.1
//    {
//      'questionText':
//      'Προτεραιότητα της κυπριακής Προεδρίας στον τομέα της νεολαίας ήταν:',
//      'answers': [
//        {'text': 'Η συμμετοχή και κοινωνική ενσωμάτωση των νέων', 'score': 10},
//        {'text': 'Ο εθελοντισμός', 'score': 0},
//        {'text': 'Η καινοτομία', 'score': 0},
//        {'text': 'Η εξασφάλιση περισσότερων θέσεων εργασίας', 'score': 0},
//      ],
//    },
////5.2
//    {
//      'questionText': 'Ποια ήταν η «Ευρωπαϊκή Πρωτεύουσα Νεολαίας» το 2019;',
//      'answers': [
//        {'text': 'Το Νόβι Σάντ', 'score': 10},
//        {'text': 'Η Μπράγκα', 'score': 0},
//        {'text': 'Η Θεσσαλονίκη', 'score': 0},
//        {'text': 'Το Παλέρμο', 'score': 0},
//      ],
//    },
//
////5.3
//    {
//      'questionText': 'Το Ευρωπαϊκό κοινοβούλιο Νέων καθιερώθηκε:',
//      'answers': [
//        {'text': 'Το 1992', 'score': 0},
//        {'text': 'Το 2000', 'score': 0},
//        {'text': 'Το 1982', 'score': 0},
//        {'text': 'Το 1987', 'score': 10},
//      ],
//    },
//
////5.4
//    {
//      'questionText':
//      'Σε ποιες προσωπικότητες απονεμήθηκε, το 2016, το Βραβείο Ζαχάρωφ του Ευρωπαϊκού κοινοβουλίου για την ελευθερίας της σκέψης;',
//      'answers': [
//        {
//          'text':
//          'Στη Μαλάλα Γιουσαφζάι (Malala Yousafzai) και την Αλίν Μουκόβι Νίιμα (Aline Mukovi Neema)',
//          'score': 0
//        },
//        {
//          'text': 'Στον Στινγκ (Sting) και τον Τζάστιν Τρυντό (Justin Trudeau)',
//          'score': 0
//        },
//        {
//          'text':
//          'Στη Νάντια Μουράντ Μπασί Ταχά (Nadia Murad Basee Taha) και την Λαμίγια Ατζί Μπασάρ (Lamiya Aji Bashar)',
//          'score': 10
//        },
//        {
//          'text':
//          'Στον Χουάν Μανουέλ Σάντος (Juan Manuel Santos) και τον Μπομπ Ντύλαν (Bob Dylan)',
//          'score': 0
//        },
//      ],
//    },
//
////5.5
//    {
//      'questionText': 'Το βραβείο Lux καθιερώθηκε το 2007 και έχει στόχο:',
//      'answers': [
//        {
//          'text': 'Το βραβείο Lux καθιερώθηκε το 2007 και έχει στόχο:',
//          'score': 0
//        },
//        {
//          'text':
//          'Τη βράβευση μαθητών που ασχολούνται με ευρωπαϊκά προγράμματα',
//          'score': 0
//        },
//        {
//          'text':
//          'Τη βράβευση δημοσιογράφων που ασχολούνται ενεργά με θέματα του Ευρωπαϊκού Κοινοβουλίου',
//          'score': 0
//        },
//        {
//          'text':
//          'Τη βράβευση ευρωπαϊκών ταινιών οι οποίες προωθούν τις ευρωπαϊκές αξίες',
//          'score': 10
//        },
//      ],
//    },
//
////5.6
//    {
//      'questionText': 'Στόχοι της πρωτοβουλίας «Νεολαία σε κίνηση» είναι:',
//      'answers': [
//        {'text': 'Η εκπαίδευση και απασχόληση των νέων', 'score': 10},
//        {'text': 'Η υγιής ψυχαγωγία', 'score': 0},
//        {'text': 'Η εθελοντική εργασία', 'score': 0},
//        {'text': 'Η προάσπιση των δικαιωμάτων των νέων', 'score': 0},
//      ],
//    },
////5.7
//    {
//      'questionText':
//      '«Διπλή καριέρα-Dualcareers» στον Αθλητισμό σημαίνει ότι οι αθλητές:',
//      'answers': [
//        {
//          'text':
//          'Υψηλών επιδόσεων έχουν τη δυνατότητα να σπουδάζουν παράλληλα με τις προπονήσεις τους',
//          'score': 10
//        },
//        {'text': 'Ασχολούνται με δύο επαγγέλματα', 'score': 0},
//        {
//          'text':
//          'Αποφασίζουν αν θα ασχοληθούν με δύο πανεπιστημιακές κατευθύνσεις',
//          'score': 0
//        },
//        {'text': 'Δεν γνωρίζουν τί ακριβώς θα ακολουθήσουν', 'score': 0},
//      ],
//    },
//
////5.8
//    {
//      'questionText':
//      'Οι δράσεις για την πρωτοβουλία «Νεολαία σε κίνηση» άρχισαν να τίθενται σε εφαρμογή:',
//      'answers': [
//        {'text': 'Το 2012', 'score': 0},
//        {'text': 'Το 2010', 'score': 10},
//        {'text': 'Το 2001', 'score': 0},
//        {'text': 'Το 2000', 'score': 0},
//      ],
//    },
//
////5.9
//    {
//      'questionText':
//      'Ως πολίτης της ΕΕ, έχετε το δικαίωμα να κάνετε πανεπιστημιακές σπουδές σε οποιαδήποτε χώρα της ΕΕ.',
//      'answers': [
//        {'text': 'Ναι', 'score': 10},
//        {'text': 'Όχι', 'score': 0},
//        {'text': 'Εναπόκειται στην πολιτική του κάθε κράτους μέλους','score': 0},
//        {'text': 'Ναι, αλλά θα καταβάλλετε υψηλότερα δίδακτρα', 'score': 0},
//      ],
//    },
//
////5.10
//    {
//      'questionText':
//      'Υπάρχει αυτόματη αναγνώριση των τίτλων σπουδών σε όλη την Ευρώπη;',
//      'answers': [
//        {'text': 'Ναι', 'score': 0},
//        {
//          'text':
//          'Κάθε χώρα εφαρμόζει τους δικούς της κανόνες για την αναγνώριση πτυχίων',
//          'score': 10
//        },
//        {'text': 'Θα ισχύει η αυτόματη αναγνώριση από το 2020', 'score': 0},
//        {
//          'text': 'Μόνο εάν ο κάτοχος του πτυχίου εγκατασταθεί μόνιμα στη χώρα',
//          'score': 0
//        },
//      ],
//    },
//
//
////6.1
//    {
//      'questionText': 'Πότε αποφασίστηκε για πρώτη φορά στη διάσκεψη αρχηγών κρατών και κυβερνήσεων της Ευρώπης ότι ήταν αναγκαία μια κοινοτική πολιτική περιβάλλοντος;',
//      'answers': [
//        {'text': 'Το 1972', 'score': 10},
//        {'text': 'Το 1952', 'score': 0},
//        {'text': 'Το 1962', 'score': 0},
//        {'text': 'Το 1982', 'score': 0},
//      ],
//    },
//
////6.2
//    {
//      'questionText': 'Πόσες νομοθετικές αποφάσεις έχει εγκρίνει η κοινότητα για περιορισμό της ρύπανσης;',
//      'answers': [
//        {'text': '26', 'score': 0},
//        {'text': '250', 'score': 10},
//        {'text': '2.500', 'score': 0},
//        {'text': '25.000', 'score': 0},
//      ],
//    },
//
////6.3
//    {
//      'questionText': 'Η κοινοτική περιβαλλοντική πολιτική βασίζεται στις αρχές της προφύλαξης, της πρόληψης, της αποκατάστασης της ρύπανσης στην πηγή και:',
//      'answers': [
//        {'text': 'στην αρχή «ο ρυπαίνων πληρώνει»', 'score': 10},
//        {'text': 'στην αρχή της ισότητας', 'score': 0},
//        {'text': 'στην αρχή «ο ρυπαίνων φταίει»', 'score': 0},
//        {'text': 'στην αρχή της αναλογικότητας', 'score': 0},
//      ],
//    },
//
////6.4
//    {
//      'questionText': 'Ποια συνθήκη ενίσχυσε τη σημασία της περιβαλλοντικής πολιτικής της Ευρωπαϊκής Ένωσης;',
//      'answers': [
//        {'text': 'Η Συνθήκη του Μάαστριχτ', 'score': 0},
//        {'text': 'Η Συνθήκη του Άμστερνταμ', 'score': 10},
//        {'text': 'Η Συνθήκη της Λισαβόνας', 'score': 0},
//        {'text': 'Η Συνθήκη των Βρυξελλών', 'score': 0},
//      ],
//    },
//
////6.5
//    {
//      'questionText': 'Πόση μείωση CO2 μπορεί να επιφέρει η ανακύκλωση 1 kg πλαστικού, σε σύγκριση με την κατασκευή νέων συσκευασιών;',
//      'answers': [
//        {'text': '150 kg', 'score': 0},
//        {'text': '15 kg', 'score': 0},
//        {'text': '500 kg', 'score': 0},
//        {'text': '1,5 kg', 'score': 10},
//      ],
//    },
//
////6.6
//    {
//      'questionText': 'Ποια χρονολογία όρισε η ΕΕ για απαγόρευση των πλαστικών μιας χρήσης;',
//      'answers': [
//        {'text': '2021', 'score': 10},
//        {'text': '2023', 'score': 0},
//        {'text': '2024', 'score': 0},
//        {'text': '2026', 'score': 0},
//      ],
//    },
//
////6.7
//    {
//      'questionText': 'Ποιο από τα παρακάτω δεν θεωρείται πλαστικό μιας χρήσης;',
//      'answers': [
//        {'text': 'Πλαστικά μαχαιροπήρουνα', 'score': 0},
//        {'text': 'Πλαστικά καλαμάκια', 'score': 0},
//        {'text': 'Επαναχρησιμοποιούμενα δοχεία φαγητού', 'score': 10},
//        {'text': 'Μπατονέτες', 'score': 0},
//      ],
//    },
//
////6.8
//    {
//      'questionText': 'Ένα στα πόσα παιδιά στη ΕΕ πάσχουν από άσθμα;',
//      'answers': [
//        {'text': '7', 'score': 10},
//        {'text': '17', 'score': 0},
//        {'text': '27', 'score': 0},
//        {'text': '37', 'score': 0},
//      ],
//    },
//
////6.9
//    {
//      'questionText': 'Η στρατηγική της ΕΕ για την αειφόρο ανάπτυξη ζητεί η οικονομική, περιβαλλοντική και ποια άλλη πολιτική να συμπληρώνουν η μια την άλλη;',
//      'answers': [
//        {'text': 'Επιχειρηματική', 'score': 0},
//        {'text': 'Ιατροφαρμακευτική', 'score': 0},
//        {'text': 'Αγροτική', 'score': 0},
//        {'text': 'Κοινωνική', 'score': 10},
//      ],
//    },
//
////6.10
//    {
//      'questionText': 'Κατά ποιο ποσοστό δεσμεύτηκαν τα κράτη μέλη της ΕΕ, να μειώσουν τις εκπομπές αερίων του θερμοκηπίου κατά την περίοδο 2008-2012, κάτω από τα επίπεδα του 1990;',
//      'answers': [
//        {'text': '0,8%', 'score': 0},
//        {'text': '8%', 'score': 10},
//        {'text': '18%', 'score': 0},
//        {'text': '180%', 'score': 0},
//      ],
//    },
//
//
////7.1
//    {
//      'questionText': 'Πόσα από τα κράτη μέλη της ΕΕ έχουν ως νόμισμά τους το ευρώ;',
//      'answers': [
//        {'text': '14', 'score': 0},
//        {'text': '18', 'score': 0},
//        {'text': '12', 'score': 0},
//        {'text': '19', 'score': 10},
//      ],
//    },
//
////7.2
//    {
//      'questionText': 'Ποια Αρχή είναι υπεύθυνη για τη διαχείριση των νομισματικών ζητημάτων στην ΕΕ;',
//      'answers': [
//        {'text': 'Η Ευρωπαϊκή Κεντρική Τράπεζα', 'score': 10},
//        {'text': 'Η Κομισιόν', 'score': 0},
//        {'text': 'Η Τρόικα', 'score': 0},
//        {'text': 'Το Διεθνές Νομισματικό Ταμείο', 'score': 0},
//      ],
//    },
//
////7.3
//    {
//      'questionText': 'Σε ποια πόλη λήφθηκε η απόφαση για τη δημιουργία μιας οικονομικής και νομισματικής ένωσης;',
//      'answers': [
//        {'text': 'Βερολίνο', 'score': 0},
//        {'text': 'Μάαστριχτ', 'score': 10},
//        {'text': 'Παρίσι', 'score': 0},
//        {'text': 'Κοπεγχάγη', 'score': 0},
//      ],
//    },
//
////7.4
//    {
//      'questionText': 'Για ποιο από τα πιο κάτω ποσά δεν υπάρχει χαρτονόμισμα του ευρώ;',
//      'answers': [
//        {'text': '20 ευρώ', 'score': 0},
//        {'text': '100 ευρώ', 'score': 0},
//        {'text': '250 ευρώ', 'score': 10},
//        {'text': '500 ευρώ', 'score': 0},
//      ],
//    },
//
////7.5
//    {
//      'questionText': 'Σε ποιο κυπριακό κέρμα του ευρώ απεικονίζεται το καράβι της Κερύνειας;',
//      'answers': [
//        {'text': 'Των 2 σεντ', 'score': 0},
//        {'text': 'Των 5 σεντ', 'score': 0},
//        {'text': 'Των 10 σεντ', 'score': 10},
//        {'text': 'Των 2 ευρώ', 'score': 0},
//      ],
//    },
//
////7.6
//    {
//      'questionText': 'Σε πόσα σεντ υποδιαιρείτο η κυπριακή λίρα που αντικαταστάθηκε από το ευρώ;',
//      'answers': [
//        {'text': '1000', 'score': 0},
//        {'text': '100', 'score': 10},
//        {'text': '200', 'score': 0},
//        {'text': '500', 'score': 0},
//      ],
//    },
//
////7.7
//    {
//      'questionText': 'Το χαρτονόμισμα της μίας κυπριακής λίρας ήταν χρώματος:',
//      'answers': [
//        {'text': 'Γαλάζιου', 'score': 0},
//        {'text': 'Πράσινου', 'score': 0},
//        {'text': 'Μπορντό', 'score': 0},
//        {'text': 'Καφέ', 'score': 10},
//      ],
//    },
//
////7.8
//    {
//      'questionText': 'Πότε κυκλοφόρησαν τα χαρτονομίσματα και τα κέρματα του ευρώ;',
//      'answers': [
//        {'text': '1999', 'score': 0},
//        {'text': '2000', 'score': 0},
//        {'text': '2002', 'score': 10},
//        {'text': '2004', 'score': 0},
//      ],
//    },
//
////7.9
//    {
//      'questionText': 'Ποια ήταν η τελευταία χώρα που εντάχθηκε στη ζώνη του ευρώ;',
//      'answers': [
//        {'text': 'Κύπρος', 'score': 0},
//        {'text': 'Σλοβακία', 'score': 0},
//        {'text': 'Σλοβενία', 'score': 0},
//        {'text': 'Λιθουανία', 'score': 10},
//      ],
//    },
//
////7.10
//    {
//      'questionText': 'Ποιο ήταν το νόμισμα της Γερμανίας πριν από το ευρώ;',
//      'answers': [
//        {'text': 'Μάρκο', 'score': 10},
//        {'text': 'Λίρα', 'score': 0},
//        {'text': 'Φράγκο', 'score': 0},
//        {'text': 'Κορόνα', 'score': 0},
//      ],
//    },
//
//
////8.1
//    {
//      'questionText': 'Σύμφωνα με τη συνθήκη του Μάαστριχτ, κάθε πολίτης της Ένωσης, ανεξαρτήτως εθνικότητας, έχει το δικαίωμα:',
//      'answers': [
//        {'text': 'Να ψηφίζει και να είναι υποψήφιος στη χώρα της ΕΕ στην οποία ζει ', 'score': 10},
//        {'text': 'Προστασίας των προσωπικών του δεδομένων', 'score': 0},
//        {'text': 'Δίκαιης δίκης, πολιτικής ή ποινικής', 'score': 0},
//        {'text': 'Ελευθερίας της έκφρασης', 'score': 0},
//      ],
//    },
//
////8.2
//    {
//      'questionText': 'Τα δικαιώματα των πολιτών της ΕΕ προστατεύονται από:',
//      'answers': [
//        {'text': 'Την αρμόδια αρχή κάθε χώρας', 'score': 0},
//        {'text': 'Τον Χάρτη των Θεμελιωδών Δικαιωμάτων', 'score': 10},
//        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
//        {'text': 'Τον Ευρωπαίο Επίτροπο', 'score': 0},
//      ],
//    },
//
////8.3
//    {
//      'questionText': 'Ο Χάρτης των Θεμελιωδών Δικαιωμάτων της Ευρωπαϊκής Ένωσης διακηρύχθηκε:',
//      'answers': [
//        {'text': 'Το 2000', 'score': 10},
//        {'text': 'Το 2007', 'score': 0},
//        {'text': 'Το 2004', 'score': 0},
//        {'text': 'Το 1998', 'score': 0},
//      ],
//    },
//
////8.4
//    {
//      'questionText': 'Ο Χάρτης κατέστη νομικά δεσμευτικός στο σύνολο της ΕΕ με την έναρξη ισχύος της συνθήκης:',
//      'answers': [
//        {'text': 'Του Άμστερνταμ', 'score': 0},
//        {'text': 'Της Νίκαιας', 'score': 0},
//        {'text': 'Για τη θέσπιση Συντάγματος της Ευρώπης', 'score': 0},
//        {'text': 'Της Λισαβόνας', 'score': 10},
//      ],
//    },
//
////8.5
//    {
//      'questionText': 'Ο σεβασμός της ανθρώπινης αξιοπρέπειας και των δικαιωμάτων του ανθρώπου, η ελευθερία, η δημοκρατία, η ισότητα και το κράτος δικαίου αποτελούν:',
//      'answers': [
//        {'text': 'Αξίες που εφαρμόζονται μόνο σε μερικά κράτη μέλη', 'score': 0},
//        {'text': 'Κοινές αξίες της ΕΕ', 'score': 10},
//        {'text': 'Ακατοχύρωτες αξίες', 'score': 0},
//        {'text': 'Αξίες που παραβιάζονται', 'score': 0},
//      ],
//    },
//
////8.6
//    {
//      'questionText': 'Το Ευρωπαϊκό Δικαστήριο Δικαιωμάτων του Ανθρώπου εδρεύει:',
//      'answers': [
//        {'text': 'Στις Βρυξέλλες', 'score': 0},
//        {'text': 'Στο Λουξεμβούργο', 'score': 0},
//        {'text': 'Στη Φρανκφούρτη', 'score': 0},
//        {'text': 'Στο Στρασβούργο', 'score': 10},
//      ],
//    },
//
////8.7
//    {
//      'questionText': 'Το Ευρωπαϊκό Δικαστήριο:',
//      'answers': [
//        {'text': 'Μεσολαβεί εκ μέρους σας ενώπιον της αρχής κατά της οποίας υποβά��λετε παράπονο', 'score': 0},
//        {'text': 'Σας βοηθά στην ανεύρεση ή πληρωμή δικηγόρου για τη σύνταξη της προσφυγής', 'score': 0},
//        {'text': 'Δεν λειτουργεί ���� εφετείο ως προς τα εθνικά δικαστήρια', 'score': 10},
//        {'text': 'Είναι αρμόδιο για την εκτέλεση των αποφάσεών του', 'score': 0},
//      ],
//    },
//
////8.8
//    {
//      'questionText': 'Οι πολίτες μπορούν να υποβάλουν αναφορά για να καταγγείλουν κάθε παραβίαση του κοι��οτικού δικαίου:',
//      'answers': [
//        {'text': 'Στην Ισλαμική Διάσκεψη', 'score': 0},
//        {'text': 'Στο Ευρωπαϊκό Κοινοβούλιο', 'score': 10},
//        {'text': 'Στο Συμβούλιο Ασφαλείας του ΟΗΕ', 'score': 0},
//        {'text': 'Στη Βασίλισσα της Αγγλίας', 'score': 0},
//      ],
//    },
//
////8.9
//    {
//      'questionText': 'Η θέση του Ευρωπαίου Διαμεσολαβητή δημιουργήθηκε με τη συνθήκη για την Ευρωπαϊκή Ένωση:',
//      'answers': [
//        {'text': 'Το 1986', 'score': 0},
//        {'text': 'Το 1992', 'score': 10},
//        {'text': 'Το 2004', 'score': 0},
//        {'text': 'Το 2001', 'score': 0},
//      ],
//    },
//
////8.10
//    {
//      'questionText': 'Διαμεσολαβητής εκλέγεται από το Ευρωπαϊκό κοινοβούλιο και η θητεία του είναι:',
//      'answers': [
//        {'text': 'Πενταετής', 'score': 10},
//        {'text': 'Δεκαετής', 'score': 0},
//        {'text': 'Ετήσια', 'score': 0},
//        {'text': 'Εξαμηνιαία', 'score': 0},
//      ],
//    },
//
//
////9.1
//    {
//      'questionText': 'Τις βάσεις για μια κοινή Εξωτερική Πολιτική και Πολιτική Ασφάλειας (KEΠΠA) της ΕΕ έθεσε η Συνθήκη:',
//      'answers': [
//        {'text': 'Της Ρώμης', 'score': 0},
//        {'text': 'Ζυρίχης-Λονδίνου', 'score': 0},
//        {'text': 'Της Λωζάνης', 'score': 0},
//        {'text': 'Του Μάαστριχτ', 'score': 10},
//      ],
//    },
//
////9.2
//    {
//      'questionText': 'Ποιου σώματος χρειάζεται η συγκατάθεση για τον διορισμό του Ύπατου Εκπροσώπου της ΕΕ για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας;',
//      'answers': [
//        {'text': 'Συμβουλίου της Ευρώπης', 'score': 0},
//        {'text': 'Επιτροπής των Περιφερειών', 'score': 0},
//        {'text': 'Ευρωκοινοβουλίου', 'score': 10},
//        {'text': 'SEDE', 'score': 0},
//      ],
//    },
//
////9.3
//    {
//      'questionText': 'Οι πιο σημαντικοί τομείς της κοινής Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας (ΚΕΠΠΑ) είναι:',
//      'answers': [
//        {'text': 'Διατήρηση της ειρήνης και ενίσχυση της διεθνούς ασφάλειας', 'score': 10},
//        {'text': 'Ανταγωνισμός και Αλιεία', 'score': 0},
//        {'text': 'Προσωπικά δεδομένα', 'score': 0},
//        {'text': 'Αθλητισμός', 'score': 0},
//      ],
//    },
//
////9.4
//    {
//      'questionText': 'Τι χρηματικό ποσό θα διαθέσει η Ευρωπαϊκή Επιτροπή ως αναπτυξιακή βοήθεια στις χώρες Αφρικής, καραϊβικής και Ειρηνικού τα έτη 2014-2020;',
//      'answers': [
//        {'text': '30,5 δις ευρώ', 'score': 10},
//        {'text': '500 δις ευρώ', 'score': 0},
//        {'text': '1 δις ευρώ', 'score': 0},
//        {'text': '800 εκ. ευρώ', 'score': 0},
//      ],
//    },
//
////9.5
//    {
//      'questionText': 'Πόσο τοις εκατό της παγκόσμιας αναπτυξιακής βοήθειας χορηγεί η ΕΕ (στοιχεία 2017);',
//      'answers': [
//        {'text': '50%', 'score': 0},
//        {'text': '60%', 'score': 10},
//        {'text': '80%', 'score': 0},
//        {'text': '10%', 'score': 0},
//      ],
//    },
//
////9.6
//    {
//      'questionText': 'Μεγαλύτερη αδυναμία της εξωτερικής πολιτικής της ΕΕ θεωρείται:',
//      'answers': [
//        {'text': 'Ο ενιαίος πολιτικός λόγος που εκφράζει', 'score': 0},
//        {'text': 'Η έλλειψη ενιαίου πολιτικού λόγου', 'score': 10},
//        {'text': 'Η έλλειψη κοινής γεωγραφίας', 'score': 0},
//        {'text': 'Δεν έχει αδυναμίες', 'score': 0},
//      ],
//    },
//
////9.7
//    {
//      'questionText': 'Ποια συμφωνία διαμορφώνει το πλαίσιο συνεργασίας ΕΕ-ΝΑΤΟ σε θέματα ασφάλειας;',
//      'answers': [
//        {'text': 'Της Φρανκφούρτης', 'score': 0},
//        {'text': 'Της Αθήνας', 'score': 0},
//        {'text': 'Της Νίκαιας', 'score': 0},
//        {'text': 'Berlin Plus', 'score': 10},
//      ],
//    },
//
////9.8
//    {
//      'questionText': 'Οι πρώτες στρατιωτικές αποστολές της ΕΕ πραγματοποιήθηκαν:',
//      'answers': [
//        {'text': 'Στην Κύπρο', 'score': 0},
//        {'text': 'Σε Βαλκάνια και Κόνγκο', 'score': 10},
//        {'text': 'Στην Κίνα', 'score': 0},
//        {'text': 'Στη Βραζιλία', 'score': 0},
//      ],
//    },
//
////9.9
//    {
//      'questionText': 'Οι στρατιωτικές ομάδες μάχης της ΕΕ είναι:',
//      'answers': [
//        {'text': 'Γερμανικής εθνικότητας', 'score': 0},
//        {'text': 'Βρετανικής εθνικότητας', 'score': 0},
//        {'text': 'Γαλλικής εθνικότητας', 'score': 0},
//        {'text': 'Πολυεθνικές', 'score': 10},
//      ],
//    },
//
////9.10
//    {
//      'questionText': 'Από ποιες χώρες εισάγει φυσικό αέριο η ΕΕ;',
//      'answers': [
//        {'text': 'Ρωσία, Νορβηγία, Αλγερία', 'score': 10},
//        {'text': 'Ελβετία, Πακιστάν, ΗΠΑ', 'score': 0},
//        {'text': 'Καζακστάν, Αίγυπτο, Ισραήλ', 'score': 0},
//        {'text': 'Αργεντινή, Ελβετία, Νησιά Φαρόε', 'score': 0},
//      ],
//    },
//
//
////10.1
//    {
//      'questionText': 'Τι πληθυσμό έχει η Ευρώπη των 28 (στοιχεία 2018);',
//      'answers': [
//        {'text': 'Περίπου 300 εκατομμύρια', 'score': 0},
//        {'text': 'Περίπου 1 δισεκατομμύριο', 'score': 0},
//        {'text': 'Περίπου 500 εκατομμύρια', 'score': 10},
//        {'text': 'Περίπου 800 εκατομμύρια', 'score': 0},
//      ],
//    },
//
////10.2
//    {
//      'questionText': 'Ποια χώρα της ΕΕ έχει τη μεγαλύτερη έκταση;',
//      'answers': [
//        {'text': 'Η Κροατία', 'score': 0},
//        {'text': 'Η Γαλλία', 'score': 10},
//        {'text': 'Η Ισπανία', 'score': 0},
//        {'text': 'Η Γερμανία', 'score': 0},
//      ],
//    },
//
////10.3
//    {
//      'questionText': 'Σύμφωνα με το Ευρωβαρόμετρο της Άνοιξης 2019, τι ποσοστό των Ευρωπαίων πολιτών απάντησε ότι η ζωή τους θα είναι καλύτερη σε ένα χρόνο;',
//      'answers': [
//        {'text': '26%', 'score': 0},
//        {'text': '32%', 'score': 10},
//        {'text': '43%', 'score': 0},
//        {'text': '49%', 'score': 0},
//      ],
//    },
//
////10.4
//    {
//      'questionText': 'Τι δεν ισχύει για τα χαρτονομίσματα του ευρώ;',
//      'answers': [
//        {'text': 'Είναι σε κάθε χώρα διαφορετικά', 'score': 10},
//        {'text': 'Είναι ίδια σε όλες τις χώρες', 'score': 0},
//        {'text': 'Απεικονίζουν γέφυρες που συμβολίζουν την επικοινωνία', 'score': 0},
//        {'text': 'Απεικονίζουν παράθυρα και πύλες που συμβολίζουν την ευρύτητα', 'score': 0},
//      ],
//    },
//
////10.5
//    {
//      'questionText': 'Η Γερμανία, με πληθυσμό πάνω από 81 εκατομμύρια, τι ποσοστό του ευρωπαϊκού πληθυσμού έχει;',
//      'answers': [
//        {'text': 'Σχεδόν το μισό', 'score': 0},
//        {'text': 'Το ένα τέταρτο', 'score': 0},
//        {'text': 'Γύρω στο 16%', 'score': 10},
//        {'text': 'Ένα 10%', 'score': 0},
//      ],
//    },
//
////10.6
//    {
//      'questionText': 'Οι τρεις μεγαλύτερες σε έκταση χώρες της ΕΕ είναι με τη σειρά:',
//      'answers': [
//        {'text': 'Γαλλία, Ισπανία, Γερμανία', 'score': 0},
//        {'text': 'Γαλλία, Ισπανία, Ηνωμένο Βασίλειο', 'score': 0},
//        {'text': 'Γαλλία, Ισπανία, Σουηδία', 'score': 10},
//        {'text': 'Γαλλία, Ισπανία, Πολωνία', 'score': 0},
//      ],
//    },
//
////10.7
//    {
//      'questionText': 'Η Γαλλία, που είναι η μεγαλύτερη χώρα της ΕΕ των 28, τι ποσοστό του συνολικού εδάφους έχει;',
//      'answers': [
//        {'text': '14,8%', 'score': 10},
//        {'text': '25,3%', 'score': 0},
//        {'text': '8%', 'score': 0},
//        {'text': '9,5%', 'score': 0},
//      ],
//    },
//
////10.8
//    {
//      'questionText': 'Σύμφωνα με την απογραφή του 2011, τι ποσοστό του πληθυσμού της Κύπρου είναι άνω των 65 ετών;',
//      'answers': [
//        {'text': '10%', 'score': 0},
//        {'text': '13%', 'score': 10},
//        {'text': '20%', 'score': 0},
//        {'text': '22%', 'score': 0},
//      ],
//    },
//
////10.9
//    {
//      'questionText': 'Χώρες με πληθυσμό γύρω στα 10 εκατομμύρια είναι:',
//      'answers': [
//        {'text': 'Η Πορτογαλία, η Ουγγαρία, η Τσεχία και το Βέλγιο', 'score': 10},
//        {'text': 'Η Μάλτα, το Λουξεμβούργο, η Λιθουανία και η Λετονία', 'score': 0},
//        {'text': 'Η Πορτογαλία, η Γαλλία, το Ηνωμένο Βασίλειο και η Πολωνία', 'score': 0},
//        {'text': 'Η Βουλγαρία, η Ρουμανία, η Ελλάδα και η Κύπρος', 'score': 0},
//      ],
//    },
//
////10.10
//    {
//      'questionText': 'Το νόμισμα της Ελλάδας πριν αντικατασταθεί από το ευρώ ήταν:',
//      'answers': [
//        {'text': 'Η μνα', 'score': 0},
//        {'text': 'Η δραχμή', 'score': 10},
//        {'text': 'Ο παράς', 'score': 0},
//        {'text': 'Η ελληνική λίρα', 'score': 0},
//      ],
//    },
//
//
//  ];
//
//
//  var _qnum = 0;
//  var _countnum = 1;
//  var _totalScore = 0;
//  int seconds = 10;
//  bool isCorrect = false;
//
//  void _answerQuestion(int score) {
//    _totalScore = _totalScore + score;
//
//    setState(() {
//      _qnum = _qnum + 1;
//      _countnum = _countnum + 1;
//    });
//
////    print(_qnum);  //test
//
////    if (_qnum < 10) {  //test
////      print("we have more questions");
////    } else {
////      print('No more questions');
////    }
//  }
//
//  String get resultPhrase {
//    String resultText;
//    if (_totalScore <= 40) {
//      resultText = 'You need more practice!';
//    } else if (_totalScore <= 70) {
//      resultText = 'Good job!';
//    } else {
//      resultText = 'Congratulations!!!';
//    }
//    return resultText;
//  }
//
//
//  @override
//  Widget build(BuildContext context) {
//    int randnum;
//    randnum = Random().nextInt(100);
//    SystemChrome.setPreferredOrientations(
//        [DeviceOrientation.portraitDown, DeviceOrientation.portraitUp]);
//    return MaterialApp(
//      home: _qnum < 10
//          ? Scaffold(
//        appBar: AppBar(
//          backgroundColor: Colors.indigoAccent[700],
//          title: SafeArea(
//            child: Row(
//              mainAxisAlignment: MainAxisAlignment.spaceBetween,
//              children: <Widget>[
//                Container(
//                  child: Text(
//                    '$_countnum/10',
//                    style: TextStyle(
//                      fontSize: 28,
//                    ),
//                  ),
//                ),
////                      Container(   //for future updates - ADD TIMER
////                        child: Text(
////                          '        $seconds',
////                          style: TextStyle(
////                            fontSize: 28,
////                          ),
////                        ),
////                      ),
//                Container(
//                  child: Text(
//                    'Score: $_totalScore',
//                    style: TextStyle(
//                      fontSize: 28,
//                    ),
//                  ),
//                ),
//              ],
//            ),
//          ),
//        ),
//        body: Column(
//          mainAxisAlignment: MainAxisAlignment.spaceBetween,
//          children: [
//            SizedBox(),
//            Column(
//              children: <Widget>[
//                Row(
//                  mainAxisAlignment: MainAxisAlignment.center,
//                  children: <Widget>[
//                    new Flexible(
////                          margin: EdgeInsets.fromLTRB(0, 5, 0, 0),
//                      child: Container(
//                        margin: EdgeInsets.fromLTRB(10, 5, 10, 0),
//                        //padding: EdgeInsets.fromLTRB(30, 0, 30, 0),
//                        child: Column(
//                          crossAxisAlignment: CrossAxisAlignment.center,
//                          children: <Widget>[
//                            new Text(
//                              questions[randnum]['questionText'],
//                              style: new TextStyle(
//                                color: Colors.black,
//                                fontSize: 28.0,
//                                fontWeight: FontWeight.bold,
//                              ),
//                              textAlign: TextAlign.center,
//                            ),
//                          ],
//                        ),
//                      ),
//                    ),
//                  ],
//                ),
//              ],
//            ),
//            Column(
//              crossAxisAlignment: CrossAxisAlignment.stretch,
//              children: [
//                ...(questions[randnum]['answers']
//                as List<Map<String, Object>>)
//                    .map((answer) {
//                  return Answer(() => _answerQuestion(answer['score']),
//                      answer['text']);
//                }).toList()
//              ],
//            ),
//          ],
//        ),
//      )
//          : Scaffold(
//        backgroundColor: Colors.indigoAccent[700],
//        body: Column(
//          mainAxisAlignment: MainAxisAlignment.center,
//          children: <Widget>[
//            Text(
//              '$resultPhrase',
//              style: TextStyle(
//                color: Colors.white,
//                fontSize: getRelativeSize(context, 12.5,
//                fontWeight: FontWeight.bold,
//              ),
//              textAlign: TextAlign.center,
//            ),
//            Text(
//              'Total score: $_totalScore/100',
//              style: TextStyle(
//                color: Colors.white,
//                fontSize: getRelativeSize(context, 11.5,
//                fontWeight: FontWeight.bold,
//              ),
//              textAlign: TextAlign.center,
//            ),
//            Column(
//              crossAxisAlignment: CrossAxisAlignment.stretch,
//              children: <Widget>[
//                Container(
//                  height: 100.0,
//                  margin: EdgeInsets.fromLTRB(20, 30, 20, 0),
//                  child: ClipRRect(
//                    borderRadius: BorderRadius.circular(20.0),
//                    child: RaisedButton(
//                      onPressed: () {
//                        Navigator.pushReplacement(
//                          context,
//                          MaterialPageRoute(
//                              builder: (context) => questionpage()),
//                        );
//                      },
//                      child: Text(
//                        'Play Again',
//                        style: new TextStyle(
//                            color: Colors.black,
//                            fontSize: getRelativeSize(context, 12,
//                            fontWeight: FontWeight.bold),
//                      ),
//                      color: Colors.amberAccent,
//                    ),
//                  ),
//                ),
//              ],
//            ),
//            Column(
//              crossAxisAlignment: CrossAxisAlignment.stretch,
//              children: <Widget>[
//                Container(
//                  height: 100.0,
//                  margin: EdgeInsets.fromLTRB(20, 20, 20, 0),
//                  child: ClipRRect(
//                    borderRadius: BorderRadius.circular(20.0),
//                    child: RaisedButton(
//                      onPressed: () {
//                        Navigator.pushReplacement(
//                          context,
//                          MaterialPageRoute(
//                              builder: (context) => startpage()),
//                        );
//                      },
//                      child: Text(
//                        'Main Menu',
//                        style: new TextStyle(
//                            color: Colors.black,
//                            fontSize: getRelativeSize(context, 12,
//                            fontWeight: FontWeight.bold),
//                      ),
//                      color: Colors.amberAccent,
//                    ),
//                  ),
//                ),
//              ],
//            ),
//          ],
//        ),
//      ),
//    );
//  }
//}
